{
    "asin": "1979286973",
    "title": "SEO 2018 Learn Search Engine Optimization With Smart Internet Marketing Strateg: Learn SEO with smart internet marketing strategies",
    "brand": "Adam Clarke Harper Collins",
    "feature": null,
    "description": "- Inner mechanics of Google's algorithm, and how to rank your site at the top. - Recent Google updates—Mobile First Index, Google Speed update, Google Hawk update, Google FRED update, and more... - Potential updates coming up in 2018. - Steps to recover from Google penalties.Adam Clarke is an SEO entrepreneur, best selling author, business advisor and search engine optimization professional. After learning programming at the age of 7, and later dropping out of college to start an Internet marketing agency, Adam has since launched several successful Internet businesses and has become an authority on business strategy and SEO. Best known for his best-selling book SEO 2017, Adam has achieved thousands of number #1 rankings in Google and grown dozens of business online. Now you can read the ground-breaking book that reveals the inner workings of Google, and learn how to grow any business online. Adam Clarke is a Google Analytics and Google AdWords certified professional with the Google Partners program.",
    "price": 1527.0,
    "listPrice": 1697.0,
    "prime": true,
    "dimensions": {
        "weight": 78.75,
        "length": 600.0,
        "width": 50.0,
        "height": 900.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51XNh75aMJL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Gaz8cQjML._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "283155",
            "title": "Books"
        },
        {
            "node": "5",
            "title": "Computers & Technology"
        },
        {
            "node": "69766",
            "title": "Internet & Social Media"
        },
        {
            "node": "69771",
            "title": "Online Searching"
        }
    ],
    "similar": [
        "B015F6ZZC6",
        "1989025013",
        "1540537692",
        "1599184427",
        "159918611X",
        "0692094555",
        "1984909932",
        "1522005676",
        "B06X6JMMXF",
        "1599186128",
        "0974320625",
        "1983805912",
        "B077R8B8SG",
        "B00NH0XZR0",
        "B0777FDL2H",
        "1717020135",
        "B0744PJSC8",
        "B075HGN2L5",
        "B01M3T0PEU"
    ],
    "rating": "4.5"
}