{
    "asin": "B0002QB9NE",
    "title": "O'Keeffe's K0320001 for Healthy Feet Foot Cream, 3.2 oz, Jar",
    "brand": "O'Keeffe's",
    "feature": [
        "O’Keeffe’s for Healthy Feet Foot Cream is a concentrated foot cream that heals, relieves and repairs extremely dry, cracked feet",
        "Creates a protective layer on the skin’s surface that instantly boosts moisture levels and helps prevent further moisture loss",
        "O’Keeffe’s for Healthy Feet Foot Cream works fast; Most people start seeing improvements in their dry cracked feet in only a few days",
        "Our Healthy Feet Foot Cream cream contains increased levels of Allantoin; The formula helps to penetrate thicker and rougher surface skin on the feet",
        "Apply the foot cream to exfoliated skin at bedtime and after bathing, as these are the most effective times for moisturizing extremely dry feet"
    ],
    "description": "O’Keeffe’s for Healthy Feet Foot Cream is a concentrated foot cream that heals, relieves and repairs extremely dry, cracked feet. Containing a high concentration of glycerin, O’Keeffe’s for Healthy Feet draws in and retains moisture, which is necessary for healthy-feeling, hydrated skin. Our Healthy Feet Foot Cream contains increased levels of Allantoin versus Working Hands Hand Cream. The formula helps to penetrate thicker and rougher surface skin on the feet. It is safe for people with diabetes. When used daily, O'Keeffe's for Healthy Feet is clinically proven to instantly boost moisture levels, help prevent further moisture loss, create a protective barrier on the skin's surface, make a difference you will feel within days. Foot Representative Photos: Before and after foot images from two week usage period. Cream was applied twice daily. Results may vary. 100% Money Back Guarantee - If you are not fully satisfied with the performance of O’Keeffe’s products, we will refund 100% of the purchase price. Simply return the unused portion of the product and your receipt to 2105 E. Kemper Road, Cincinnati, OH 45227 for a prompt refund. Click on the O'Keeffe's link at the top of this page to shop the O'Keeffe's Amazon Brand Store.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 670.0,
        "width": 350.0,
        "height": 120.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51K%2Bo6C6nRL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DMblXJRuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410gtnk%2BccL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51K3rXEhe9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51t1ScS-TUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DKI1zeYcL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size Name:",
            "value": "1 - Pack"
        }
    ],
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "17242866011",
            "title": "Foot, Hand & Nail Care"
        },
        {
            "node": "11062211",
            "title": "Foot & Hand Care"
        },
        {
            "node": "3780041",
            "title": "Foot Creams & Lotions"
        }
    ],
    "similar": [
        "B00JU1TYU2",
        "B07C89YD45",
        "B00P46W66Q",
        "B071DTV16W",
        "B06WW72KCD",
        "B01M2AAHJA",
        "B077NJH7LQ",
        "B01N0H3R8X",
        "B00756HQNQ",
        "B01MPY8RYY",
        "B076JM9T1K",
        "B07FFH78Y8",
        "B01F38WKW4",
        "B01M047N2Q",
        "B0762MN3RT",
        "B01DPY4MTM",
        "B01M72IZV6",
        "B01F38WKRE",
        "B016X8DBVM",
        "B01M72IVU1",
        "B000GCNC2U",
        "B073VZ6X4M",
        "B007FZR99I",
        "B01MG659UE",
        "B01DPY4M2O",
        "B00121UVU0",
        "B07CY63JC6",
        "B01HWIEGIO",
        "B07BZJ16VL",
        "B01MPYAEN5",
        "B07FLY681H",
        "B00YO6DW74",
        "B07FFFQ59Y",
        "B01M9GPMPB",
        "B011KMZ2WW",
        "B01MG65FB2",
        "B00XUVKB14",
        "B01M3VNC79",
        "B01B2U04QG",
        "B0024GT9NC",
        "B072VSYFNY",
        "B01BPBMN9S",
        "B01M9GPHN0",
        "B011KMZ2KO",
        "B00JU1TXKI",
        "B07DL9FQM1",
        "B0164M70PA"
    ],
    "rating": "4.5"
}