{
    "asin": "B000RDZFZ0",
    "title": "Sinus Rinse Complete Kit",
    "brand": "NeilMed",
    "feature": null,
    "description": "The original & patented Sinus Rinse Kit. No. 1 physician prescribed OTC nasal rinse. Soothing; moisturizing. For large volume & low pressure. Saline nasal irrigation, moisturization and daily nasal hygiene. Suitable for use during pregnancy. Make NeilMed's Sinus Rinse an essential part of your daily hygiene - like brushing your teeth, washing your hands or taking a shower. Natural sinus care has never been easier. Advantages: Soothing, no burning or stinging large volume & low pressure system for saline nasal irrigation, moisturization and daily nasal hygiene; Single-piece, custom-designed rounded cap fits any nasal opening. No push and pull components make for easy cleaning; Preservative, drug, iodine, BPA, gluten and latex free; Premixed packets of USP grade sodium chloride & sodium bicarbonate (purity level 99% or higher); Excellent cleansing prior to spraying nasal corticosteroids; pH balanced & isotonic, or hypertonic with two or more packets; Smooth flow with easy-squeeze bottle; Empties 95% in upright position; Suitable for use after sinus surgery and during pregnancy. Consult your physician with concerns; Portable for travel. Kit includes: 1 custom designed cap; 1 rinse bottle 8 oz (240 ml); 1 tube; 50 packets of USP grade (purity level 99% or higher) sodium chloride & sodium bicarbonate mixture (pH balanced, natural ingredients, isotonic, preservative free & iodine free); Educational brochure. Sinus Rinse Nasal Rinse Kit comes with 50 packets of easy to dispense USP grade, preservative-free sodium chloride and sodium bicarbonate mixture (pH balanced & isotonic for maximum comfort). Easy-squeeze bottle comes with volume marker. Each packet is precisely measured to mix with 8 oz (240 ml) of lukewarm distilled or previously bottled water, taking the guesswork out of preparing this solution. The kit also contains an educational brochure with directions for use. CE listed. No CFCs. Contains no CFC which deplete ozone layer.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 50.0,
        "length": 620.0,
        "width": 580.0,
        "height": 250.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61f1lLM0z0L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61LlVcMOJBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/612VwjhxSBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Ov0JICHyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qHXkZ0%2B9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51j-qodmJ5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51UpM8Y8HiL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3760941",
            "title": "Health Care"
        },
        {
            "node": "10079990011",
            "title": "Medications & Treatments"
        },
        {
            "node": "3760951",
            "title": "Allergy, Sinus & Asthma"
        },
        {
            "node": "3761131",
            "title": "Sinus Medicine"
        }
    ],
    "similar": [
        "B00I8NKNZ8",
        "B0759N57C5",
        "B01787L5MO",
        "B0030HMR7E",
        "B002NGOORY",
        "B079JXD56R",
        "B0759CX2BC",
        "B01787L6QY",
        "B00E4MOZXS",
        "B01N0J9YAK",
        "B000OA6Z6O",
        "B001H54VP2",
        "B07B9N1LMT",
        "B004158IWM",
        "B00Y0VYCTU",
        "B002N1TOZ6",
        "B01787L83A",
        "B00MXOVBO0",
        "B002BFXSB0",
        "B01FDCMSTU",
        "B000A0S5LG",
        "B00TU5P33K",
        "B00DMAI9MG",
        "B002Q6WEMI",
        "B002D6RJSK",
        "B004H1RA6U"
    ],
    "rating": "4.6"
}