{
    "asin": "B000C3YTM0",
    "title": "K&N HP-1004 Performance Wrench-Off Oil Filter",
    "brand": "K&N",
    "feature": [
        "O/E replacement oil filters for most cars, trucks, SUV's, motorcycles, & ATV's",
        "Resin-impregnated filter media traps 99% of harmful contaminants",
        "1 In. exposed nut designed for easy oil filter removal",
        "Heavy duty construction for extreme conditions",
        "Anti-drainback valve (where applicable) eliminates dry starts, prevents oil from draining back into crankcase during engine shutdown"
    ],
    "description": "Originally developed for demanding auto race applications, our premium oil filter is rapidly becoming a favorite among consumers for its durability and easy removal. We've changed oil filters and several of our product development technicians are sportsman class drag racers. They insisted we offer an oil filter that corrected the headaches they experienced over the years changing oil filters. We have all been there: Whether it's remembering where that disappearing canister tool is; or having oil leak all over your garage and yourself; or finally giving up and pounding a screwdriver through the filter just to get if off. Each of our automotive and marine oil filters comes with a 1 nut welded to the top of the canister so they can be easily wrenched-off with a standard tool. Our motorcycle and ATV oil filters come with a 17 mm nut. Our oil filters use resin impregnated cellulose filter media. This allows for higher flow rates while providing outstanding filtration. High filter flow rates are important in racing vehicles where heavier grade oil is used and the oil is pumped much faster than in a standard vehicle. When the engine is circulating oil at high GPM rates, the high-flow oil filter helps reduce the loss of pressure through the filtering process. To satisfy the demands of racers, our oil filter has many features over and above the requirements of most vehicles. We use thicker canister walls for extra strength and durability which reduces the risk of damage from loose rocks and debris. The heavy-duty construction will withstand higher oil pressures found only in racing environments without bursting. The drilled hole on the nut is for a safety wire attachment. Required for many types of racing, the safety wire prevents blown oil filters from falling on the track and representing a hazard to other race vehicles. This extra engineering offers peace of mind for consumers who want only the best.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 60.0,
        "length": 310.0,
        "width": 310.0,
        "height": 350.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/510lZceA67L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FKXl0AdEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51uCkGAhbqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Y31K8xqIL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512JriPNJPL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "15684181",
            "title": "Automotive"
        },
        {
            "node": "15706941",
            "title": "Tools & Equipment"
        },
        {
            "node": "15708801",
            "title": "Oil System Tools"
        },
        {
            "node": "15708821",
            "title": "Oil Filter Wrenches"
        }
    ],
    "similar": [
        "B07466XYF3",
        "B000C3YTK2",
        "B01N4BIL19",
        "B0068FUEV6",
        "B004D5Q296",
        "B07466M44Q",
        "B01N0EB7Y0",
        "B0161A4CO2",
        "B01N7FSUYG",
        "B01LH7KPUY",
        "B01LG3Q5RG",
        "B00353M2P0",
        "B000C3XDB8",
        "B01M2ZSRYG",
        "B07466D994",
        "B000C4087Y",
        "B01NGTJHQI",
        "B00EXG7ERO",
        "B000NKCIKM",
        "B000BZGKCG",
        "B06XGCG96Z",
        "B000C3XD90",
        "B0161A4D1O",
        "B00OXZDQ2C",
        "B0161A4CKG",
        "B01N3AFGN4",
        "B000C3XD9K",
        "B01N5CYGKY",
        "B071JJ97NS",
        "B078K4Z2Z5"
    ],
    "rating": "4.5"
}