{
    "asin": "B000255NCI",
    "title": "API Freshwater Master Test KIT 800-Test Freshwater Aquarium Water Master Test Kit",
    "brand": "API",
    "feature": [
        "Contains one (1) API FRESHWATER MASTER TEST KIT 800-Test Freshwater Aquarium Water Master Test Kit, including 7 bottles of testing solutions, 1 color card and 4 glass tubes with cap",
        "Helps monitor water quality and prevent invisible water problems that can be harmful to fish and cause fish loss",
        "Accurately monitors 5 most vital water parameters levels in freshwater aquariums: pH, nitrite, nitrate, carbonate and general water hardness",
        "Designed for use in freshwater aquariums only",
        "Use for weekly monitoring and when water or fish problems appear"
    ],
    "description": "Most water problems are invisible to the eye. Quickly measure and modify the six aquarium levels that are most important to the health of your freshwater fish with the API FRESHWATER MASTER TEST KIT. To stay healthy and thrive, fish need properly balanced levels of ammonia, pH, high range pH, nitrite and nitrate. These levels can change rapidly and create harmful conditions when fish waste, uneaten food or other organic matter accumulate, or when untreated water is added. If left uncorrected, all of these can be harmful or even fatal to fish, with consequences such as reduction of oxygen, increase in stress and higher risk of disease. The API FRESHWATER MASTER TEST KIT measures these six parameters with scientific accuracy and provides professional results. It comes with four glass test tubes, a holding tray, test tube rack and computer calibrated, laminated color card. Just fill the test tubes, add the test drops and compare results to the color card. Then follow the recommendations on the card if action is required. With API Aquarium products, it’s easy to keep a beautiful saltwater, freshwater or reef aquarium. For over 50 years, API has been creating innovative, research-driven solutions that make it easier to care for your fish and aquarium. API Aquarium Treatment Supplies are designed to work in conjunction with each other to provide best results to control algae, promote healthy bacterial growth and help control and cure fish diseases and conditions such as ich and fin rot. They work to provide a safe, hospitable environment for fish such as tropical community fish, cichlids, goldfish and more. With API, you can spend more time admiring your fish, and less time scrubbing your tank. Make sure to use all products as directed in order to ensure the best results.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 110.00000000000001,
        "length": 910.0,
        "width": 350.0,
        "height": 459.99999999999994
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51FQhbpfB0L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BJPj%2BBkUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41esClYp2AL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31YV2lRQmKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5156B95o2HL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XnHSTurML._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "Single"
        },
        {
            "name": "Color:",
            "value": "White"
        }
    ],
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975446011",
            "title": "Fish & Aquatic Pets"
        },
        {
            "node": "3048858011",
            "title": "Aquarium Test Kits"
        }
    ],
    "similar": [
        "B07BN74J4S",
        "B07C84ZSJ6",
        "B000255N3W",
        "B01FNQUPAU",
        "B00ZFR3OW4",
        "B01A0TMS6Y",
        "B0017JDIUC",
        "B0002566TC",
        "B00025694O",
        "B00YTW4PFQ",
        "B0053PR7P8",
        "B0743LDN66",
        "B006YG12F6",
        "B072KHNJLQ",
        "B07GJ41D96",
        "B0006JDWH8",
        "B000260FV6",
        "B01C6PE4G2",
        "B01DMF8SH6",
        "B003SNCHMA",
        "B0002567T6",
        "B077YB2DFW",
        "B01MSDSS1C",
        "B000255MZG",
        "B07FNLSM4B",
        "B07GJ2SHLX",
        "B002DREWMK",
        "B013BXDXTC",
        "B00E3QV82Q",
        "B000HHOAIY",
        "B001EUE808",
        "B06WWQHZRJ",
        "B003SNDNQ4",
        "B006WC1F0E",
        "B07914CW48",
        "B07GHYZ79J",
        "B001D6Z7QW",
        "B0002AQL5G"
    ],
    "rating": "4.5"
}