{
    "asin": "B000FTFLRS",
    "title": "Evans 2-Sided Practice Pad, 6 Inch",
    "brand": "Evans",
    "feature": [
        "RealFeel by Evans 6\" 2-sided pad has a large playing surface that fits inside a standard snare basket, a natural gum feel on one side for the realistic rebound, and a harder recycled rubber surface on the other for a real workout. RealFeel by Evans practice pads are the most popular practice pad option available. Featuring a natural gum rubber playing surface with a dark gray fabric finish which resists wear and tear, RealFeel by Evans practice pads provide the best practice substitute to an acoustic drum. A variety of models are available to suit individual practice requirements.For over 40 years, Evans has been a pioneer of drum head manufacturing and design. Known for innovative designs such as EMAD, EC2S, and the Hydraulic series, Evans drum heads are made in the USA in a state of the art manufacturing facility. Acquired in 1996 by D’Addario and Company, the global leader in musical instrument accessories, the Evans brand is synonymous with quality and consistency.",
        "6\" two sided pad with gum rubber and neoprene surfaces",
        "Features a natural gum rubber playing surface with a dark gray fabric finish which resists wear and tear",
        "Provides the best practice substitute to an acoustic drum",
        "Also available in a 12\" version",
        "All RealFeel by Evans drum pads are designed, engineered and manufactured to the most stringent quality controls in the industry"
    ],
    "description": "For the player who likes to keep their chops up while on the road, the 6 Inches 2-sided pad is small enough to fit inside a stick bag, has a natural gum feel on one side for the realistic rebound, and a harder recycled rubber surface on the other for a real workout. RealFeel by Evans 6\" 2-sided pad has a large playing surface that fits inside a standard snare basket, a natural gum feel on one side for the realistic rebound, and a harder recycled rubber surface on the other for a real workout.RealFeel by Evans practice pads are the most popular practice pad option available. Featuring a natural gum rubber playing surface with a dark gray fabric finish which resists wear and tear, RealFeel by Evans practice pads provide the best practice substitute to an acoustic drum. A variety of models are available to suit individual practice requirements.For over 40 years, Evans has been a pioneer of drum head manufacturing and design. Known for innovative designs such as EMAD, EC2S, and the Hydraulic series, Evans drum heads are made in the USA in a state of the art manufacturing facility. Acquired in 1996 by D’Addario and Company, the global leader in musical instrument accessories, the Evans brand is synonymous with quality and consistency.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 96.875,
        "length": 1510.0,
        "width": 1510.0,
        "height": 1510.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31u3oQFsGwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21f8amXjAUL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Style:",
            "value": "Two-sided"
        },
        {
            "name": "Size:",
            "value": "6-Inch"
        }
    ],
    "categories": [
        {
            "node": "11091801",
            "title": "Musical Instruments"
        },
        {
            "node": "11965871",
            "title": "Instrument Accessories"
        },
        {
            "node": "11966411",
            "title": "Drum & Percussion Accessories"
        },
        {
            "node": "11967481",
            "title": "Practice Pads & Devices"
        }
    ],
    "similar": [
        "B001A5CKWK",
        "B0002F73ZI",
        "1892764040",
        "B01C44J2WQ",
        "B0714JFQ7F",
        "B07DM16XQ1",
        "B00PXB5SY4",
        "B0021VM90U",
        "B079QSV51L",
        "B074C7MHFL",
        "0882847953",
        "B00D3L447S",
        "B0002CZQJQ",
        "B01LYZJJC7",
        "B0002F5C8S",
        "B06XGS3ZD3",
        "B0784C4PX1",
        "B01C44J0Z0",
        "B000FT9ZIE",
        "B01IRNGWDK",
        "B0007P34YW",
        "B0002E56JY",
        "B002E1JGTO",
        "B07B3X23D2",
        "B000N3ZK36",
        "B00DL4ZFFM",
        "B000FMDIXY",
        "B072DZ8C79",
        "B01N6ZJH96",
        "B072FFDJZ4",
        "B0002F5BFW",
        "B01G2KH9SC",
        "B0002F741Q"
    ],
    "rating": "4.7"
}