{
    "asin": "B000ENSRS0",
    "title": "Slime 10004 Tube Sealant, 16 oz.",
    "brand": "Slime",
    "feature": [
        "PERFECT FOR DRIVERS: Slime tire sealant allows you to repair flat tires fast and effectively in order to let you get back on the trail within seconds. Prevents and repairs flat tires for bikes, dirt bikes, and wheelbarrows. (up to a quarter-inch)",
        "FOR TUBELESS TIRES: The tubeless tire sealant instantly seals puncture up to 1/8-inch (3mm) in diameter. It works to seal multiple punctures repeatedly and much faster than changing a tube.",
        "BACK-UP PLAN: Our car tire sealant is a perfect back up plan weather you're a mountain biker, road cyclist, or a regular car driver. It plays a major role in getting you back on the track. Easy to carry.",
        "LIGHTWEIGHT AND EASY TO USE: This motorbike tubeless tire sealant is lighter and easy to carry. You can also easily store it in your car or can attach it with bike.",
        "Durable: Guaranteed to perform for up to two years and works repeatedly, puncture after puncture. Formula is non-toxic, non-corrosive, non-flammable, non-aerosol, and water soluble."
    ],
    "description": "prevents and repairs flat tires caused by puncturing objects up to 1/8-inch (3mm) in diameter. Slime works repeatedly to repair new and existing punctures and is guaranteed to perform for up to two years. Slime Tube Sealant seals multiple punctures repeatedly, and is non-toxic, non-corrosive, non-flammable, non-aerosol, and also water soluble. This inner tube formulation should not be used in a tubeless tire. Slime sealants are designed to treat tread area punctures only and should not be used to repair sidewall punctures, snake bites, rim spoke punctures, or gashes from metal or glass.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 125.0,
        "length": 250.0,
        "width": 250.0,
        "height": 919.9999999999999
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/417nA18VCyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61w771A6OTL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Green"
        }
    ],
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3403201",
            "title": "Cycling"
        }
    ],
    "similar": [
        "B00BQAL2PU",
        "B00XJXP6V8",
        "B017KU1DIK",
        "B00GYKSLDS",
        "B01FJD3MC0",
        "B016NGK0X6",
        "B00XLY7Y1A",
        "B01FMK49D6",
        "B0155L1G9W",
        "B017UQP31C",
        "B06XY9W7PC",
        "B016NGK0N6",
        "B01LCLMKTY",
        "B07DGZYVH9",
        "B07D8TQGXP",
        "B07C7RTCNN",
        "B074XDC7CL",
        "B016NGK0RM",
        "B071FDY4XR",
        "B07BKTGN99",
        "B00U0FRT7M",
        "B01FJ8RSXE",
        "B07DV2952G",
        "B079VL9QBL",
        "B000BOB9F0",
        "B078WPLVX5",
        "B00U0FP8ZW",
        "B003RLK19Y",
        "B0020T17J2",
        "B001DIQTRG",
        "B01M2BYY6D",
        "B01CGDVXL8",
        "B01CGDW290",
        "B01FJG9ZMS",
        "B01FJCG3GS"
    ],
    "rating": "4.3"
}