{
    "asin": "B000GG87V2",
    "title": "Nature's Bounty Vitamin C 500 mg",
    "brand": "Nature's Bounty",
    "feature": [
        "Contains (1) bottle of 250 Vitamin C tablets of 500mg each. Vitamin C plays an important role in supporting the immune system.(1) As an antioxidant, it helps neutralize cell-damaging free radicals in your body.(1) Take 1 tablet daily to support immune health.(1)",
        "Vitamin C is one of the most well-known and widely used nutritional supplements on the planet. People reach for Nature's Bounty Vitamin C to help them get the essential benefits their body relies on every day. Suitable for vegetarians and gluten free.",
        "Quality, consistency & scientific research has resulted in vitamins and nutritional supplements of unrivaled excellence. Using the latest breakthroughs in nutritional science & the finest ingredients, we provide supplements of unsurpassed quality & value.",
        "Every Nature’s Bounty product is subjected to numerous quality tests throughout the manufacturing process to verify purity and potency. The ingredients & final product are tested in our microbiological laboratory to make certain that the product is pure.",
        "Our supplements are overseen by scientists, manufacturing specialists and quality experts, each dedicated to maintaining the highest quality standards. Nature’s Bounty only uses ingredients from suppliers that meet GMP supplement quality standards.",
        "No Artificial Color, no artificial flavor, no artificial sweetener, no preservatives"
    ],
    "description": "Vitamin C is one of the most well-known and widely used nutritonal supplements. People reach for Nature's Bounty Vitamin C to help them get the essential benefits their body relies on every day.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 270.0,
        "width": 270.0,
        "height": 470.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51e9qWQsYuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zTEeuOJ5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31or9ihS0ML._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "Pack of 1"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "6936790011",
            "title": "Vitamins"
        },
        {
            "node": "3774771",
            "title": "Vitamin C"
        },
        {
            "node": "6936817011",
            "title": "C-Complex"
        }
    ],
    "similar": [
        "B0035C5XVQ",
        "B00NNOV1US",
        "B003B3OOS2",
        "B0000DJAVX",
        "B0014D2GEK",
        "B00GBBW848",
        "B074V798T8",
        "B003PGJLRO",
        "B01M4MCUAF",
        "B008GCB8LE",
        "B000F4ZWOA",
        "B00008I8NJ",
        "B010RSDTNE",
        "B00E4MN5DO",
        "B07FC4ZNH1",
        "B001TSBSLM",
        "B074GCB1ND",
        "B0019GE9HE",
        "B000NPYY04",
        "B074V73GHX",
        "B06XNMPKQ7",
        "B000GCQ8X0",
        "B079J9PP48",
        "B079HY15MY",
        "B000GG87MG",
        "B00GKQOW70",
        "B0040J0Q92",
        "B01FNEUHXC",
        "B004JO99TG",
        "B074V7JJ4Z",
        "B07FC879BK"
    ],
    "rating": "4.4"
}