{
    "asin": "B000GOO00Q",
    "title": "Animal Cuts – Complete Fat Burner Weight Loss and Thermogenic Supplement – Energy Booster, Metabolic Complex, Water Shedding, Nootropic with Green Tea Leaf extract, Raspberry Ketones",
    "brand": "Universal Nutrition",
    "feature": null,
    "description": "That's what is all about.You don't want an ordinary physique, so your average diet supplement wont cut it. You want something stronger, something made for the most dedicated bodybuilders in the game. For you, we created is a metabolic powerhouse crammed into a single pack. Each precisely formulated dose can help you to tear away the unwanted adipose accumulated in the mass-gaining off-season, to help reveal the hard, grainy muscle underneath. Be a freak and see the freaky physique that you've worked so hard to build with the extreme, all-in-one cutting stack, the one that goes above and beyond in the quest to get shredded.WARNING: As stated on our packaging, not for use by those under the age of 18. Consult a physician before using this product. If you have, or have a family history of, heart disease, thyroid disease, liver disease, kidney disease, diabetes, high blood pressure, recurrent headaches, depression or other psychiatric conditions, glaucoma, difficulty in urinating, prostate enlargement, seizure disorder, if you are using a monoamine oxidase inhibitor (MAOI), anti-depressants, or any other medication, dietary supplement, prescription drug or over-the-counter drug consult with a physician. Discontinue use two weeks prior to surgery. Do not use if pregnant or nursing. Do not exceed recommended does. Contains caffeine. Do not use in combination with other caffeinated products. Dosage: One pack conatins 9 pills. See label for additional details.Dietary Supplement. The Ultimate Fat Burning Pak. Octopamine; Tyramine; Synephrine; Taraxerol; ALA; EGCG; Theanine; Guggul; Arbutin; PEA; Plus more. Animal Cuts Free. The Ultimate Ephedra-Free Alternative. Animal Cuts, the professional cutting supplement, is now available in an ephedra-free formula, Animal Cuts Free. Like regular Animal Cuts, Animal Cuts Free is a complete and comprehensive cutting product. Listen, regular diet products target energy expenditure only. These conventional fat burners, or thermogenics, work by raising the body's metabolism which increase total energy expenditure. For many, this is simply not enough. Many athletes have other pre-existing conditions which make it difficult, if not impossible, to get cut: 1) insulin resistance, 2) nucleotide deficiencies, 3) neurotransmitter imbalance, and 4) underactive thyroids, just to name a few. These biochemical issue can impact your cut by increasing sugar cravings, slowing down your metabolism, and even making it difficult to release stored bodyfat for burning. As a cutting supplement, only Animal Cuts contains thermogenics, plus the other necessary components required to support maximum fat burning. Ok. This enough? Nope. Getting competition-ready is not just about the fat. It's also about the water. Those deep, etched striations come down to shedding both subcutaneous fat and subcutaneous water. No matter how low your body fat levels fall, excess water beneath the skin can make you look soft and puffy. Only Animal Cuts contains dedicated ingredients for fat oxidation and diuresis. Best of all, Animal Cuts' formula allows you to strip away fat and water while helping to preserve lean mass. Other fat burners target overall weight loss. You lose both fat and lean mass. With Animal Cuts, bodybuilders get a complete cutting supplement without losing any valuable lean mass. Each 1 Pack Contains: 20 mg of Synephrine and 200 mg of Caffeine. (These statements have not been evaluated by the FDA. This product is not intended to diagnose, treat, cure or prevent any disease.)",
    "price": 3495.0000000000005,
    "listPrice": 3911.0,
    "prime": true,
    "dimensions": {
        "weight": 56.875,
        "length": 409.99999999999994,
        "width": 409.99999999999994,
        "height": 560.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51FMKFmgoUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51hrj7-JB7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51d8mSWddjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Y4pSllFuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YH3SGsIzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dn549l9uL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31JS8eTi9QL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "6973663011",
            "title": "Sports Nutrition"
        },
        {
            "node": "6973679011",
            "title": "Fat Burners & Thermogenics"
        }
    ],
    "similar": [
        "B004EMNER6",
        "B00P6VQYJO",
        "B00NHQ3JPM",
        "B016N1BCFG",
        "info.html",
        "B001BO0L1W",
        "B01HHX7K9Q",
        "B000GOT54C",
        "B00UNPM9AG",
        "B07F2NPTJ7",
        "B07FR1G4R5",
        "B07C2J3733",
        "B00GWQ9KKM",
        "B07H4B4KWG",
        "B000GOX0JI",
        "B01CFYJEKK",
        "B00006IVEN",
        "B00O4TF4WW",
        "B073ZMJ5N8",
        "B071FXWDRB",
        "B00166D8O2",
        "B00GGEU4E6",
        "B072KGW6TP",
        "B00S0078QQ",
        "B000GONZZC",
        "B002RFW8U6"
    ],
    "rating": "3.9"
}