{
    "asin": "B000GIPJ16",
    "title": "OPTIMUM NUTRITION HMB, 1000mg, 90 Capsules",
    "brand": "Optimum Nutrition",
    "feature": null,
    "description": "Dietary Supplement. Calcium B-Hydroxy B-Methylbutyrate Monohydrate. Beta-Hydroxy Beta-Methylbutyrate (HMB) is an important metabolite of the essential branched chain amino acid (BCAA) L-Leucine. Human and animal studies suggest that HMB may reduce stress-induced muscle protein breakdown and support significant increases in muscle strength and size when combined with intense resistance training. Optimum Nutrition's HMB Capsules are produced and packaged in our own state-of-the-art, OTC approved manufacturing facility. Each capsule provides 1000 mg (1 g) of pure beta-hydroxy beta-methylbutyrate (HMB). (These statements nave not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease.) Optimum Nutrition's commitment to quality is evident throughout the entire product development process. As a continued measure of quality, all vendors must provide a Certificate of Analysis for each raw material supplied. The certified analyses are also verified through random in-house and independent laboratory testing. To further diminish any chance of physical, chemical, and microbiological contaminants, ON has established and implemented a Hazard Analysis Critical Control Point (HACCP) program. Quality assurance professionals make routine checks on all storage, blending, and production areas and conduct daily inspections.Since 1986, Optimum Nutrition has been supporting the nutrition goals of elite athletes and goal-driven individuals around the world. Building on a foundation of company owned and operated production facilities, unparalleled manufacturing expertise, and uncompromising quality standards, ON continually strives to bring athletes and active individuals sports nutrition solutions designed to make a real difference in performance. Whether your goals involve strength, speed, power, endurance - or any combination - ON supplements work as hard as you do. Realize your True Strength with the quality and innovation leader.Optimum Nutrition HMB 1000mg, 90 capsules.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 270.0,
        "width": 270.0,
        "height": 480.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41dYBFnCCLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41kgASYigCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31ZDG1kBf1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31%2BJNNDmANL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/315jKvUmCAL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "6939426011",
            "title": "Supplements"
        },
        {
            "node": "6942464011",
            "title": "Digestive Supplements"
        },
        {
            "node": "3762131",
            "title": "Dietary Fibers"
        }
    ],
    "similar": [
        "B06XZJT7ZR",
        "B002DYIZCQ",
        "B0080L9B9M",
        "B001LXMUW6",
        "B016C1V8YC",
        "B07CSFZGK7",
        "B000GIQS0W",
        "B00HXGGOA4",
        "B079ST3JRN",
        "B00014WJUO",
        "B000GIQS02",
        "B01BLWKR5S",
        "B005LR0WUU",
        "B017L2M7XC",
        "B01J2HZU7E",
        "B01H3W4KH6",
        "B01AZNA8SA",
        "B00A2FZF0S",
        "B0075JUII8",
        "B01HGQZXFW",
        "B00ULZF5HC",
        "B017L2M7RI",
        "B00104I5PW",
        "B079JWLSH9",
        "B002DYIZEO",
        "B00DDWZ3EK",
        "B0001FSW4U",
        "B002DYJ0CU"
    ],
    "rating": "4.2"
}