{
    "asin": "B00024D1ZA",
    "title": "Nature's Way Kelp; 600 mg Kelp per serving; Non-GMO Project Verified; Gluten Free;Vegetarian;180 Vegetarian Capsules",
    "brand": "Nature's Way",
    "feature": [
        "SUPERIOR QUALITY STANDARDS: Our Kelp is carefully tested and produced to superior quality standards.",
        "CONTAINS IODINE: Nature's Way Kelp is a nutritional seaweed guaranteed to contain iodine.",
        "NON-GMO PROJECT VERIFIED: We're proud partners with The Non-GMO Project. In keeping with our mission to follow the best sourcing, manufacturing and testing practices, we're committed to providing only non-GMO products. Nature's Way Kelp is produced according to the best practices for GMO avoidance.",
        "SUPERIOR QUALITY STANDARDS: Our Kelp is carefully tested and produced to superior quality standards.",
        "CONTAINS IODINE: Nature's Way Kelp is a nutritional seaweed guaranteed to contain iodine.",
        "NON-GMO PROJECT VERIFIED: We're proud partners with The Non-GMO Project. In keeping with our mission to follow the best sourcing, manufacturing and testing practices, we're committed to providing only non-GMO products. Nature's Way Kelp is produced according to the best practices for GMO avoidance.",
        "GLUTEN-FREE AND VEGETARIAN: Our Kelp is gluten free and vegetarian, made from plant-derived capsules. It also contains no sugar, salt, yeast, wheat, soy, corn, dairy products, artificial colors, flavors or preservatives.",
        "SERVING RECOMMEDATION: Take 1 capsule daily. Do not exceed recommended dose.",
        "*These statements have not been evaluated by the Food & Drug Administration. These products are not intended to diagnose, treat, cure or prevent any disease."
    ],
    "description": "Nature's Way Kelp is guaranteed to contain iodine and has 600 mg of kelp per serving. It has been verified by the Non- GMO Project and is Gluten Free.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 229.99999999999997,
        "width": 229.99999999999997,
        "height": 459.99999999999994
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B004VCOOYG",
        "B00M9LC5H4",
        "B076NSBM6G",
        "B00S1RV3Z0",
        "B0009A0LDM",
        "B001AWWC1W",
        "B00M13NHFY",
        "B0013OULGA"
    ],
    "rating": null
}