{
    "asin": "B0009I3T3S",
    "title": null,
    "brand": "Potable Aqua",
    "feature": [
        "Potable Aqua - the most trusted name in water purification products, Potable Aqua is used by militaries and relief organizations around the world. Potable Aqua Drinking Water Germicidal Tablets are intended for emergency disinfection of drinking water",
        "Potable Aqua Plus are neutralizing tablets for use after water has been treated with Potable Aqua. P.A. Plus neutralizes the iodine after-taste and color in the water",
        "2 Potable Aqua tablets are required to treat 1 quart (1 liter) of water. 2 PA+ tablets will neutralize the residual iodine remaining after treatment. PA Plus tablets disintegrate rapidly and remove the iodine taste and odor within 3 minutes",
        "Potable Aqua - the most trusted name in water purification products, Potable Aqua is used by militaries and relief organizations around the world. Potable Aqua Drinking Water Germicidal Tablets are intended for emergency disinfection of drinking water",
        "Potable Aqua Plus are neutralizing tablets for use after water has been treated with Potable Aqua. P.A. Plus neutralizes the iodine after-taste and color in the water",
        "2 Potable Aqua tablets are required to treat 1 quart (1 liter) of water. 2 PA+ tablets will neutralize the residual iodine remaining after treatment. PA Plus tablets disintegrate rapidly and remove the iodine taste and odor within 3 minutes",
        "Potable Aqua may be used in conjunction with a camping or emergency water filter. It is effective against bacteria, viruses, and many cysts such as giardia lamblia. Potable Aqua is not effective against cryptosporidium cysts",
        "Potable Aqua provides an accurate dose, and is effective over extreme conditions such as cloudy water, low temperatures, and extreme pH. It is simple to use, and time-efficient. Potable Aqua may be used with a camping or emergency water filter"
    ],
    "description": "Used worldwide by campers, hikers, militaries, emergency responders, and anyone else who needs to drink water from a questionable source, Potable Aqua iodine tablets will disinfect contaminated drinki ...",
    "price": null,
    "listPrice": 1299.0,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 580.0,
        "width": 360.0,
        "height": 100.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00FA2RLX2",
        "B001949TKS",
        "B006QF3TW4",
        "B07CGKY4XZ",
        "B07C7ZRTP6",
        "B007W5D13O",
        "B01FM0KTBW",
        "B07C7CN7RW",
        "B01FM0KJV2",
        "B079YRNXGB",
        "B0787K14F7",
        "B01LY89T00",
        "B001AXLUX2",
        "B00LOGHPUM",
        "B000IBY64W"
    ],
    "rating": null
}