{
    "asin": "B0018CJPQ4",
    "title": "API SUPER ICK CURE Freshwater and Saltwater Fish Powder Medication",
    "brand": "API",
    "feature": [
        "Contains one (1) API SUPER ICK CURE Freshwater and Saltwater Fish Powder Medication 30-Ounce Bulk Box",
        "Treats \"ich\" white spot disease in fish and secondary bacterial fish infections",
        "Quickly kills ich parasite, typically within 24 hours of first dose",
        "Packaged in easy-to-dose packages for use in freshwater and saltwater aquariums",
        "Use two packets every 48 hours when symptoms of ich diseases appear"
    ],
    "description": "Rid your fish of ich quickly and effectively with API SUPER ICK CURE Freshwater and Saltwater Fish Powder Medication. API SUPER ICK CURE Freshwater and Saltwater Fish Powder Medication works quickly to heal freshwater fish of icthyophthirius (\"Ich\") or Cryptocaryon, highly contagious parasitic diseases. Ich, also called white spot disease, is a highly contagious and destructive, microscopic parasite that burrows into gill and skin tissue, causing severe damage and secondary infections. Early symptoms include white spots, darting and scratching against surfaces while more advanced stages can cause labored breathing. This freshwater fish treatment not only helps cure Ich, but it also provides a synthetic slime coat that helps protect against secondary infection, where the natural slime coating of the fish has been disturbed by the parasite. Use at the first sign of \"Ich\" or white spots. Some scaleless fish are sensitive to this medication, so treat them with 1/2 the normal dose. Some saltwater invertebrates, such as corals, may be sensitive to this product, so it is not recommended for reef aquariums. This medication will cause a slight discoloration of water which can be easily removed by adding activated carbon to the filter. Dose according to directions on product packaging and label. This treatment can be used in freshwater or saltwater aquariums. With API Aquarium products, it’s easy to keep a beautiful saltwater, freshwater or reef aquarium. For over 50 years, API has been creating innovative, research-driven solutions that make it easier to care for your fish and aquarium. API Aquarium Treatment Supplies are designed to work in conjunction with each other to provide best results to control algae, promote healthy bacterial growth and help control and cure fish diseases and conditions such as ich and fin rot. They work to provide a safe, hospitable environment for fish such as tropical community fish, cichlids, goldfish and more. With API, you can spend more time admiring your fish, and less time scrubbing your tank. Make sure to use all products as directed in order to ensure the best results.",
    "price": 10919.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 200.0,
        "length": 360.0,
        "width": 360.0,
        "height": 650.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/4187VYLxd%2BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41jAO7c01LL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Y4GYpgq8L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XnHSTurML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/313spvVhTQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21%2BaXyV-8jL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975446011",
            "title": "Fish & Aquatic Pets"
        },
        {
            "node": "2975478011",
            "title": "Aquarium Water Treatments"
        }
    ],
    "similar": [
        "B004INC4H2",
        "B000255MZG",
        "B000255N3W",
        "B015KYDE76",
        "B006YG12F6",
        "B004KGDWI2",
        "B00C6A2GP4",
        "B0006JLPCC",
        "B003JD3VBU",
        "B000HHLQO0",
        "B075ZQS5DG",
        "B0040U3MQ0",
        "B00025646W",
        "B002DWTIU6",
        "B00HG1TMIW",
        "B016VV93SG",
        "B0018CIGB4",
        "B0002A5X7I",
        "B000255R5G",
        "B01C7PJS26",
        "B0002ASG9K",
        "B00025694O",
        "B000P6D5QK",
        "B003SNDNQ4",
        "B0002567T6",
        "B000HHLXC0",
        "B000255NCI"
    ],
    "rating": "3.7"
}