{
    "asin": "B001331MUK",
    "title": "Fat Daddio's Anodized Aluminum Round Cake Pan, 8-Inch x 2-Inch (PRD-82)",
    "brand": "Fat Daddios",
    "feature": [
        "FITS PERFECTLY IN 8-QT PRESSURE COOKERS",
        "ANODIZED ALUMINUM - It’s the ideal baking surface. Our ‘Safe-Seal’ anodizing process creates a safer, stronger baking pan. A durable, non-reactive finish that bakes a wider variety of recipes, including citrus-based and savory recipes.",
        "NO EXTRA METALS OR CHEMICAL COATINGS - Anodizing is not a coating. It is an environmentally-friendly process that contains no chemical additives, dyes, PTFE’s, or PFOA’s. Nothing that can transfer, peel, flake, or rust into your baking.",
        "HEATS AND COOLS QUICKER – By reflecting heat, rather than absorbing heat, ProSeries cake pans reach baking temperatures faster. Even heating allows for the best possible rise. Once out of the oven they cool quicker preventing over-baking.",
        "BUILT BAKERY TOUGH - These are the same pans bakeries, commercial kitchens, and baking enthusiasts around the world depend on every day for professional results. Lifetime warranty."
    ],
    "description": "Fat Daddio’s anodized aluminum bakeware reaches baking temperatures faster so your recipe can start doing its thing. Seamless, even-wall construction produces consistent heating for the best possible rise. No extra metal means quicker cooling times so your baking actually stops baking. ProSeries bakeware is anodized for safety and performance. Safe for citrus based foods and no cross-contamination. No extra metals or chemical coatings. Just the ideal baking surface. More durable. More versatile. Built Bakery Tough!",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 55.00000000000001,
        "length": 800.0,
        "width": 800.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41xQin0u%2BTL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qNUbK-A3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mWJqJKLLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51P0-LSWYoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/619l4iLc9bL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "8-Inch x 2-Inch"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "284507",
            "title": "Kitchen & Dining"
        },
        {
            "node": "289668",
            "title": "Bakeware"
        },
        {
            "node": "289679",
            "title": "Cake Pans"
        },
        {
            "node": "289681",
            "title": "Round"
        }
    ],
    "similar": [
        "B07DWF1H4Q",
        "B01E6XRYQE",
        "B003YKGR9Q",
        "B0718WCYVL",
        "B0000CFN59",
        "B000I1UXUI",
        "B01BV4E68U",
        "B0000VMF0W",
        "B0001DS88W",
        "B0000VZ2QG",
        "B076XLBMTH",
        "B00282STT2",
        "B07D1RHD4X",
        "B007E8KCFY",
        "B0012Q7TIC",
        "B000R9J19A",
        "B072WKYZS6",
        "B00006G958",
        "B0000CFMP7",
        "B072HT187B",
        "B07DQ6H1VT",
        "B0006GNPP0",
        "B0099EUPHQ",
        "B003YKGRXC",
        "B00004S7YR",
        "B07G4HZKCJ"
    ],
    "rating": "4.6"
}