{
    "asin": "B0010P0ZJK",
    "title": "API AQUARIUM SALT Freshwater Aquarium Salt",
    "brand": "API",
    "feature": [
        "Contains one (1) API AQUARIUM SALT Freshwater Aquarium Salt 65-Ounce Box",
        "Promotes fish health and disease recovery with increased electrolytes",
        "Improves respiration for fish in freshwater aquariums",
        "Made from evaporated sea water for all-natural results",
        "Use when changing water, when setting up a new freshwater aquarium and when treating fish disease"
    ],
    "description": "A lack of electrolytes in aquarium freshwater may cause serious health problems for freshwater fish. API AQUARIUM SALT supplies electrolytes to improve fish respiration. Made from evaporated sea water and containing natural active ingredients such as a natural fish tonic, API AQUARIUM SALT promotes the overall health of your fish by improving their gill function and reducing stress in a freshwater aquarium. This all-natural salt provides the essential electrolytes fish need for the uptake of oxygen and release of carbon dioxide and ammonia through the gills. API AQUARIUM SALT should only be added to reduce stress during new freshwater aquarium setup and water changes or to promote disease recovery when solving specific fish health issues. Use API AQUARIUM SALT when setting up a new freshwater aquarium, when changing water or treating disease. Make sure to take extra care when using salt with live plants, as some plants may be sensitive. With API Aquarium products, it’s easy to keep a beautiful saltwater, freshwater or reef aquarium. For over 50 years, API has been creating innovative, research-driven solutions that make it easier to care for your fish and aquarium. API Aquarium Treatment Supplies are designed to work in conjunction with each other to provide best results to control algae, promote healthy bacterial growth and help control and cure fish diseases and conditions such as ich and fin rot. They work to provide a safe, hospitable environment for fish such as tropical community fish, cichlids, goldfish and more. With API, you can spend more time admiring your fish, and less time scrubbing your tank. Make sure to use all products as directed in order to ensure the best results.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 420.0,
        "length": 800.0,
        "width": 800.0,
        "height": 1000.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/518W2jyjhAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51NOCgNE6GL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61KvkaIJhwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61feTWvvfoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51yWers1PWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61pBVu%2B2fML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51g19DGilRL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "65 oz"
        }
    ],
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975446011",
            "title": "Fish & Aquatic Pets"
        },
        {
            "node": "2975480011",
            "title": "Health Supplies"
        }
    ],
    "similar": [
        "B000260FVG",
        "B071RMR7BJ",
        "B00MWHQZX0",
        "B00025694O",
        "B005QRDDEM",
        "B000N3DXRG",
        "B000255N3W",
        "B003SNDNQ4",
        "B000255MZG",
        "B0010P82UO",
        "B01J3RDTDU",
        "B006WC1F0E",
        "B000260FV6",
        "B01N0Y4812",
        "B006YG12F6",
        "B01LXYK6PO",
        "B07DWRY92W",
        "B073Y791F1",
        "B00GFTQDQK",
        "B076ZNBY1P",
        "B00025694Y",
        "B0002567T6",
        "B000255NCI",
        "B003SNHYXC",
        "B000255NIC",
        "B0017JDIUC",
        "B00ZFR3OW4",
        "B001OIQE5C",
        "B0743LV5Y7",
        "B0002DJO3Y"
    ],
    "rating": "4.6"
}