{
    "asin": "B002PQ8BQM",
    "title": "SweatBlock Antiperspirant - Clinical Strength - Reduce Sweat up to 7-days per Use",
    "brand": "SweatBlock",
    "feature": null,
    "description": "Dab on a SweatBlock antiperspirant wipe and control excessive sweating for up to 7 days* per use... So you can confidently raise your arms. Like a crack in a mirror, pit sweat is impossible to ignore. You’ve tried clinical strength deodorant solutions -- only to be let down. And “layering” in dark/baggy clothing to hide armpit sweat only makes it worse. That’s why we created SweatBlock - so you can stop sweating and start living. (8 wipes per box) With SweatBlock you can wear any color, any fabric, in any season or situation w/o people seeing you sweat. Thousands of people have changed their lives with SweatBlock. You’ve got nothing to lose. It’ll be the best antiperspirant you’ve ever tried or your money back. 1. SweatBlock should be applied at bedtime to a clean & dry underarm. In the morning you can shower, shave, and use deodorant (for fragrance) without reducing effectiveness 2. SweatBlock is a strong anti-perspirant. For some, irritation can occur. To reduce the chances of irritation, don’t apply immediately after shaving or to a wet/ sweaty underarm. See instructions for more details. Stop use if irritation persists. 3. SweatBlock is a strong antiperspirant for underarm sweat, but many customers successfully reduce sweat on body sweat areas like hands, feet, face, back, neck, etc. The SweatBlock guarantee applies only to underarm usage. 4. 1st timers should apply nightly (2-4 nights) until dry armpits are achieved, then apply once-a-week or as needed. • Mens antiperspirant • Antiperspirant for women • Alternative for armpit pads or underarm pads • Nervous sweat and stress sweat control • Hyperhidrosis antiperspirant • Sweat defense & sweat prevention • A - Z antiperspirant solution to prevent sweat and armpit odor",
    "price": 1998.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": 370.0,
        "width": 100.0,
        "height": 340.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51l1Rt3c2gL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51GLAQ-hNfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nlbDhXITL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Z0WQgKUWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gwAVai20L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51aIwPAIR4L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "3777891",
            "title": "Personal Care"
        },
        {
            "node": "3778451",
            "title": "Deodorants & Antiperspirants"
        },
        {
            "node": "702370011",
            "title": "Antiperspirants"
        }
    ],
    "similar": [
        "B07FDNFW6Z",
        "B07FRY9MJ8",
        "B00H0DW9NG",
        "B07CX5MBBW",
        "B073FZWXBK",
        "B07CNVFFNB",
        "B00973H5J0",
        "B072Q3PV53",
        "info.html",
        "B00B5N1QFY",
        "B010BVZ1VU",
        "B07BM9LHV1",
        "B07CNTRX7N",
        "B00K4I91RG",
        "B01M63M866",
        "B07D5V4ZTW",
        "B01JB1MUNI",
        "B01MF69W6B",
        "B07BXGKQDZ",
        "B01MCS9W90",
        "B06X3W42GF",
        "B00D2959I4",
        "B01MAV3FH6",
        "B073G2D3TW"
    ],
    "rating": "4.0"
}