{
    "asin": "B002DYIZF8",
    "title": "OPTIMUM NUTRITION ZMA Muscle Recovery and Endurance Supplement for Men and Women, Zinc and Magnesium Supplement, 90 Capsules",
    "brand": "Optimum Nutrition",
    "feature": null,
    "description": "Increase Testosterone levels and muscle strength in well-trained athletes Optimum Nutrition's commitment to quality is evident throughout the entire product development process. As a continued measure of quality, all vendors must provide a Certificate of Analysis for each raw material supplied. The certified analyses are also verified through random in-house and independent laboratory testing. To further diminish any chance of physical, chemical, and microbiological contaminants, ON has established and implemented a Hazard Analysis Critical Control Point (HACCP) program. Quality assurance professionals make routine checks on all storage, blending, and production areas and conduct daily inspections.Since 1986, Optimum Nutrition has been supporting the nutrition goals of elite athletes around the world. Building on a foundation of company owned and operated production facilities, unparalleled manufacturing expertise, and uncompromising quality standards, ON continually strives to bring athletes and active individuals sports nutrition solutions designed to make a real difference in performance. Whether your goals involve strength, speed, power, endurance - or any combination - you can count on ON supplements to work as hard as you do. Realize your True Strength with the quality and innovation leader.Optimum Nutrition ZMA, 90 capsules.",
    "price": 1220.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 31.25,
        "length": 600.0,
        "width": 500.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41UJYDyFpYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2Bd%2BQRc48L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31xAz76njQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41qGiRzGPBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/312QL0FX%2BQL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "6973663011",
            "title": "Sports Nutrition"
        },
        {
            "node": "6939283011",
            "title": "ZMA Mineral Supplements"
        }
    ],
    "similar": [
        "info.html",
        "B07DR6QZ68",
        "B01AWOVRVE",
        "B006R76WK2",
        "B00416V1DY",
        "B00JKK3MA6",
        "B01KE592JU",
        "B077ZZ8363",
        "B00WR6JGD2",
        "B001P0SA7O",
        "B001LXMUW6",
        "B003RDGNY4",
        "B00A2FZF0S",
        "B008215X3S",
        "B00MKSLYW8",
        "B002DYIZCQ",
        "B000SOXALE",
        "B00166DAIG",
        "B01DP1BVQM",
        "B01N9V32X2",
        "B000GIQRW6",
        "B01I1YF6EQ",
        "B000GOT54C",
        "B071QWSJLD",
        "B00W0I6TIM",
        "B009K6ZSPC",
        "B0013OZGQ0",
        "B000SSVDUU",
        "B075KGKM1J",
        "B000GIQS02",
        "B01NBY7VNB",
        "B002DYIZEO",
        "B01FYD2CP8"
    ],
    "rating": "4.2"
}