{
    "asin": "B002Y5I1SC",
    "title": "Thinkgizmos Remote Control Robot for Kids - RoboShooter Robot Toy for Boys & Girls Aged 5",
    "brand": "Thinkgizmos",
    "feature": [
        "This fantastic and futuristic remote control toy robot for kids will have all the family on the run as foam discs are fired out at super speed from his chest, (look out Grandma!!).",
        "Different color remote control robots can be controlled independently, so buy multiple robots and you can enjoy fun robot wars!",
        "Incredibly easy to operate via the remote control which is included. The RoboShooter toy robot talks, walks, fires and even dances! Once he has fired all his ammo, collect them up and pop them back in the chamber for more action.",
        "The RoboShooter is even programmable so you can wow your friends and family as he moves and fires on his own.",
        "This RC Robot requires 6 x AA Batteries which are not included. Suitable for ages 5 and above.",
        "Certainly one of the best toy robots for kids, which will provide hours of fun and also have adults running for cover and laughing at the robots antics.",
        "This remote control robot toy is branded \"ThinkGizmos\". Comes in an awesome looking box with user manual included in the following languages (English, Spanish, German, French, Italian)"
    ],
    "description": "As seen on doctor who Christmas special! This fantastic and futuristic remote control toy robot for kids will have all the family on the run as foam discs are fired out at super speed from his chest, (look out Grandma!). Incredibly easy to operate via the remote control which is included. The RoboShooter toy robot talks, walks, fires and even dances! Once he has fired all his ammo, collect them up and pop them back in the chamber for more action. The RoboShooter is even programmable so you can wow your friends and family as he moves and fires on his own. This RC Robot requires 6 x AA Batteries which are not included. Suitable for ages 5 and above. Certainly one of the best toy robots for kids, which will provide hours of fun and also have adults running for cover and laughing at the robots antics. This is a ThinkGizmos branded product. ThinkGizmos is a registered trademark in the USA.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 225.0,
        "length": 500.0,
        "width": 330.0,
        "height": 220.00000000000003
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51M5ZnTrQDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Oj1oITSeL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ac6ogB%2B5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51O0c76mABL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51c8Enz7vcL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xSyohP4YL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51j26-z0AqL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "165793011",
            "title": "Toys & Games"
        },
        {
            "node": "166164011",
            "title": "Kids' Electronics"
        },
        {
            "node": "343404011",
            "title": "Remote- & App-Controlled Figures & Robots"
        }
    ],
    "similar": [
        "B06XG668WK",
        "B0763YWKWK",
        "B071ZRMDH1",
        "B01ABUTTQO",
        "B01NATPFH7",
        "B078R2YFT9",
        "B078H5JHM6",
        "B07CTHCNV6",
        "B075QCD371",
        "B014HIRFQW",
        "B073TTM7L7",
        "B0773VVNKT",
        "B07GD94FXZ",
        "B07D4F42KT",
        "B014H68PE0",
        "B01M6372QH",
        "B075MNXB2X",
        "B01M58IE0N",
        "0449810798",
        "B01M97U09P",
        "B078KC1VTF",
        "B074WC4NHW",
        "B01LWJ4ZLY",
        "B01750U4G2",
        "B075GJ2MGR",
        "B01KJEO7TQ",
        "B0776NDSFQ",
        "B076GGPC3S",
        "B075R17LPY"
    ],
    "rating": "3.6"
}