{
    "asin": "B002RL9CTK",
    "title": null,
    "brand": "Totally Bamboo",
    "feature": [
        "♻ SATISFACTION GUARANTEE → When you order your Totally Bamboo Kitchen Utensil Set today, you’re protected by our replacement warranty + world class customer service!!",
        "♻ ORGANIC → Organically Grown; NO Fertilizers, Pesticides or artificial irrigation and ZERO chemicals. Feel good about cooking with bamboo as it does not leach toxic chemicals into your food while cooking like the plastic alternatives do",
        "♻ EASY TO CLEAN → Bamboo is easy to clean and fights bacteria naturally.. Safe for Dishwasher and make sure to periodically apply Totally Bamboo’s mineral oil to keep bamboo fibers strong and beautiful",
        "♻ SATISFACTION GUARANTEE → When you order your Totally Bamboo Kitchen Utensil Set today, you’re protected by our replacement warranty + world class customer service!!",
        "♻ ORGANIC → Organically Grown; NO Fertilizers, Pesticides or artificial irrigation and ZERO chemicals. Feel good about cooking with bamboo as it does not leach toxic chemicals into your food while cooking like the plastic alternatives do",
        "♻ EASY TO CLEAN → Bamboo is easy to clean and fights bacteria naturally.. Safe for Dishwasher and make sure to periodically apply Totally Bamboo’s mineral oil to keep bamboo fibers strong and beautiful",
        "♻ TOP QUALITY, PREMIUM CRAFTED BAMBOO COOKING SPOON AND SPATULA SET → Totally Bamboo 5 Piece Utensil set has a utensil for every kitchen need; durable and long lasting bamboo for baking and cooking. They stay strong under pressure and make delivering the tastiest food to your family incredibly easy. Set includes a turner, slotted spatula, spoon, slotted spoon and a single hole mixing spoon. Dimensions: 12\" long",
        "♻ RENEWABLE → Made of Moso bamboo which is known for its strength, density and high quality; bamboo is one of the most renewable resources in the world as it’s the Fastest growing, NO clear cutting, NO erosion & NO replanting needed."
    ],
    "description": "This 5-Piece Set from Totally Bamboo covers all of your cooking and baking needs. The set includes a turner, slotted spatula, spoon, slotted spoon and a single hole mixing spoon. Whether or not you lo ...",
    "price": 877.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 500.0,
        "width": 500.0,
        "height": 1200.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01MZBIW4L",
        "B07C89BB9Y",
        "B002RL9CR2",
        "B00FN3R6N8",
        "B01G4AO19K",
        "B0785LCP1S",
        "B07C889F7Y",
        "B0000CCY1M",
        "B075RPSLCN",
        "B00BNRO60O"
    ],
    "rating": null
}