{
    "asin": "B002SSUQFG",
    "title": "Seiko Men's SNK809 Seiko 5 Automatic Stainless Steel Watch with Black Canvas Strap",
    "brand": "Seiko",
    "feature": [
        "Imported",
        "To the start the watch initially, swing from side to side in a horizontal arc about 30 seconds.",
        "37 mm stainless steel case and Hardlex mineral dial window and Precise 21-jewel automatic movement with analog display"
    ],
    "description": "Precise 21 Jewel Automatic Movement Hardlex mineral crystal crystal; brushed stainless steel case; black cloth weave strap Day and date function Black dial with white hands and arabic numerals; luminous; white and red sweeping second hand; exhibiton case back Water-resistant to 99 feet (30 M) Date is in english and spanish. Please refer to the instruction manual to know how to switch between the languages The Seiko 5 Men's Automatic Black Strap Black Dial Watch is a stylish timepiece with the convenience of automatic movement. A uniquely designed, black dial features white Arabic numbers marking the hours on an inner circle and the minutes on an outer circle, while small, bar indexes encircle the dial on an outside minute track. Silver-tone hands with luminous fill make it easy to tell time day or night, and the slim second hand is detailed with a red accent. For added convenience, a day and date display are set at three o'clock. The polished stainless steel case extends to meet the black nylon strap, which wraps comfortably around the wrist and fastens with a traditional buckle. Water resistant to 30 feet (100 meters), this high-performance watch is perfect for everyday wear.This is an automatic mechanical watch. Automatic watches do not operate on batteries, instead, they are powered automatically by the movement of the wearer’s arm. If the main spring in your automatic watch is not wound sufficiently, timekeeping may become less accurate. In order to maintain accuracy, wear the watch for 8 hours or more per day, or manually wind the main spring by turning the crown. When not in use, automatic watches may be kept charged with an automatic watch winder – a watch storage unit which may be purchased separately.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 60.0,
        "length": 590.0,
        "width": 590.0,
        "height": 590.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51zoGGEf1kL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kPdgHU9BL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51yMEUIXNCL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21KtW%2BfyMbL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Q6Xhc-Q2L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qIwONt0jL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B014MN9RCM",
        "B071FPDVQY",
        "B000G6R7B8",
        "B01MAVR3NO",
        "B00NIFXB8C",
        "B0072C7WDW",
        "B073QG1W1Y",
        "B06Y3L2SYX",
        "B073ZDDGWZ",
        "B016A8I8HC",
        "B072BZDM6Y",
        "B077TSCF5C",
        "B01FLLJ6IE",
        "B06XS9VSXR",
        "B073C1ZHS2",
        "B07DPBW6P4",
        "B07657P1FN",
        "B071HHGRGN",
        "B006CHML4I",
        "product-description",
        "B079G34QYP",
        "B0006AAS7E",
        "B01KD8J9W8",
        "B000LTAY1U",
        "B000EQS1JW",
        "B07CQ239NN",
        "B013UXBH8M",
        "B00093CZV0",
        "B006I22GT2",
        "B0735LW2SF",
        "B06XS9NQPF",
        "B01DPXDTMY",
        "B001E96DHA",
        "B06Y39FWWF",
        "B06XSC4H28",
        "B00HYATWVC"
    ],
    "rating": "4.1"
}