{
    "asin": "B003ODDS5E",
    "title": "Instant Ocean BIO-Spira Water Treatment for Aquariums",
    "brand": "Instant Ocean",
    "feature": [
        "BIO-Spira Makes Your Marine Aquarium Fish-Safe Instantly",
        "The live bacteria start working immediately to provide a safe and healthy environment for your fish without the long wait",
        "BIO-Spira can also be used after a water change, when adding new fish or after medicating"
    ],
    "description": "No matter what size your aquarium, Instant Ocean sea salts and water care products offer the smartest, easiest way to bring to ocean home. Our scientifically formulated sea salts are used exclusively by many of leading large-scale aquariums and research facilities across the country. Instant Ocean BIO-Spira makes marine aquariums fish-safe instantly*. This formula accelerates establishment of the bio-filter in a newly set-up saltwater aquarium. It can also be used after a water change, when adding new fish, or after medicating. Instant Ocean BIO-Spira contains patented and patent-pending strains of aquatic bacteria — proven to reduce fish loss due to ammonia and nitrite toxicity. Shake well. Add entire bottle to aquarium of up to 75 gallons. Aquarium is then ready for fish. See your retailer for advice on types and number of fish appropriate for your aquarium. This is the shelf-stable formula meaning no refrigeration is needed. *Fish-Safe Instantly: compared to non-treated aquariums, use of BIO-Spira significantly accelerates the bio-filter and keeps ammonia/nitrite concentration below harmful levels when you first add fish.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 65.0,
        "length": 160.0,
        "width": 300.0,
        "height": 700.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41J64CZILXL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61WuFn37IdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/611P5J5v-BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sA7dFWxzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412n0aVrd7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41PbYbhlmNL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "8.45-Ounce"
        }
    ],
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975446011",
            "title": "Fish & Aquatic Pets"
        },
        {
            "node": "2975478011",
            "title": "Aquarium Water Treatments"
        }
    ],
    "similar": [
        "B0018CLX9Q",
        "B01C6PE4G2",
        "B002DGOD34",
        "B0002AQO8U",
        "B002XT4UGQ",
        "B0782W75RD",
        "B01LXYK6PO",
        "B001EUE808",
        "B000HHSG5M",
        "B001D6Z7QW",
        "B00F8DVAO4",
        "B00025694O",
        "B002AK47JS",
        "B002DVTFGE",
        "B006MP0J4O",
        "B07C7Q5K4P",
        "B000255R5G",
        "B000255NKA",
        "B002YNYRIM",
        "B07DN2HSSQ",
        "B001LUOB6W",
        "B00G25IBBW",
        "B000260FV6"
    ],
    "rating": "4.6"
}