{
    "asin": "B003B3OOP0",
    "title": null,
    "brand": "Nature's Way",
    "feature": [
        "WOMEN'S MAX POTENCY MULTIVITAMIN: Alive! Max3 Daily Women's Multivitamin contains a complete formula of vitamins and minerals in addition to unique food-based blends.",
        "MAX POTENCY: Potent, nutrient diverse women's vitamin formulated with food-based blends and high-potency B-vitamins to help convert food into energy*",
        "FOOD-BASED: Premium formula blends include Orchard Fruits, Garden Veggies, Daily Greens, and nutrients to support bone health, daily energy, eye health, heart health, and immune health (1,130 mg per serving)*",
        "WOMEN'S MAX POTENCY MULTIVITAMIN: Alive! Max3 Daily Women's Multivitamin contains a complete formula of vitamins and minerals in addition to unique food-based blends.",
        "MAX POTENCY: Potent, nutrient diverse women's vitamin formulated with food-based blends and high-potency B-vitamins to help convert food into energy*",
        "FOOD-BASED: Premium formula blends include Orchard Fruits, Garden Veggies, Daily Greens, and nutrients to support bone health, daily energy, eye health, heart health, and immune health (1,130 mg per serving)*",
        "ANTIOXIDANTS: Daily vitamin contains antioxidants of Vitamin C, Vitamin E, beta carotene, and selenium",
        "SERVING SIZE: Take 3 tablets daily, preferably with food; Includes one bottle with 90 tablets. *These statements have not been evaluated by the Food & Drug Administration. This product is not intended to diagnose, treat, cure or prevent any disease."
    ],
    "description": "Nature's Way Alive! Women's Multi Maximum Potency, 90 Tablets support bone health, daily energy, colon health, eye health, heart health, and immune defense",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 600.0,
        "width": 500.0,
        "height": 400.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01FNEZA20",
        "B015RZ7NL6",
        "B003UEJAQ8",
        "B0771XZF8F",
        "B00DF7FOYM",
        "B003B3OOO6",
        "B003UEKH92",
        "B001GDAKFU"
    ],
    "rating": null
}