{
    "asin": "B003CTTZQQ",
    "title": "Tropic Isle Living- Jamaican Black Castor Oil (8 oz) Plastic PET Bottle",
    "brand": "Tropic Isle Living",
    "feature": null,
    "description": "Our all-purpose Jamaican Black Castor Oil is made from the highest quality castor beans which are gently roasted and processed to preserve its natural magnetism and balance. Our castor oil works to evict the toxins and parasites in your hair to leave your hair and skin looking beautiful. Utilizing the natural reflective and moisturizing capabilities, the oil will add sheen and luster to your hair. It also strengthens hair follicles to help promote strong, healthy, and beautiful hair. Have a small scar that won’t go away? Rub the castor oil onto the scarred area to help promote skin growth. Need to remove unsightly calluses? Simply rub some oil on the desired area and watch your skin soften. Our castor oil also treats nail fungus and protects the nail bed to accelerate nail growth. It truly is the product that everyone needs around their household.How To UseRub or brush the Castor Oil onto the desired spot, and enjoy the natural healing properties.About Us Tropic Isle Living was launched in 1992 with the conviction to bring to market a range of Jamaican herbs and herbal products that have been valued for generations for their benefits to the hair, skin and body. For over 20 years, they have specialized in making products with ingredients from Jamaica, Africa, and the Caribbean. Our products are not mass produced; they are made the traditional, hand-processed way. It is one way to preserve the natural magnetism of the products while paying homage its legacy.",
    "price": 1434.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 61.875,
        "length": 500.0,
        "width": 500.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Q3qTziBjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zX2rSNVZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41fSuQGh7iL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10666241011",
            "title": "Hair & Scalp Care"
        },
        {
            "node": "11057431",
            "title": "Hair & Scalp Treatments"
        }
    ],
    "similar": [
        "B003VI0HVA",
        "B07DZJN6NZ",
        "B01FKMEBD4",
        "B078FVTBW6",
        "B00KU8FYN0",
        "B00FZESMKG",
        "B000TAA9Q6",
        "B06XPRM3XQ",
        "B07DM31GC3",
        "B0186U9736",
        "B00ZD3T7E4",
        "B01BV3IMKY",
        "B00SE2D01W",
        "B00VN79K2I",
        "B072N9BTWD",
        "B072VTJH8V",
        "B01NALN8Q9",
        "B07D55Y3TN",
        "B00IPPH4X8",
        "B07DM37VDC",
        "B006LAFU8U",
        "B000V8MTIC",
        "B078B3DWR1",
        "B003COAFPQ",
        "B003CTU5MO",
        "B01BV3ILZA",
        "B07CMX7C77",
        "B00DS842HS",
        "B01188LHXG",
        "B01DQ061JY"
    ],
    "rating": "4.4"
}