{
    "asin": "B003DKEUKA",
    "title": "Montblanc Ink Bottle Mystery Black 105190 – Premium-Quality Refill Ink in Black for Fountain Pens, Quills, and Calligraphy Pens – 60ml Inkwell",
    "brand": "MONTBLANC",
    "feature": [
        "Montblanc's liquid ink in Mystery Black bestows an exclusive and elaborate style to any writing or drawing - perfect for calligraphy or signing certificates and contracts",
        "The classy black color stands for respectability and enigmatic creations - ideal for executive business and noting down vibrant stories",
        "The functional design of the jar allows the ink to gather directly below the opening for a convenient refill / The vintage look of the ink pot lends exclusivity to any office desk",
        "The high-quality ink is quick-drying and does not bleed through for a distinctive style of writing / The black ink flows smoothly and will not clog the tip of the pen",
        "Items delivered: 1 x 60ml bottled ink in Mystery Black by Montblanc / The perfect gift as an addition to fountain pens by Montblanc in an elegant box"
    ],
    "description": "The Mystery Black ink by Montblanc lends any writing and drawing an enigmatic and enticing nuance. The black ink stands for revelation, readyto unveil secrets and enjoy the allure of a velvet night. The functional as well as attractive design of the ink bottle taps into the company's traditionof time-honored design and refined creation.Montblanc is one of the world's leading brands of luxury writing instruments, watches, jewellery, leather goods, fragrances, and eyewear. Forover 100 years, Montblanc has been a synonym for the very highest writing culture. The white star emblem represents the snow-covered peakof Mont Blanc – the highest European mountain, symbolizing the brand’s commitment to the highest quality and finest craftsmanship. Eachindividual product represents Montblanc's long tradition of fine craftsmanship and its appreciation for the need to take time for the essentials.As modern life develops at a quickening pace, these values take on a new and greater significance, and Montblanc's products will help in sharingthese experiences.",
    "price": 2809.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 53.125,
        "length": 610.0,
        "width": 40.0,
        "height": 40.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51T7srAzGwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/4112AtmUqOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41u2ym%2BAexL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/310KdoHSF9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61o4GDvvmfL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Mystery Black"
        },
        {
            "name": "Style:",
            "value": "Non-Permanent"
        }
    ],
    "categories": [
        {
            "node": "1064954",
            "title": "Office Products"
        },
        {
            "node": "1069242",
            "title": "Office & School Supplies"
        },
        {
            "node": "1069784",
            "title": "Writing & Correction Supplies"
        },
        {
            "node": "1069820",
            "title": "Pens & Refills"
        },
        {
            "node": "490677011",
            "title": "Bottled Ink"
        }
    ],
    "similar": [
        "B016E0M0IY",
        "B00U1IJD72",
        "B007C0NV9S",
        "B00GGM8NYG",
        "B01FPEH5YE",
        "B079KHY612",
        "B07BCGWFCK",
        "B00BB20M4A",
        "B000WIUNOI",
        "B075MVXJ69",
        "B00AEUWPF4",
        "B00JDYLG1G",
        "B0083VFCE2",
        "B01MRH2EMH",
        "B0192TE906",
        "B003LR4262",
        "B07BRGFHZ2",
        "B00FJ62E3G",
        "B01GYYY7UE",
        "B07CKJK3S7",
        "B00JRUSVLO",
        "B004X547CK",
        "B06W2HD8B9",
        "B01FQJQ4BI",
        "B000J3VKH0",
        "B003LELEL6",
        "B072MLZBVQ",
        "B007KA0EJK",
        "B004CO9EFC",
        "B007GPJGNY",
        "B007GPIGBM",
        "B00GGM6T4M",
        "B005261ZG0",
        "B07D29P6CX",
        "B004W6SAR8",
        "B07C4385MZ",
        "B000J3X9VU"
    ],
    "rating": "4.7"
}