{
    "asin": "B0043T7FXE",
    "title": "Logitech Wireless Trackball M570",
    "brand": "Logitech",
    "feature": [
        "NOTE:The connector/wireless receiver is found inside the back side of the mouse. Wireless operating distance: Approx 10m4. Sensor Resolution: 540",
        "Trackball comfort: Sculpted shape supports your hand and stays in one place—move the cursor without moving your arm",
        "Work and play anywhere: Get smooth, precise cursor control wherever you use your trackball—your desk, couch, even your bed",
        "Logitech Unifying receiver: Connect up to six Unifying compatible devices with one tiny wireless.Long battery life: Go for up to 18 months without changing the included AA battery* (*Battery life may vary based on user and computing conditions) receiver that stays in your laptop.For Windows or Mac OS: Robust 2.4 GHz wireless connection lets you control your laptop, desktop computer or home theater PC wirelessly from up to 30 ft. away** (** Actual wireless range will vary with use, settings and environmental conditions) Please refer the User Manual before use.",
        "Compatible with Windows XP, Windows Vista, Windows 7, Windows 8, Windows 10 and Mac OS X 10.5 or later"
    ],
    "description": "Your coffee table. Your favorite chair. Your comfy bed. Now there's no limit to where you can get precise cursor control. This hand-friendly wireless trackball lets you work and play wherever you want. No mouse to move around. No tricky keypad leaving your hand feeling cramped. Just roll the ball with your thumb and click. Precision never felt so comfortable. Thumb-operated trackball and laser sensor for smooth, precise cursor control. Works anywhere you do—even your sofa. Powerful 30 ft. wireless range with tiny leave-in Logitech Unifying receiver. It has up to 18 months of power on a single AA battery. Scroll wheel and Back/Forward buttons for easy document and web page navigation. Enhanced comfort—refines the time-tested shape of the popular Logitech Trackman Wheel.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 570.0,
        "width": 180.0,
        "height": 370.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41o8Avio3rL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/311yzThqGyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41IXWFe%2Be3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41gTSJpg3gL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/417ftJi0KyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41hkndDGlTL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        },
        {
            "node": "172493",
            "title": "Input Devices"
        },
        {
            "node": "172499",
            "title": "Trackballs"
        }
    ],
    "similar": [
        "B01M6XU1M5",
        "B0787PGF9N",
        "B015VERVU6",
        "B01BXYA1Y6",
        "B002OOWB3O",
        "B0042BBR2S",
        "B001LDKO60",
        "B00CYX26BC",
        "B003TG75EG",
        "B0748D7S2Y",
        "B00IIDD0ZS",
        "B01MFXH88Z",
        "B0753P1GTS",
        "B00006B9CR",
        "B005EJH6RW",
        "B007S6HQ6K",
        "B002DPUUL4",
        "B075JF2S7H",
        "B004SUIM4E",
        "B06ZXSMTYY",
        "B01M4IPG7A",
        "B0756XFFJZ",
        "B0050SPZMK",
        "B018GFBCO8",
        "B06XBFV26G",
        "B0043A1F4S",
        "B074DRCSDM",
        "B06Y4LMXJ8",
        "B07B4LSKN7",
        "B00BIFNTMC",
        "B01M11FLUJ",
        "B009SPWCFY",
        "B002MMY4WY",
        "B002BCMM74",
        "B06XB4CM5Z",
        "B014I8UQJY",
        "B01NAYHWTO",
        "B073XDKBHX"
    ],
    "rating": "4.4"
}