{
    "asin": "B0041JIANA",
    "title": "DrFormulas DHT Blocker for Men and Women | HairOmega Advanced Hair Growth Supplements with Biotin 5000 mcg | Hair Loss Vitamins Pills, 45 Day Supply",
    "brand": "DrFormulas",
    "feature": null,
    "description": "HairOmega DHT Blocker ensures your hair is getting all the essential nutrients it needs. With its blend of over 41 nutrients and vitamins, including Biotin, HairOmega DHT Blocker is a hair growth supplement with the ability to both strengthen your hair and promote growth.Saw palmetto and Beta-sitosterol: Two herbal extracts known to block DHT, a hormone which can inhibit hair growth, which would then support hair growth.Biotin: Biotin can increase hair strength, may reverse hair loss and is often recommended by dermatologists for the initial treatment of hair loss.B vitamins: Nourish and support hair growth. This proprietary blend of vitamins and herbs allows your hair follicles to synthesize hair at the rate they were meant to.Vitamin E: Helps to maintain circulation and prevent a dry, itchy scalp. With rich antioxidant properties, this vitamin can protect and repair hair follicles.Vitamin C: Utilizes the production of collagen and helps to produce red blood cells, keeping hair follicles healthy. Vitamin C may also stimulate the production of IGF-1, which strengthens the hair follicle and produces cells that makes keratin. Hair is made up of keratin.Pygeum africanum: The extracts from pygeum bark include beta-sitosterol, other plant sterols, triterpenes, and certain compounds known as ferulic acids. It aids in hormonal balance.Lycopene: A potent antioxidant that can prevent damaged caused by free-radicals and protect healthy cells, thereby supporting hair growth.Zinc: Zinc is vital for healthy, young looking skin and prevents the scalp from becoming dry and flaky.HairOmega DHT Blocker from DrFormulas, with specifically chosen hair growth vitamins and natural DHT Blockers, can help you recover your confidence.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 400.0,
        "width": 220.00000000000003,
        "height": 220.00000000000003
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51UWQzDs0gL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51XnneArwRL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517TpY-fLbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qFBY9%2BFZL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10898755011",
            "title": "Hair Loss Products"
        },
        {
            "node": "11057581",
            "title": "Hair Regrowth Treatments"
        }
    ],
    "similar": [
        "B07CXJMBN1",
        "B0046MDK32",
        "B07CJWZ4XF",
        "B004PVLWW0",
        "B01ED49H20",
        "B0012BNVE8",
        "B006KL4TYG",
        "B0787KPXCV",
        "B01HCVCPJS",
        "B01KE592JU",
        "B01KNBHO4U",
        "B01B29PCUU",
        "B0000537A6",
        "B073YYNT9L",
        "B00FH692PQ",
        "B0046H39D8",
        "B017DTBQLM",
        "B01GGV3C1U",
        "B00BFFQMBA",
        "B01NBH0C91",
        "B01ENCBOA0",
        "B079RDR8ZD",
        "B00IOZWC2M",
        "B00LTZEEGQ",
        "B007HP04UM",
        "B079VW9VBM",
        "B01A845EFS"
    ],
    "rating": "4.0"
}