{
    "asin": "B0043WJRRS",
    "title": "MagicFiber Microfiber Cleaning Cloths, 30 PACK",
    "brand": "MagicFiber",
    "feature": [
        "Package includes: 30 MagicFiber Microfiber Cleaning Cloths (29 black, 1 Grey)",
        "Extremely soft, high-quality microfiber material absorbs and removes dust, oil smudges, fingerprints, and dirt.",
        "100% Safe for cleaning all types of surfaces, including eyeglasses, sunglasses, camera lenses, computer screens, televisions, binoculars, telescopes, and other delicate surfaces.",
        "Size: 6 x 7 inches (15cm x 18cm)",
        "Digital Goja is the only authorized MagicFiber Microfiber retailer. Backed with a Digital Goja 90-day 100% Satisfaction Guarantee."
    ],
    "description": "Not all microfiber cloths are MagicFibers. MagicFiber Microfiber Cleaning Cloths are made from the finest microfiber material using state-of-the-art manufacturing, with a specially fused saw tooth edge to prevent fraying. These premium ultra-soft cleaning cloths are 100% safe for all surfaces. Contains no harsh chemicals, and safely removes fingerprints, oil smudges, dust, and dirt. Streak free! Once you try a MagicFiber you'll never want to clean with anything else!- Ultra-soft and extremely fine microfiber fabric absorbs and gently lifts away fingerprints, oil smudges, dust, and dirt.- 100% Safe for cleaning all types of delicate surfaces like eyeglasses, sunglasses, camera lenses, binoculars, telescopes, laptops, tablets, computer monitors, TVs, and jewelry.- Specially designed saw tooth pattern fused edges prevents fraying.- The included grey cloth can be used to set your cameras white balance.- Individually wrapped to keep the cloth clean and dry so it will always be ready for use.- Conveniently sized to fit in your pocket, camera bag, eyeglasses case.- Can be machine or hand washed in warm water with like materials. Don't use any type of detergent, fabric softener, or bleach.- The MagicFiber Microfiber Cleaning Cloths are 100% safe for cleaning all types of surfaces, including multi-coated lenses, filters, binoculars, telescopes, eyeglasses, sunglasses, TV's, laptops, tablets, smartphones, and jewelry.",
    "price": 1998.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 40.0,
        "length": 670.0,
        "width": 430.0,
        "height": 180.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51AKLzJ%2BN-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51h4ZOVBVsL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513tqqctkjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FplwlS2oL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mGF8V6IML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5199egnc%2B4L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51d1idHEbCL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "172435",
            "title": "Accessories"
        },
        {
            "node": "172426",
            "title": "Cleaning Equipment"
        },
        {
            "node": "3346301",
            "title": "Cloths"
        }
    ],
    "similar": [
        "B0050R67U0",
        "B00K6C73ES",
        "B07289NV3T",
        "B005YV5HQC",
        "B07GBGD7JT",
        "B01HYKQR8W",
        "B00BR1FSU8",
        "B01NCOUY05",
        "B0050R68LS",
        "B01LWQ63NZ",
        "B079DRKDJ8",
        "B0050R66X8",
        "B01HYK30BY",
        "B00JFD6KAW",
        "B06XR9CSZC",
        "B07125GZWW",
        "B0030HG054",
        "B0043XZEEC",
        "B00NIA55JA",
        "B01DPVB12G",
        "B00B8VQ9SC",
        "B00K335FXQ",
        "B01HYKFR9W",
        "B00846UAZM",
        "B00A7P2JGQ",
        "B00RJSLJ4M",
        "B07CNJQSWG",
        "B00PCOAQI0",
        "B01FGHV5XC",
        "B01HYGU3V8"
    ],
    "rating": "4.7"
}