{
    "asin": "B004TSFBNK",
    "title": "Real Techniques Core Collection Hand Cut Hair Design Makeup Brush Set, Includes: Detailer, Pointed Foundation, Buffing and Contour Brushes, with Brush Case/Stand",
    "brand": "Real Techniques",
    "feature": null,
    "description": "Create a perfect canvas with our core collection of coverage essentials. Samantha and Nicola Chapman grew up surrounded by makeup. Their aunt was a top makeup artist in London, working with clients like David Bowie and Princess Diana. Their mum was makeup-involved too, always trying out the latest trends and being creative with her looks. As young girls, they experimented on one another, and of course Nic was the test subject, since Sam was the older sister. When it came time to choose their career path, it was clear that makeup artistry was the way to go. They were talented, creative, and keen to follow in the footsteps of their successful aunt. But, most importantly — they were passionate about beauty. In 2011, the Real Techniques brush collection was launched. Unbelievable brush quality was paired with professional, interesting, fun education from Sam and Nic. The launch day was memorable, as women from around the world started pouring to the website to learn more about this new brand. Fairly quickly, a global community of women who loved makeup began to form. Not only do they have a strong connection to Sam & Nic, but they also connect with one another — piping in on social media to answer questions and give input. Today, the brand has taken off in the US, UK, and around the world. Sam and Nic continue to grow as top makeup artists, writing columns for national magazines and newspapers, appearing on major network television as beauty experts, and editing their own digital magazine. Through Real Techniques, women everywhere are transforming their makeup routines, and themselves, with the approachable expertise, friendship, and tools from Sam & Nic.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 800.0,
        "width": 400.0,
        "height": 170.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41GNvfRxfbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41lsB6ZTRYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51iveuDiigL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Zj4m1T7wL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41PrjeBGWrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-MbuS73DL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41g59p-dqwL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11062741",
            "title": "Tools & Accessories"
        },
        {
            "node": "11059391",
            "title": "Makeup Brushes & Tools"
        },
        {
            "node": "11059451",
            "title": "Brush Sets"
        }
    ],
    "similar": [
        "B004TSFBJO",
        "B00I3VHKVK",
        "B00HE1ZRP6",
        "B075S4GPH2",
        "B01NA6G7CD",
        "B07CPQ57DR",
        "B00F9X34XS",
        "B01DPVUM62",
        "B01N1MKXEM",
        "B01M4MCUAF",
        "B01CE52IGC",
        "B01DPW4H8A",
        "B00QPNVC0I",
        "B01MQQBIHG",
        "B01MTUVCUD",
        "B01DPVWJWM",
        "B01DPW4F50",
        "B01K2UMMI0",
        "B018B8Q5Z6",
        "B01GEO76C0",
        "B004TSFE28",
        "B01MZZJ3O2",
        "B078GC3BPM",
        "B00LBKBVTW",
        "B018FC3394",
        "B004TSFEBY",
        "B01G74I1PI",
        "B01JINOV5E",
        "B00GW4OVF8",
        "B01GNVG89Q",
        "B01N1A00VH",
        "B01DPVH3ZA",
        "B007O7AYYE",
        "B01DPVZ75S"
    ],
    "rating": "4.5"
}