{
    "asin": "B005FMZVLQ",
    "title": "Invicta Men's 1512 I\"Force\" Stainless Steel Watch with Cloth and Leather Strap, Black",
    "brand": "Invicta",
    "feature": [
        "Round stainless steel watch featuring date window at four o’clock position with 60-second, 60-minute, and 1/10-second subdials",
        "Japanese quartz movement with analog display",
        "Protective mineral crystal dial window",
        "Features crown and pushers positioned at nine o’clock position and buckle closure on cloth and leather strap",
        "Water-resistant to 100 m (330 ft): suitable for snorkeling, as well as swimming, but not diving"
    ],
    "description": "Stainless steel case with a black canvas / leather-backed strap Fixed silver-tone bezel. Black dial with white hands and Arabic numeral hour markers. Minute markers. Tachymeter around the outer rim. Dial Type: Analog. Luminescent hands and hour markers. Date display at 4 o'clock position. Chronograph - three sub-dials displaying: 60 minute, 60 second, 1/10 of a seconds. Quartz movement. Scratch resistant flame fusion crystal. Screw down crown. Solid case back. Case diameter: 46 mm. Case thickness: 12 mm. Band width: 22 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: chronograph, date, tachymeter, hour, minute, second. Invicta Lefty Force Chronograph Black Dial Stainless Steel Mens Watch 1512. An undeniable force to be reckoned with, the Invicta Men's 1512 I Force Collection Chronograph Strap Watch is the perfect marriage of style and superior functionality. This rugged timepiece begins with a round 45mm stainless steel case with a fixed bezel and a prominent textured crown on the left side of the case with two pushers. These elements surround a dashing black dial, which is protected by a hardened mineral crystal and features white Arabic numeral hour markers with a stenciled look and luminous hands powered by reliable Japanese quartz movement. The dial also features three chronograph sub-dials offering 60-second, 60-minute and 1/10th-of-a-second sub-dials, a tachymeter scale on the inner bezel and a date display window at the 4 'o clock position. A black cloth strap with leather backing keeps this watch on the wrist, while a buckle clasp ensures its secure placement. Finally, this watch boasts water resistance up to 330 feet (100 meters). A stellar addition to any watch collection, don't let this Invicta slip through your hands.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 125.0,
        "length": 590.0,
        "width": 590.0,
        "height": 590.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51XieeVOhyL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2BKmoMoNxL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vdOaZIvSL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31CJLKlgvEL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XJpNUoSoL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51D7sJeEMwL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B005FN00PM",
        "B071V6YLY9",
        "B000EI858M",
        "B0009P66TK",
        "B01MU0N8WC",
        "B005FMZY36",
        "B06Y391SCN",
        "B00J082PTM",
        "B07657P1FN",
        "B000FVE3BQ",
        "B000GX8W2O",
        "B07CNZ296M",
        "B000820YD8",
        "B077ZK4PFJ",
        "B077CWPJ99",
        "B06Y3L2SYX",
        "B004FG8BY2",
        "product-description",
        "B003KRP0P0",
        "B01DPXDTMY",
        "B075F9HFSF",
        "B077Z8231V",
        "B00407XX6M",
        "B0009P66TU",
        "B06Y39FWWF",
        "B004FGA5AA",
        "B00HVQNSTG"
    ],
    "rating": "4.1"
}