{
    "asin": "B005NPHQ04",
    "title": "Jabra UC VOICE 550 Duo Corded Headset for Softphone",
    "brand": "Jabra",
    "feature": [
        "HD Voice - High quality audio for crystal clear conversations Enjoy high-definition sound with HD Voice and get crystal clear, intelligible communication",
        "Peak Stop - Peak Stop technology immediately removes potentially harmful loud sounds or tones before they reach your ears and keeps the sound level within the safe range to protect your hearing",
        "UC Plug-And-Play - Jabra devices feature intuitive call control and seamless connection to all leading UC applications and softphones.",
        "Noise Canceling Microphone reduces unwanted background noise and the noise-canceling microphones reduce unwanted background noise and are ideal in crowded and noisy, open office environments.",
        "Flexible boom arm tip for optimal positioning - The Jabra UC Voice 550 headset has a flexible boom tip arm to ensure the ideal microphone placement."
    ],
    "description": "The Jabra UC Voice 550 is a full-featured stereo headset ideal for professional users who need comfort and reliability. Padded headbands, wideband sound, and noise cancelling microphones deliver professional grade performance.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 40.0,
        "length": 740.0,
        "width": 580.0,
        "height": 220.00000000000003
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41w5OFdQPkL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31Yn9qXZj3L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172607",
            "title": "Telephone Accessories"
        },
        {
            "node": "229193",
            "title": "Headsets"
        }
    ],
    "similar": [
        "B074WTKWG6",
        "B00E67UV9S",
        "B00DWGIYW0",
        "B005NPHQAY",
        "B076PQNW99",
        "B077YG22Y9",
        "B006JH8T3S",
        "B06XWL72HP",
        "B075X1VL3Y",
        "B072C5QXCZ",
        "B07FKPYLNB",
        "B006GOG148",
        "B075KMD29F",
        "B076WSTTY2",
        "B005TOTI96",
        "B075G4JT4S",
        "B005NPHQ1S",
        "B00AQUO5RI",
        "B074KXN17M",
        "B0728KWLZK",
        "B075QLCNMG",
        "B076HPB1HQ",
        "B008SPM9VM"
    ],
    "rating": "4.1"
}