{
    "asin": "B006PU81QE",
    "title": "AVerMedia AVerTV Volar Hybrid Q, USB TV Tuner, ATSC, Clear QAM HDTV & FM Radio, Supports Windows & Android TV 7.0 or above (H837)",
    "brand": "AVerMedia",
    "feature": [
        "Watch free OTA channel through ATSC, ClearQAM, and Analog TV on your laptop. Listen to OTA FM Radio from your PC.",
        "DVR support allows you to access recordings of your favorite shows anytime with a click of a button.",
        "PC recording video formats supports both iOS and Android, or share with your friends on social media.",
        "Supports Android TV 7.0 and above with LiveTV app (Available On The Google Play Store).",
        "PIP (Picture in Picture) Function, Smart Channel Grouping, Time Shift",
        "Scheduled Recording, Closed Caption, & Electronic Program Guide. Mini antenna Included."
    ],
    "description": "AVerTV Volar Hybrid Q is presented with its elegant exterior and powerful performance that allows you to enjoy watching digital/ analog TV and listening to FM radio on your PC. The exclusive extendable High Gain Antenna promises a robust digital TV and FM radio reception. Even better, by simply connecting analog video devices through Composite or S-Video inputs, you can preserve your favorite videos in various digital formats. With the latest AVer MediaCenter3D software, you can easily pause, fast forward and rewind Live TV by applying TimeShift function when you need to leave the on-going show for a moment. Besides, you can also schedule a recording for your favorite program effortlessly via EPG without puzzling around finding the air time. Moreover, the real-time iPhone/ iPad format recording function allows you to enjoy recordings on your iPhone or iPad on the way without the tedious video conversion job. The accompanying SnugTV Station software lets you to enjoy your home TV real-time over the Internet when you are traveling around the world. Apart from those great software functions, AVerTV Volar Hybrid Q is fully compatible with Windows Media Center that allows you to watch TV with what you are accustomed to. *Snug TV software is now available on Apple App Store.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 55.00000000000001,
        "length": 590.0,
        "width": 200.0,
        "height": 790.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31hFPvzZ10L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31uipV-H-UL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/312LzeAq1kL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51AtG5D4PyL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "193870011",
            "title": "Computer Components"
        },
        {
            "node": "3012292011",
            "title": "External Components"
        },
        {
            "node": "3015428011",
            "title": "External TV Tuners"
        }
    ],
    "similar": [
        "B00603S1OS",
        "B007JPOX8O",
        "B0747LVW59",
        "B01H830YQ6",
        "B001DEYVXO",
        "B072Z9ZGSZ",
        "B078327RK2",
        "B0731QW3MR",
        "B0036VO2BI",
        "B07CLDGZ3Q",
        "B00LAP3GC8",
        "B075RXV2VR",
        "B07C84NPYS",
        "B01M8LOW8Q",
        "B077H1XKLX",
        "B00GY0UB54",
        "B06Y1HKLHY",
        "B078RHTZLC",
        "B06WGL96C4",
        "B00RKT1BTS",
        "B074GDT1KB",
        "B00I0QZMPE",
        "B000VM60I8",
        "B072KMZS8L",
        "B01H2XL524",
        "B01KCQSP4Y",
        "B01ICW9VXO",
        "B079CM9ZWS"
    ],
    "rating": "3.4"
}