{
    "asin": "B006LN4LE6",
    "title": "CanDo TheraPutty Plus Anti-microbial, Tan: XX-Soft, 6 oz",
    "brand": "Theraputty",
    "feature": [
        "Non-Toxic Anti-microbial additive resists growth of odor-causing microbes",
        "Anti-microbial TheraPutty material retains the clean, non-greasy feel of original TheraPutty material",
        "Strengthen hand muscles and improve fine motor skills through a variety of finger, hand and wrist resistive exercises",
        "Available in 6 distinct color-coded resistance levels that match the industry standard; from xx-soft tan to x-firm black"
    ],
    "description": "CanDo TheraPutty Plus Anti-microbial hand putty is the standard in resistive hand exercise material. Its Non-Toxic anti-microbial additive resists the growth of odor-causing microbes and kills microorganisms. The Anti-microbial TheraPutty material retains the clean, non-greasy feel of the original TheraPutty material. Available in six industry standard color-coded resistance levels, CanDo TheraPutty Plus Anti-microbial hand putty has different firmnesses ranging from xx-soft for strengthening the weakest grasp to extra-firm for developing a stronger grip.Squeeze, pinch, stretch or twist CanDo TheraPutty Plus Anti-microbial hand putty using a variety of different finger, hand and wrist resistive exercises to strengthen hand muscles, improve fine motor skills, and decrease stress. Just a few groups this product is ideal for include: physical and occupational therapists, golfers, tennis players, musicians, weight lifters, children, and the elderly. Available in convenient easy-to-open plastic containers (2, 3, 4 and 6 ounce) for individual patients to use at home and a choice of larger containers (1, 5 and 50 pound) for the hospital or clinic. CanDo TheraPutty Plus Anti-microbial material is gluten, latex and casein free.",
    "price": 1200.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 43.75,
        "length": 320.0,
        "width": 150.0,
        "height": 320.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31h%2Bok4lSdL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/316J0mYUIbL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        },
        {
            "name": "Color:",
            "value": "6 Ounce"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3775161",
            "title": "Medical Supplies & Equipment"
        },
        {
            "node": "3776531",
            "title": "Occupational & Physical Therapy Aids"
        },
        {
            "node": "3776561",
            "title": "Exercise Putty"
        }
    ],
    "similar": [
        "B006LN4FCO",
        "B01B8GQC10",
        "B006LN4J8Y",
        "B00IAGE6EW",
        "B01KWDGIEQ",
        "B006LN4PBU",
        "B001RQ5GM8",
        "B00U0K9MYU",
        "B01IBVWSQI",
        "B006LN4RJK",
        "B006LN4RTA",
        "B01NBSZ8QS",
        "B006LN51I6",
        "B006LN50S2",
        "B072WDJG1W",
        "B07284ZW2Z",
        "B003YR6AD2",
        "B006LN4WQI",
        "B006LN4LY6",
        "B0010Z5V6M",
        "B0052GOJ1S",
        "B006LN508W",
        "B00WILBK08",
        "B006LN4KEC",
        "B01BLYNWIU",
        "B006LN4IUI",
        "B001RQ3REC",
        "B00067E4YU",
        "B000KGOMBC",
        "B001ANL5BY",
        "B006LN4PWO",
        "B001763OS6",
        "B006LN4MLI",
        "B006LN4N4Y",
        "B002BV3URQ",
        "B006LN4NVM",
        "B006LN4ORK",
        "B006LN4EDO",
        "B006LN4MD6",
        "B006LN4LMS",
        "B006LN4IJE",
        "B001RPW9VU",
        "B006LN4DLC",
        "B006LN4JN4",
        "B006LN4DZS",
        "B00BRCFDFW",
        "B006LN4G32",
        "B002BV9JCG",
        "B06XS964V9",
        "B06X9881VR",
        "B006LN513G"
    ],
    "rating": "3.9"
}