{
    "asin": "B007ECFNQS",
    "title": "Biofreeze Pain Relief Gel, 4 oz. Tube, Cooling Topical Analgesic for Arthritis, Fast Acting and Long Lasting Pain Reliever Cream for Muscle Pain, Joint Pain, Back Pain, Colorless Formula, 4% Menthol",
    "brand": "Biofreeze",
    "feature": [
        "Biofreeze Pain Reliever is the #1 clinically used and recommended topical analgesic of hands-on healthcare professionals and for best results use in combination with their care (find one in your area on the Biofreeze website)",
        "Chiropractors, physical therapists, massage therapists, podiatrists and athletic trainers use Biofreeze to provide immediate relief from many common conditions such as arthritis and other causes of muscle and joint pain",
        "Biofreeze applies easily and penetrates quickly to relieve aches and pains related to sore muscles and joints, sprains, strains and bruises and can be applied to body parts such as the hand, wrist, elbow, foot, ankle, knee, hip, back, neck and shoulders",
        "This legendary pain relief formula is clinical research-proven, fast acting and long lasting, completely free of parabens and propylene glycol, made with USP grade ingredients, and available in both original green and dye-free versions",
        "The 4 Ounce Gel Tube is particularly well-suited for massage applications on larger muscle areas that benefit from the hands-on approach"
    ],
    "description": "Celebrating 25 years of legendary pain relief, Biofreeze has long been the preferred topical analgesic brand of people in pain. Hands-on healthcare professionals choose Biofreeze Pain Reliever because it is time-tested and clinically proven to work for patients under their care. The fast acting, long lasting formula provides quick and effective pain relief without the use of prescription drugs. When used before exercise or therapy, Biofreeze promotes more comfortable movement. Applied afterward it soothes sore muscles and joints to minimize next-day aches and pains. For everyday pain, Biofreeze has provided peace of mind and effective results for decades.",
    "price": 1026.0,
    "listPrice": 1698.9999999999998,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 200.0,
        "width": 300.0,
        "height": 600.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/418tCHC1ugL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41B9MPAOAQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61d5esS%2B1aL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5115YnpauhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51jPiE1zTxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51edvbMog1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31MOLH3YlPL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3760941",
            "title": "Health Care"
        },
        {
            "node": "10079990011",
            "title": "Medications & Treatments"
        },
        {
            "node": "3763561",
            "title": "Pain Relievers"
        },
        {
            "node": "3763741",
            "title": "Joint & Muscle Pain Relief"
        },
        {
            "node": "15316471",
            "title": "Treatments"
        },
        {
            "node": "15316491",
            "title": "Pain Relief Rubs"
        }
    ],
    "similar": [
        "B071NWDQQ7",
        "B009SQ7U28",
        "B074H8XLP8",
        "B074H8N8S8",
        "B0056PRKJI",
        "B01BPBMMLW",
        "B01GZQ4FZI",
        "B078SH4ZKX",
        "B00X1MXGZU",
        "B00TB73GZO",
        "B0026HDURA",
        "B01H32CV4U",
        "B06XVVV45C",
        "B07DGQHM86",
        "B01H2ZKP5K",
        "B07CNW2DWY",
        "B012A5Z89K",
        "B002J9HBXE",
        "B01LYHVPE2",
        "B07BMKC87P",
        "B074H94VV7",
        "B06XVPDMFZ",
        "info.html",
        "B0772WKSQ8",
        "B01H32CV6S",
        "B01H32CVFO",
        "B01B6QXC6A"
    ],
    "rating": "4.4"
}