{
    "asin": "B007RWZHXO",
    "title": "Casio Men's G-Shock GWM5610-1 Tough Solar Black Resin Sport Watch",
    "brand": "Casio",
    "feature": [
        "Imported",
        "Auto light feature will not work if the battery level falls below Medium (marked as M on the face of the watch).",
        "Turn on or off the auto light function by holding down the light button and turn wrist at a 40 degree angle towards the user in a dark environment",
        "Casual solar-powered watch with multiple functions including multi-band atomic timekeeping, shock resistance, EL backlight, world time (29 time zones, 48 cities), city code display, five daily alarms, 1/100-second stopwatch, countdown timer, full auto-calendar, battery indicator, and power-saving function",
        "Approximate battery life: 10 months on full charge (without further exposure to light)",
        "Water resistant to 200 m (660 ft): In general, suitable for professional marine activity and serious surface water sports, but not scuba diving"
    ],
    "description": "This model possesses Tough Solar and Multi-band 6 Atomic Timekeeping technology housed within an even slim profile octagonal case. Non-Stop Tough Solar Power provides energy via a small solar panel combined with a large-capacity rechargeable battery that enables a variety of energy-hungry functions to operate smoothly. Black resin band digital watch with neutral face.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 400.0,
        "width": 200.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41ZLWfAqyXL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21kUpSqfyDL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B001AWZDA4",
        "B0053HBJBE",
        "B009GEUPMY",
        "B07C8L9CRJ",
        "B000GX8WAG",
        "B07B3NDDR8",
        "B003MYYJD0",
        "B06XGTJDZ5",
        "B078VTXYSH",
        "B01I4GOAY8",
        "B07465BQZX",
        "B009S13XJC",
        "B00KTF1LSG",
        "B01LEEESUI",
        "B01NCP0CPG",
        "B01FLLJ6IE",
        "B01N7IF1Y4",
        "B00272NBJQ",
        "B000JQJS6M",
        "B07657P1FN",
        "B00SYXUF8W",
        "B00284ADAI",
        "B0755HPSN8",
        "B000EQS1JW",
        "B01M58GZOR",
        "B007EGYEL4",
        "B07FJNP18T",
        "B0083XFHIG",
        "B07BBVJM8T",
        "B06XRYCDJW",
        "B06Y3KMQZB",
        "B000GAYQKY",
        "B07CP6YFZQ",
        "B07C6TY98Y"
    ],
    "rating": "4.6"
}