{
    "asin": "B007YJQJTG",
    "title": "All Terrain Bite and Sting Soother, 2 Ounce, Natural Colloidal Oatmeal and Allantoin Based Itch Soother for Mosquito Bites, Bee Stings, and Other Insects and Bugs, Kid and Sensitive Skin Friendly",
    "brand": "All Terrain",
    "feature": [
        "Insect bites and stings happen, but don’t let that ruin your outdoor fun. All Terrain’s Bite & Sting Soother Spray helps relieve itchy insect bites and stings, naturally! From mosquitos to bees, soothe the itch with this skin friendly and kid safe spray.",
        "All Terrain Bite & Sting Soother Spray soothes irritated skin affected by insect bites & stings. Allantoin & colloidal oatmeal naturally soothe & temporarily protect your skin. Great for camping, hiking, & for families who spend a lot of time outdoors.",
        "Don’t let bugs keep you indoors! All Terrain Bite & Sting Soother is chemical free so you can keep your family itch free while enjoying the outdoors, naturally. Colloidal oatmeal based, All Terrain Bite & Sting Soother is good for sensitive skin & kids.",
        "Started by an outdoor enthusiast with Deet-Free Herbal Armor Insect Repellent & has a line of natural, safe & effective insect repellents, sunscreen, first aid, medicated skin care, soaps & hand sanitizers to help you live an active & healthy lifestyle",
        "All Terrain is committed to providing safe, effective, environmentally friendly skin care protection products to help you live an active, healthy life. All Terrain products prove that natural-based ingredients can work as well as chemical-based ones do"
    ],
    "description": "Natural soothing pump spray that temporarily protects and helps to relieve minor skin irritations and itching from insect bites and stings. Natural soothing pump spray that temporarily protects and helps to relieve minor skin irritations and itching from insect bites and stings.",
    "price": 800.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 140.0,
        "width": 140.0,
        "height": 490.00000000000006
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Ef3Zci-KL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3400371",
            "title": "Camping & Hiking"
        },
        {
            "node": "3401081",
            "title": "Safety & Survival"
        }
    ],
    "similar": [
        "B000OCMH9G",
        "B0016BFDN6",
        "B07D32D561",
        "B00E4MIPRA",
        "B000PGE032",
        "B07FLCMTSQ",
        "B00B7VA5C4",
        "B01B4ZABX0",
        "B000V53K60",
        "B00OYJDJCE",
        "B07CSVWB3L",
        "B07B9DD2Y4",
        "B000MWDYAY",
        "B007AJNRJ0",
        "B0015RX0LI",
        "B00VV5KRD8",
        "B007AJNZMY",
        "B01IAI49KU",
        "B01IG4X8BO",
        "B01KXWPZ22",
        "B005MGRMZS",
        "B002CMQJYU",
        "B00AKKQB2G"
    ],
    "rating": "4.1"
}