{
    "asin": "B0084H2KLI",
    "title": "Best All Natural Cuticle Oil - Bee Naturals Nail Oil Helps Cracked Nails and Rigid Cuticles - Perfect Vitamin E Enriched Treatment for Moisture, Softness & Health - Anti-Fungal Tea Tree Essential Oils",
    "brand": "Bee Naturals",
    "feature": null,
    "description": "BEE NATURALS CUTICLE OIL GIVE YOU STRONG AND HEALTHY NAILS YOU CAN BE PROUD OF ALONG WITH SOFT CUTICLES! Our Cuticle Oil Leaves You With Smooth cuticles. Super-penetrating formula conditions skin and nails. The special formulation is designed to both heal and protect your nails and cuticles. CONVENIENT CUTICLE OIL APPLICATOR CAP Great Nails and Cuticles are just a brush away. The applicator is included in the top so you can use the oil for cuticles anytime since it does not matter how \"neat\" you are when you apply it to your nails. Helps prevent ridges, while increasing nail flexibility. PURE, ALL NATURAL INGREDIENTSFor nails uses the purest ingredients for your sensitive hands. A conditioning treatment that penetrates deeply and quickly, softening cuticles and promoting strong, flexible natural nails and enhancements. Our ingredients include pure olive oil, avocado oil, castor bean oil, grape seed oil, tocopherol acetate (Vitamin E), and lavender, lemon and tea tree essential oils. MADE IN THE USA All Bee Naturals Products Are Proudly Made In The USA. We Pride Ourselves On Providing Americans Jobs. MONEY BACK GUARANTEE All our products come with a 30 day, no questions asked, MONEY BACK GUARANTEE. If there is something you do not like about our product, we will cheerfully refund your purchase price. We stand behind our products and want our customers to be with us for a long time. LEAPING BUNNY CERTIFIEDAll Bee Naturals Products AND The Ingredients We Use are Leaping Bunny Certified to be free of animal testing and cruelty. GET HANDS YOU ARE PROUD TO SHOW OFF Show off your pretty hands and nails. Our oil for nails will put a smile on your face at how well your nails do look. Strong, Healthy and Supple Nails and Cuticles.",
    "price": 1877.0,
    "listPrice": 2199.0,
    "prime": true,
    "dimensions": {
        "weight": 13.125,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41fFca8ru1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DP2RjVUFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51PS68RFBKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512XSW7z5LL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51D-bgcfD1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51MzzYNdxIL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61aqvHCoFFL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "17242866011",
            "title": "Foot, Hand & Nail Care"
        },
        {
            "node": "11062291",
            "title": "Nail Care"
        },
        {
            "node": "11062221",
            "title": "Cuticle Care"
        },
        {
            "node": "11062231",
            "title": "Cuticle Creams & Oils"
        }
    ],
    "similar": [
        "B009RT1DWY",
        "B072KC8WYW",
        "B01DPVYH7M",
        "B00VL22Z4A",
        "B07CJMZRDW",
        "B005HGWGVS",
        "B00198ZPU2",
        "B01DPW4S16",
        "B07BZWY58F",
        "B073VZ6X4M",
        "B00178TVXG",
        "B07998KWCW",
        "B00DONI9TE",
        "B01DPXP3U0",
        "B00GNHNY16",
        "B00GJX58PE",
        "B074Q1R1W5",
        "B000AADF20",
        "B00HRAXUH6",
        "B00FKNC2WG",
        "B0006NYV3S",
        "B012OU5SX2",
        "B01B12KCGC",
        "B076NF7JPH",
        "B002PK0ROW",
        "B007822PX8",
        "B00IEDYZS8",
        "B00HK1KQVA"
    ],
    "rating": "4.7"
}