{
    "asin": "B009QYH52C",
    "title": null,
    "brand": "Pilot",
    "feature": [
        "WRITES LIKE A GEL PEN, ERASES LIKE A PENCIL: FriXion lets you write smoothly but leaves room for error. Unique Thermo-Sensitive gel ink formula disappears with erasing friction. These are compatible with FriXion Ball, Clicker, and Retractable pens.",
        "PILOT FRIXION ERASABLE GEL PENS combine the convenience of a retractable pen with the incredible FriXion erasable gel ink. Erase and rewrite repeatedly without damaging documents - Eraser is at the top of the pen tip, retractable by pressing clip down.",
        "YOUR EVERYDAY ERASABLE GEL PEN: Complete Sudoku and crossword puzzles without a mistake or a hole in the paper. Life's hectic, keep calendars neat, even when appointments change. Students can use FriXion to take notes, edit papers, and complete homework.",
        "WRITES LIKE A GEL PEN, ERASES LIKE A PENCIL: FriXion lets you write smoothly but leaves room for error. Unique Thermo-Sensitive gel ink formula disappears with erasing friction. These are compatible with FriXion Ball, Clicker, and Retractable pens.",
        "PILOT FRIXION ERASABLE GEL PENS combine the convenience of a retractable pen with the incredible FriXion erasable gel ink. Erase and rewrite repeatedly without damaging documents - Eraser is at the top of the pen tip, retractable by pressing clip down.",
        "YOUR EVERYDAY ERASABLE GEL PEN: Complete Sudoku and crossword puzzles without a mistake or a hole in the paper. Life's hectic, keep calendars neat, even when appointments change. Students can use FriXion to take notes, edit papers, and complete homework.",
        "ORGANIZE AND DESIGN: With Pilot Pens you can do it all. We see your creative side; you should let it out! Bullet points don't only have to be plain black with our pens. You can dot to dot that paper with your favorite kinds of pens in your favorite colors.",
        "YOU'VE KNOWN US FOR YEARS: Compare the luxury writing experience of our FriXion pens on paper with other brands like Bic, PaperMate, Feela, Uni-Ball, Shuttle Art, Fineliner, Caliart, Lineon, Vaola, Sharpie, Smart Color Art, and Artist's Choice."
    ],
    "description": "Featuring a smooth, gliding feel with each stroke, these FriXion pens help make sure that your hand stays comfortable, even during long use. The easy-to-erase formula allows you to quick correct mista ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 9.0,
        "length": 229.99999999999997,
        "width": 80.0,
        "height": 720.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B009QYH40U",
        "B009QYH644",
        "B07C7VHB5S",
        "B00D5BGAWS",
        "B071Y3MSRK",
        "B009QYH61W",
        "B06ZXWVZ3X",
        "B01DMTPL9U"
    ],
    "rating": null
}