{
    "asin": "B009POIG9Y",
    "title": "3M Particulate Filter 7093B, P100 Respiratory Protection (Pack of 4)",
    "brand": "3M Personal Protective Equipment",
    "feature": [
        "N/A",
        "Exceptional 99.97% filter efficiency meets NIOSH P100-series test criteria",
        "Plastic filter encasement designed for high heat or wet applications",
        "An innovative solid-top air-inlet reduces premature loading",
        "Channeled airflow protects filter for enhanced breathability and longer service life",
        "Unique, spring-loaded filter cover design simplifies negative pressure user seal checks"
    ],
    "description": "NIOSH approved for environments containing certain oil and non-oil based particles. Use with 3M Respirators 5000 Series or 3M Cartridges 6000 Series with 3M Adapter 502, 3M Facepieces 6000 Series, or 3M Facepieces 7000 Series with bayonet filter holders. The 3M™ Particulate Filter 7093B, P100 helps provide respiratory protection against exposure to lead, asbestos, cadmium, arsenic, and MDA. The filter is effective for concentrations up to 10 times the Permissible Exposure Limit (PEL) with half facepieces or 50 times PEL with quantitatively fit tested full facepieces when welding, brazing, torch cutting, metal pouring and soldering. This filter helps protect against a wide range of oil and non-oil based particulate contaminants. Inventory needs and training requirements of safety equipment are reduced because this filter works for many different applications. This P100 filter is designed to protect in higher-heat applications. An innovative solid-top air-inlet reduces premature loading by allowing a channeled airflow. Industries in which this filter is commonly used include abatement, agriculture, construction, general manufacturing, pharmaceuticals, primary metals and remediation.The filter works with a wide range of facepieces, including 3M Half and Full Facepieces 6000, 7000 and FF-400 Series (sold separately). If used with 3M Adapter 502, the filter may also be used with 3M Respirator 5000 Series or 3M Cartridge 6000 Series (sold separately). The filter is NIOSH (National Institute for Occupational Safety and Health) approved for environments containing certain oil and non-oil based particles. The filter has been assigned the color code “magenta” in the NIOSH system. Passing NIOSH’s P-series test criteria, the 7093 P100 filter provides at least 99.97 percent filter efficiency against particles.Breathing hazardous particles can pose a risk to your health. NIOSH, a Federal government regulatory agency, has tested and approved the 3M™ Particulate Filter 7093 to help reduce exposure to certain particles. p> For more than a century, 3M has applied innovation and technology to improving our customers’ lives and supporting their business goals. Today the company, from its headquarters in St. Paul, Minnesota, serves industrial and commercial customers and consumers in nearly 200 countries. Occupational Health and Environmental Safety products, focused on worker safety, include respirators, hearing-protection products, air-monitoring devices, environmental-safety products, and comprehensive training programs. The 3M brand, across thousands of products, represents consistency, superior quality, and value.",
    "price": 1485.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 500.0,
        "width": 120.0,
        "height": 720.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41pqMzsQMHL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "3180231",
            "title": "Safety & Security"
        },
        {
            "node": "486555011",
            "title": "Personal Protective Equipment"
        },
        {
            "node": "17864516011",
            "title": "Masks & Respirators"
        },
        {
            "node": "3753541",
            "title": "Safety Masks"
        }
    ],
    "similar": [
        "B008MCUULW",
        "B078J4KWFY",
        "B077CR7TBH",
        "B07CVX1C8H",
        "B008MCUT86",
        "B000A7PCS8",
        "B01FVQ1TC0",
        "B076BSN5NH",
        "B0742J7MGT",
        "B00LXF8OSQ",
        "B00LXF95XY",
        "B007K0RV6Y",
        "B0009JNF1I",
        "B000XBFJP2",
        "B00IF7RCU6",
        "B00BT2SWTE",
        "B00328IAO0",
        "B079K7TSLP",
        "B009POHH94",
        "B009POI1V2",
        "B009POHG2M",
        "B07C4TNXWM",
        "B004HXBCMG",
        "B00CEHI82Y",
        "B07CT4STXV",
        "B00AEXIS4S"
    ],
    "rating": "4.4"
}