{
    "asin": "B00BYEMNA6",
    "title": "Galaxy Note 8 Battery Charger Case, ZeroLemon SlimPower 5500mAh Extended Charging Case Portable Battery Case for Samsung Galaxy Note 8 - Black",
    "brand": "ZEROLEMON",
    "feature": [
        "Extend 120% + Power to Galaxy Note 8 - The powerful 5500mAh Li-polymer extended battery can effectively provide 100%+ extra battery life to Galaxy Note 8, which is equivalent to add 48 + hours talk time, 16+ hour’s movie time or 74+ hour’s music time.",
        "Sync phone to Computer - File transfer technology supported. You can transfer data and file from your Note 8 to a computer without having to take the battery case off.",
        "Ultra Slim Protection - ZeroLemon Slim Power protects your Note 8 from scratches and other daily wears and tear, yet small and convenient enough to fit easily in your hand or pocket.",
        "Intelligent Power Indicator – 4 LED colors indicate you the battery levels and charging status. Integrated button allows you to choose when to charge for when you need it most. Know before you go.",
        "Zero Defect Guarantee – 365 days ZeroLemon Guarantee Warranty with Amazon 30 days Full Refund Guarantee; Lifetime Customer Support from ZeroLemon. 100% Zero Defect Guarantee..",
        "Tips on using the product: Ensure to connect the charging port correctly. To fully charge the item, it should be charged for another half an hour after the LED light is white with no flash. Please press the power button for 3 seconds before charging the phone",
        "Due to the design of the case, it is not compatible with the full screen protector The texting feature might get affected as the phone might git hot when being charged (which depends on the frequency of the phone’s CPU). However this is a normal occurrence, please allow the phone to cool down for a few minutes."
    ],
    "description": "Provides additional 100%+ charge to your Note 8, which is equivalent to add 24 + hours talk time, 16+ hour’s movie time or 74+ hour’s music time. Slim enough to hold and carry while protecting full-edge protection to your Note 8. Just simply slide the phone into the battery case for installation. To take out the case, just separate the phone from the camera hole and pull out the battery case. 1 x ZeroLemon 5500mAh Slim Juicer Battery Case for Note 81 x ZeroLemon Zero Defect CardBattery Input: 5V/1.8A (Max) Battery Output: 5V/1.8A(Max) Case Dimension: 6.61 x 3.09 x 0.75 (L x W x H) Product Weight: 5.26 OzCustomer Satisfaction is always our #1 priority. If you have any concerns on the product, our Customer Support Team will be here to help by phone and email.",
    "price": 2999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 660.0,
        "width": 80.0,
        "height": 310.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41lwVnu0xRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41dxDefIzxL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412TybFVvuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/516Y0c-XIEL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51KVlJ6IfWL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41D3hSv5bAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61afqD9ADcL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "7073958011",
            "title": "Battery Charger Cases"
        }
    ],
    "similar": [
        "B075HV1SBF",
        "9652676764",
        "B07GB13S66",
        "B07BWBMZDL",
        "B00CXZI3DQ",
        "B072WMY8N6",
        "B07BQSFJFB",
        "B074G1W2RC",
        "B073RWJ6Z7",
        "B076ZL73XH",
        "B0058GWR8O",
        "B077B35RFW",
        "B076H3T4Y2",
        "B074SVCT11",
        "B076HWYC5D",
        "B01HQWR8CM",
        "B075Y2P5MM",
        "B07B61JKQL",
        "B0786D4STQ",
        "B0722Y1GY1",
        "B07CZTZLB8",
        "B071L9ZH7V",
        "B01KU737QG"
    ],
    "rating": "3.7"
}