{
    "asin": "B00CPCHBCQ",
    "title": "3M Peltor X-Series Over-the-Head Earmuffs, NRR 31 dB, One Size Fits Most, Black X5A (Pack of 1)",
    "brand": "3M Personal Protective Equipment",
    "feature": [
        "N/A",
        "Over-the-head hearing protection with Noise Reduction Rating (NRR) of 31 dB",
        "3M’s highest attenuation (noise reduction) earmuffs for very high noise exposures",
        "Twin headband design helps reduce heat buildup with good fit and balance",
        "Earcups tilt to ensure a customized fit and comfort for individual users",
        "Electrically insulated (dielectric) wire headband helps reduce exposure to electrical hazards"
    ],
    "description": "The X-Series earmuffs are 3M's latest advancement in hearing conservation. New technologies in comfort, design and protection all come together in this groundbreaking earmuff line. The X5A earmuffs offer the highest NRR (31 dB) for an earmuff on the market which makes them ideal for very high noise situations. The high attenuation delivered by X5A earmuffs is possible as a result of a combination of advanced technologies including: newly designed spacers, specially formulated earcup liners and innovative foam contained in the cushions. The X-series (over-the-head) headband version is electrically insulated - sometimes referred to as \"dielectric\". The metal components of the headband have been covered by non-conductive material for use in a low voltage electrical hazard (less than 440 V ac). As there are no applicable standards for testing ear muffs against electrical insulating properties, the product has been evaluated at an external laboratory against a modified test method based on EN397:1995. During assessment, the leakage current did not exceed 1.2mA when the external surface of the product made contact with an electrical source. The NRR may overestimate the hearing protection provided during typical use. Hearing protection solutions made innovatively easy. The 3M Peltor X series earmuffs are ideal for protection against noise arising from a wide range of applications in the workplace and leisure activity. Examples of typical applications include: metal processing, automotive, airports, construction, textile manufacturing, chemical and pharmaceutical, manufacturing, cement manufacturing, printing, woodworking, heavy engineering, foundry, steelworks, mining and quarrying. Headband and headband cover/sleeve: stainless steel wire, TPE, polyester, polypropylene, acetal. Hard hat attachment arm: stainless steel wire, acetal, polyamide. Earcups: ABS/TPU. Earcup inserts: PU foam. Earcup cushions and cushion covers: PU foam and PVC. Black color. Dielectric. Hearing protection style: over the head. Noise reduction rating: 31 decibel. Product type: earmuffs. Size: one size fits most.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 95.0,
        "length": 450.0,
        "width": 819.9999999999999,
        "height": 570.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41xxGPvFl1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-E50rebUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/518QPt3xtQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2BVkAE9F1L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "31 dB"
        }
    ],
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "10971181011",
            "title": "Sports & Fitness"
        },
        {
            "node": "706813011",
            "title": "Hunting & Fishing"
        },
        {
            "node": "13364359011",
            "title": "Shooting"
        },
        {
            "node": "3304074011",
            "title": "Eyewear & Hearing Protection"
        },
        {
            "node": "3413511",
            "title": "Earmuffs"
        }
    ],
    "similar": [
        "B017RZ45F6",
        "B00CPCH658",
        "B019BGOOV4",
        "B00CPCH86A",
        "B00467AHXI",
        "B00CPCHLMQ",
        "B00CPCHIO2",
        "B01HI8CN24",
        "B01BEENYCQ",
        "B00CPCHADQ",
        "B00AEY4QP2",
        "B01L1U9L5W",
        "B00CPCH9KA",
        "B07D7YMP17",
        "B001T7QJ9O",
        "B07C7C4Y7V",
        "B07CM4FLCQ",
        "B0711S7GBR",
        "B0017YEMPM",
        "B074KBB7C1",
        "B014UX1C2M",
        "B01A12J3GI",
        "B00009LI4K",
        "B00NKSMPZW",
        "B071WG8CV7",
        "B0081TOEZE",
        "B071F7K8NQ",
        "B0119PODHU"
    ],
    "rating": "4.7"
}