{
    "asin": "B00E65F7R6",
    "title": "Kirkland Signature Hair Regrowth Treatment Extra Strength for Men 5% Minoxidil Topical Solution, 12 Fl Oz",
    "brand": "Kirkland Signature",
    "feature": null,
    "description": "Kirkland Signature&trade; Minoxidil Extra Strength for Men 5% Minoxidil Topical Solution Hair Regrowth Treatment Regrows more hair than 2% Minoxidil Topical Solution. Results may occur at 2 months. Kirkland Signature&trade; Minoxidil Extra Strength Hair Regrowth Treatment For Men has been shown to regrow hair in men with the following degrees of thinning hair or hair loss. Before use, read all information on package and booklet. Keep the carton. It contains important information. Hair regrowth has not been shown to last longer than 48 weeks in large clinical trials with continuous treatment of 5% minoxidil topical solution for men. In clinical studies with mostly white men aged 18-49 years with moderate degrees of hair loss, 5% minoxidil topical solution for men provided more hair regrowth than 2% minoxidil topical solution. Store at controlled room temperature 20&ordm; to 25&ordm; C (68&ordm; to 77&ordm; F). If men have more hair loss or hair loss in a place different than shown in additional image, Kirkland Signature Minoxidil Extra Strength Hair Regrowth Treatment for Men may not work. When using this product: Do not apply on other parts of the body. Avoid contact with the eyes. In case of accidental contact, rinse eyes with large amounts of cool tap water. Some people have experienced changes in hair color and/or texture. It takes time to regrow hair. Results may occur at 2 months with twice-a-day usage. For some men, you may need to use this product for at least 4 months before you see results. The amount of hair regrowth is different for each person. This product will not work for all men.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 120.0,
        "length": 900.0,
        "width": 600.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51b6J73iCeL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10898755011",
            "title": "Hair Loss Products"
        },
        {
            "node": "11057581",
            "title": "Hair Regrowth Treatments"
        }
    ],
    "similar": [
        "B0012BNVE8",
        "B00HG1JFXY",
        "B002VLZHLI",
        "B00KEG85DE",
        "B079VW9VBM",
        "B00BMLOKHU",
        "B0793L5922",
        "B0089NNH1Y",
        "B01DQ09EYS",
        "B00LEWIK8M",
        "B01B29PCUU",
        "B01N4LCH6M",
        "B00F211APG",
        "B00M6I5SNI",
        "B00H22KZ2C",
        "B01904PI6W",
        "B00EXPSYVA",
        "B00AINMFAC",
        "B074H5SHBH",
        "B074M6JNML",
        "B01ENCBOA0",
        "B0185PXU3K",
        "B0000Y8H3S",
        "B008BMOEGA"
    ],
    "rating": "4.1"
}