{
    "asin": "B00FFIGYOI",
    "title": "BEHRINGER U-PHORIA UM2 48kHz 2-channel USB Audio Interface with XENYX Mic Preamplifier",
    "brand": "Behringer",
    "feature": [
        "2x2 USB audio interface for recording microphones and instruments.Audiophile 48 kHz resolution for professional audio quality.",
        "Compatible with popular recording software including Avid Pro Tools, Ableton Live, Steinberg Cubase, etc.Streams 2 inputs / 2 outputs with ultra-low latency to your computer, supporting Mac OS X and Windows XP or higher.",
        "State-of-the-art, +48 V-powered XENYX Mic Preamp comparable to stand-alone boutique preamps.Powerful Phones output with Level control and Direct Monitor select.",
        "Status, Signal and Clip indications for perfect overview.USB port for connection and power.Free audio recording, editing and podcasting software plus 150 instrument/effect downloadable plug-ins",
        "Headphone and RCA stereo outputs provide easy monitoring.Dedicated instrument-level input accommodates your guitar or bass"
    ],
    "description": "When it’s time to make recording history, you need the best audio interface you can get – and you need one you can count on. The amazing UM2, an ultra-compact 2 x 2, 48 kHz USB interface with a studio-grade XENYX Mic Preamp, combination XLR/TRS input for your vocal and direct instrument input (no DI required) and an additional ¼ \" Instrument Input. The rich feature-set, which also boasts a powerful Phones Output for the Direct Monitoring of your session, plus 2 Outputs and USB-supplied power – makes the UM2 the best, and most-portable recording interface in its class!.You take your tracks seriously, and the UM2 respects them too, providing 48 kHz resolution, for the amazingly-detailed and pristine recording quality your music deserves.The ultra-compact UM2 is totally compatible with virtually all popular recording software including Avid Pro Tools*, Ableton Live*, Steinberg Cubase*, etc., so you can record tracks directly into you favorite computer-based DAW – and mix and master to your heart’s content.The studio-grade XENYX Mic Preamp used in the UM2, has been praised by audio engineers all over the world for its hug-headroom, low-noise operation. These state-of-the-art mic pres represent a major step in the evolution of audio technology – and they can easily hold their own, even when compared to the most expensive stand-alone mic preamps. XENYX preamps offer a staggering 130 dB of dynamic range, with a bandwidth that extends from below 10 Hz to well above 200 kHz. Armed with these outstanding mic preamps, the UM2 provides such transparent, crystal-clear performance you just might think someone upgraded your mics while you weren’t looking.The UM2 Mix control allows direct monitor select, which means musicians can experience their performance clearly.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 114.99999999999999,
        "length": 500.0,
        "width": 459.99999999999994,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41NB-32jT2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ZR3jNuQSL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31hFscMsY2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-NvBSxVBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41GPIoFrk7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41LlgBKQU-L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "11091801",
            "title": "Musical Instruments"
        },
        {
            "node": "11974521",
            "title": "Microphones & Accessories"
        },
        {
            "node": "8882490011",
            "title": "Accessories"
        },
        {
            "node": "11974581",
            "title": "Preamps"
        }
    ],
    "similar": [
        "B00XOXRTX6",
        "B00EK1OTZC",
        "B004LWH79A",
        "B000JRPYGE",
        "B00B5LXI5W",
        "B074JGHHWH",
        "B075CSHLYH",
        "B0006H92QK",
        "B0006NMSWY",
        "B001EW5YQS",
        "B0002GZZNY",
        "B01JNLUA5G",
        "B00X87FAOI",
        "B07FLPKMGH",
        "B01D5H8KO2",
        "B000K6B59Y",
        "B0074FUYWS",
        "B0002KZAKS",
        "B015GDVSJ2",
        "B01JNLUMMW",
        "B019GYKGRC",
        "B00FFIGZF6",
        "B01E6T56CM",
        "B00DY1F2CS",
        "B005HZYZWW",
        "B00ZFR1LJW",
        "B01JNLTTKS",
        "B0010SZZI8",
        "B01LY7QM1N"
    ],
    "rating": "4.0"
}