{
    "asin": "B00GB85MZI",
    "title": null,
    "brand": "NatureWise",
    "feature": [
        "GET LEAN: Improve your muscle to fat ratio with Nature Wise CLA 1250, our bestselling workout supplements for women & men. Studies suggest that CLA supplements support fat loss and lean muscle gain.*",
        "FAT BURNER PILLS: Conjugated Linoleic acid or CLA pills are thought to function as thermogenic fat burners for men & women by reducing fat storage and prompting the body to burn fatty acids for energy to fuel your workout.*",
        "PREMIUM QUALITY: NatureWise CLA comes from pure, premium quality, non-GMO safflower oil obtained from certified sources and standardized to a high potency of 80% pure, active CLA 1000 mg per 1250 mg softgel.",
        "GET LEAN: Improve your muscle to fat ratio with Nature Wise CLA 1250, our bestselling workout supplements for women & men. Studies suggest that CLA supplements support fat loss and lean muscle gain.*",
        "FAT BURNER PILLS: Conjugated Linoleic acid or CLA pills are thought to function as thermogenic fat burners for men & women by reducing fat storage and prompting the body to burn fatty acids for energy to fuel your workout.*",
        "PREMIUM QUALITY: NatureWise CLA comes from pure, premium quality, non-GMO safflower oil obtained from certified sources and standardized to a high potency of 80% pure, active CLA 1000 mg per 1250 mg softgel.",
        "NATURAL & NON-STIMULATING: Unlike some weight loss or bodybuilding supplements, our CLA fat loss pills are made with clean, simple, natural ingredients that are non-stimulating, non-addictive, and safe for ongoing use.",
        "WE TAKE TRANSPARENCY SERIOUSLY: Scan this product with the Transparency mobile app for instant access to in-depth product information, including details about our ingredients and third party lab test results that verify purity.",
        "EASY MONEY BACK GUARANTEE: Every body responds differently to dietary supplements. If CLA isn’t right for you, or you are unsatisfied for any reason, simply contact NatureWise for a full refund. No risk, no hassle."
    ],
    "description": "Size:180 count What is CLA? Conjugated linoleic acid (CLA) is a polyunsaturated fatty acid naturally found in beef and dairy products. Most CLA dietary supplements are made from safflower oil. Results ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 88.125,
        "length": 310.0,
        "width": 310.0,
        "height": 700.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00ISAPPLI",
        "B01BMDAVIY",
        "B00UMPBD2C",
        "B00SCSQEV6",
        "B01F2OG8B8",
        "B07CPVHQ7F",
        "B01LXGBK0K",
        "B01MTJZNQF",
        "B00HAS5BUY",
        "B00IQFMZRC",
        "B00B5H5BGA",
        "B00GBQ3K54",
        "info.html",
        "B076W4JZJD"
    ],
    "rating": null
}