{
    "asin": "B00GBQ3K54",
    "title": null,
    "brand": "NatureWise",
    "feature": [
        "HIGHEST POTENCY ALA: NatureWise Organic Flaxseed Oil delivers 720 mg ALA Omega-3 essential fatty acids per softgel, the highest concentration of ALA in any flaxseed oil supplements.",
        "PLANT-BASED ALTERNATIVE TO FISH OILS: Flaxseed oil offers a cleaner, more sustainable, plant-based source of omega-3 essential fatty acids compared to fish oil supplements.",
        "PURE, ORGANIC, & COLD-PRESSED: Our pure flaxseed oil is carefully extracted from organic, non-GMO flax seeds without the use of hexane or added heat, helping to preserve the delicate structure of the omega-3s.",
        "HIGHEST POTENCY ALA: NatureWise Organic Flaxseed Oil delivers 720 mg ALA Omega-3 essential fatty acids per softgel, the highest concentration of ALA in any flaxseed oil supplements.",
        "PLANT-BASED ALTERNATIVE TO FISH OILS: Flaxseed oil offers a cleaner, more sustainable, plant-based source of omega-3 essential fatty acids compared to fish oil supplements.",
        "PURE, ORGANIC, & COLD-PRESSED: Our pure flaxseed oil is carefully extracted from organic, non-GMO flax seeds without the use of hexane or added heat, helping to preserve the delicate structure of the omega-3s.",
        "ESSENTIAL HEALTH BENEFITS: Science confirms the importance of omega-3s in a healthy diet, with essential benefits for brain health, heart health, immune support, and healthy hair, skin and nails.*",
        "TRANSPARENTLY GOOD: Our flaxseed oil supplements are made from 100% natural, organic, non-GMO ingredients with no artificial additives, fillers or binders. Scan product package with the Transparency app to get the inside scoop on ingredients and see lab reports that verify purity."
    ],
    "description": "A Greener Source of Omega-3s Omega-3 essential fatty acids are an important part of any healthy diet. They help keep your brain and heart healthy and support a healthy inflammatory and immune response ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 95.0,
        "length": 310.0,
        "width": 310.0,
        "height": 700.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00CAZAU62",
        "B01BMDAVIY",
        "info.html",
        "B07CPVHQ7F",
        "B00O59PAZC",
        "B01B29KZ16",
        "B00126FELQ",
        "B008NC7QQS",
        "B00GB85JR4",
        "B0001VKXYG"
    ],
    "rating": null
}