{
    "asin": "B00HSADJ6C",
    "title": null,
    "brand": "GearIT",
    "feature": [
        "MINI HDMI TO HDMI – Use this GearIT Pro Series high speed Mini HDMI (Type C) to HDMI (Type A) cable connects Mini HDMI enable device such as laptop, camcorder, camera, portable media, tablet, smartphone toother HDMI enabled devices to TVs, LED TVs, OLED TVs Projectors, AV receivers and other HDMI devices that requires the high speed Mini HDMI (Type C) to HDMI (Type A) male to male cable connections.",
        "HDMI Ethernet Channel – HDMI Ethernet Channel technology consolidates video, audio, and data streams into a single HDMI cable, combining the unmatched signal quality and convenience of HDMI connectivity with the power and flexibility of home entertainment networking. It incorporates a dedicated data channel into the HDMI link, enabling high-speed, bi-directional networking at up to 100 Mb/sec.",
        "HDMI Audio Return Channel - The Audio Return Channel in HDMI 1.4 enables a TV, via a single HDMI cable, to send audio data “upstream” to an A/V receiver or surround audio controller, increasing user flexibility and eliminating the need for any separate S/PDIF audio connection.",
        "MINI HDMI TO HDMI – Use this GearIT Pro Series high speed Mini HDMI (Type C) to HDMI (Type A) cable connects Mini HDMI enable device such as laptop, camcorder, camera, portable media, tablet, smartphone toother HDMI enabled devices to TVs, LED TVs, OLED TVs Projectors, AV receivers and other HDMI devices that requires the high speed Mini HDMI (Type C) to HDMI (Type A) male to male cable connections.",
        "HDMI Ethernet Channel – HDMI Ethernet Channel technology consolidates video, audio, and data streams into a single HDMI cable, combining the unmatched signal quality and convenience of HDMI connectivity with the power and flexibility of home entertainment networking. It incorporates a dedicated data channel into the HDMI link, enabling high-speed, bi-directional networking at up to 100 Mb/sec.",
        "HDMI Audio Return Channel - The Audio Return Channel in HDMI 1.4 enables a TV, via a single HDMI cable, to send audio data “upstream” to an A/V receiver or surround audio controller, increasing user flexibility and eliminating the need for any separate S/PDIF audio connection.",
        "RESOLUTION IN 3D VIDEO 1080p 2D VIDEO @ 4K X 2K UHD - The latest version of the HDMI standard establishes critical infrastructure for implementing 3D video in the home, defining input/output protocols that will allow 3D displays and source devices to communicate through an HDMI link. It’s a major milestone on the path to bringing true 3D gaming and 3D home theater to the mass market, supporting resolutions up to 1080p in 3D. The latest HDMI specification support for extremely high video resolutions that go far beyond today’s 1080p systems. 4K is shorthand for 4,000 lines wide by 2,000 lines high, or roughly four times the resolution of a 1080p display. The two supported formats is 3840 pixels x 2160 pixels and 4096 pixels x 2160 pixels.",
        "PRO SERIES LIFETIME GURANTEED – We stands for the highest quality product and customer satisfaction. If you are not happy with the product in anyway we offer an easy return policy. All product come with our top rated lifetime warranty service."
    ],
    "description": "High Quality High-Speed Mini HDMI to HDMI Cable with Ethernet Support 3D and Audio Return. The GearIT High-Speed Mini HDMI to HDMI Cable with Ethernet provides a one-cable solution for many of your ho ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 650.0,
        "width": 50.0,
        "height": 950.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00DJ5XH4O",
        "B014I8UEGY",
        "B00608WXGA",
        "B072N3X39J",
        "B014I8UAPE",
        "B014I8UHXE",
        "B014I8TVLI"
    ],
    "rating": null
}