{
    "asin": "B00H28YG1C",
    "title": null,
    "brand": "Old School Labs",
    "feature": [
        "BURN FAT & PRESERVE MUSCLE: As featured in Los Angeles Confidential Magazine. If you're looking for the best weight loss supplement, you've found it! Vintage Burn is the world's first muscle-preserving fat burner for men and women. Its unique thermogenic weight loss formula helps burn fat for energy while preserving muscle, and improves mental focus, mood, and pre workout energy.",
        "TESTED AND TRUSTED: Third-party tested weight loss supplement made exclusively with premium ingredients including green tea extract, garcinia cambogia, and raspberry ketones to help burn stubborn belly fat. Zero artificial substances, zero synthetic additives, zero preservatives. Vintage Burn is the best weight loss supplement on the market to support a solid diet program.",
        "SAFETY ADVICE: For healthy adults only. Consult your physician if you are pregnant, nursing, taking medication, or have a medical condition. Do not use if seal is broken. If you experience discomfort, discontinue use and contact us for a full refund. Contains caffeine: too much caffeine may cause nervousness, irritability, sleeplessness, and, occasionally, rapid heartbeat, dizziness, jitteriness, nausea, and stomach pain. Keep this product and all supplements out of reach of children.",
        "BURN FAT & PRESERVE MUSCLE: As featured in Los Angeles Confidential Magazine. If you're looking for the best weight loss supplement, you've found it! Vintage Burn is the world's first muscle-preserving fat burner for men and women. Its unique thermogenic weight loss formula helps burn fat for energy while preserving muscle, and improves mental focus, mood, and pre workout energy.",
        "TESTED AND TRUSTED: Third-party tested weight loss supplement made exclusively with premium ingredients including green tea extract, garcinia cambogia, and raspberry ketones to help burn stubborn belly fat. Zero artificial substances, zero synthetic additives, zero preservatives. Vintage Burn is the best weight loss supplement on the market to support a solid diet program.",
        "SAFETY ADVICE: For healthy adults only. Consult your physician if you are pregnant, nursing, taking medication, or have a medical condition. Do not use if seal is broken. If you experience discomfort, discontinue use and contact us for a full refund. Contains caffeine: too much caffeine may cause nervousness, irritability, sleeplessness, and, occasionally, rapid heartbeat, dizziness, jitteriness, nausea, and stomach pain. Keep this product and all supplements out of reach of children.",
        "GUARANTEED RESULTS OR YOUR MONEY BACK: Old School Labs supplements never compromise on quality and always include clear and complete supplement facts without any \"proprietary blends.\" We stand by our products 100%. If you are not completely satisfied with any OSL product, we will help you resolve your concern or provide a full refund.",
        "OSL HERITAGE: Old School Labs, California; Supplements That Make Sense, 40 Years in the Making. Only one thing has ever mattered to OSL: our customers. Before becoming a best-selling national brand with thousands of loyal customers and followers, this was our priority. That will never change. Our team of experts are available by email or social media to answer questions regarding the best way to use a product. Our products are sold on Amazon.com, proudly formulated in California, made in U.S.A"
    ],
    "description": "WHAT IS VINTAGE BURN? Vintage Burn is a highly effective thermogenic fat burner for weight loss assisting men and women - weight loss pills specifically formulated to preserve muscle and strength whil ...",
    "price": 4999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 250.0,
        "width": 250.0,
        "height": 500.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01BXLYEQ0",
        "B07B2PNK7P",
        "B012GAQDMU",
        "B01M230WNS",
        "info.html",
        "B01172A982",
        "B00P6VQYJO",
        "B00W0IB9BE",
        "B07CPN4WHJ",
        "B01AMOK4H2",
        "B00FV58KB0",
        "B071KB7GHH",
        "B01172ISF8",
        "B01MCQBFIE",
        "B0106RG7VM",
        "B012GAMAE0",
        "B01LXDJ207",
        "B012GATQTW"
    ],
    "rating": null
}