{
    "asin": "B00IWC9L9O",
    "title": "ORGANIC PUMPKIN SEED OIL Australian. 100% Pure / Natural / Undiluted /Unrefined Cold Pressed Carrier Oil. 2 Fl.oz.- 60 ml. For Skin, Hair, Lip And Nail Care. \"One Of The Richest Sources Of Enzymes, Fatty Acids, Iron, Zinc, Vitamins A, C, E And K\". by Botanical Beauty.",
    "brand": "Botanical Beauty",
    "feature": null,
    "description": "Organic Pumpkin Seed Oil is rich in vitamins A, C, E and K, enzymes, fatty acids, iron, and zinc. It is considered extremely nourishing and moisturizing, especially in helping to prevent fine lines. Organic Pumpkin Seed Oil provides a clear and a smooth skin tone, helps in healing wounds quickly. It prevents your face from getting pimples. Organic Pumpkin Seed Oil keeps your collagen in shape and also helps in skin renewal (anti-ageing properties). It is recommended for all skin types. The recommended usage is between 1-5%, up to 100%. FOR FACE: Just mix a few drops of Organic Pumpkin Seed Oil with your favorite cream. It is usually applied at night as a moisturizing agent. It is non-greasy and non-oily and absorbs into the skin very easily and does not leave an oily feel. FOR HAIR: Add 2-3 drops to your own favorite shampoo or conditioner. It gives the hair freshness, brilliance and luster. This oil is absorbed very easily by the skin and the scalp and helps the cells to rejuvenate. FOR FACE & BODY: Just mix a few drops of Organic Pumpkin Seed Oil with your favorite cream, lotion, make-up remover, shower & bath gel, shampoos, face mask, sunscreen products and various lip balms. You will love this oil.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 8.75,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51KN8P-x%2BkL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51D13LqRuZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51IDWOMrsUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RlDR8DuEL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060711",
            "title": "Face"
        },
        {
            "node": "11061301",
            "title": "Creams & Moisturizers"
        },
        {
            "node": "7792527011",
            "title": "Face Oil"
        }
    ],
    "similar": [
        "B078ZHTFDH",
        "B00PV15BPW",
        "B06X94XGYF",
        "B075NCC1YL",
        "B00OEIBJRW",
        "B0083KYVMC",
        "B0767Y6X6N",
        "B078ZHPLNR",
        "B077XC65Y2",
        "B00IWBSI9O",
        "B01H619Q3W",
        "B079KYQ9LY",
        "B01JRD7Y9U",
        "B00FH692PQ",
        "B01BPN6KG8",
        "B078ZH2VKW",
        "B076ZVY6RH",
        "B003NTELC8",
        "B01C54H8R6",
        "B01E0DUAVG"
    ],
    "rating": "3.6"
}