{
    "asin": "B00IMJ2L62",
    "title": "Avery No-Iron Kids Clothing Labels, Washer & Dryer Safe, Writable Fabric Labels, 45 Assorted Shapes & Sizes (40700)",
    "brand": "Avery",
    "feature": [
        "NO IRON NEEDED: Save time, mess and effort - apply these no-iron kids clothing labels directly onto the surface without bothering with an iron",
        "EASILY LABEL CLOTHING: Just write on the no-iron label, peel and apply. No-iron kids labels work best with permanent markers. No more lost and found or mistaken identity",
        "PERMANENT ADHESIVE: Name labels are water resistant and durable enough to withstand multiple washing machine and dryer cycles. Perfect when labeling frequently washed items like baby clothes and school uniforms",
        "VARIETY OF SHAPES & SIZES: Pack includes oval labels and three sizes of rectangle labels for a total of 45 labels on 3 sheets that can be used on items of all sizes",
        "SO MANY USES: Great for clothing labels, baby clothes labels, kids clothes labels, sporting gear, caps, water bottles, school labels, PE clothes, jackets, t-shirts, backpacks, luggage and camping gear"
    ],
    "description": "Make sure clothing always gets returned to its rightful owner with these no-iron kids clothing labels. They're great for labeling clothing like jackets, t-shirts, school uniforms, baby clothing, PE uniforms, hoodies and more. They also work great on baseball caps, blankets, lunch boxes, backpacks, tennis shoes and other fabric items. The assorted pack includes oval labels and three sizes of rectangle labels. Just write on the no-iron labels with a permanent marker, peel and stick. The labels work with many fabrics and are durable enough to withstand multiple washer and dryer cycles. Keep your kids' clothing out of the lost and found with these no-iron name and daycare labels.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": 450.0,
        "width": 710.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41HnmYH5-HL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tPvwAYruL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61y34-fhaKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61ef8CCgSuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31NNZ8q072L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51w54v4%2BtiL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1-pack."
        }
    ],
    "categories": [
        {
            "node": "1064954",
            "title": "Office Products"
        },
        {
            "node": "1069242",
            "title": "Office & School Supplies"
        },
        {
            "node": "490540011",
            "title": "Labels, Indexes & Stamps"
        },
        {
            "node": "1069388",
            "title": "Labels & Stickers"
        },
        {
            "node": "1069392",
            "title": "All-Purpose Labels"
        }
    ],
    "similar": [
        "B00U2O5XHE",
        "B01926WLZE",
        "B00VE6L134",
        "B07CVHNQNM",
        "B00NQTO3OQ",
        "B01L8P3Z84",
        "B07C7X88CF",
        "B07GT75Q51",
        "B0033PAPYU",
        "B0756VJNXG",
        "B06XC2ZM8S",
        "B076XKKNKN",
        "B072T9QTKW",
        "B0189VSNBY",
        "B000XF2SHU",
        "B0785KSZTT",
        "B01CYZ6VHY",
        "B003DXTG9M",
        "B01M0MLMG4",
        "B014RSDF3E",
        "B01G8L4T74",
        "B01BLS7EX0",
        "B07G56TKTV",
        "B00UVRYXVE",
        "B07F96Q5LR",
        "B0048SOBGO",
        "B00RDFT4IO",
        "B015ED7QNQ"
    ],
    "rating": "4.3"
}