{
    "asin": "B00IB6IAOS",
    "title": null,
    "brand": "Leven Rose",
    "feature": [
        "#1 RATED BEARD OIL FOR MEN - Keep Your Beard Healthy, Groomed and Tamed Naturally. Moisturizes Beard Hair and Skin, Eliminates Itching and Dandruff (Beard-druff) for a kissable and respectable beard. Use daily for the best beard effect.",
        "Contains Only 2 Ingredients - JOJOBA OIL, MOROCCAN ARGAN OIL. No fillers, fragrances, additives, parabens or GMOs. Product has not been tested on animals. Vegan friendly. (Argan Oil is often misspelled as Argon.) Say no to other lubricants and moisturizers that are labeled with lesser fillers. Use after showering and while only slightly damp. Shampoo only a few times a week for extra nourishing effects.",
        "AS FEATURED IN GQ - Soaks in quickly to treat and calm dry, coarse, unruly and wild beard hair. Calms under-beard skin and moisturizes beards for a tidier, groomed beard look and reduce dark spots.",
        "#1 RATED BEARD OIL FOR MEN - Keep Your Beard Healthy, Groomed and Tamed Naturally. Moisturizes Beard Hair and Skin, Eliminates Itching and Dandruff (Beard-druff) for a kissable and respectable beard. Use daily for the best beard effect.",
        "Contains Only 2 Ingredients - JOJOBA OIL, MOROCCAN ARGAN OIL. No fillers, fragrances, additives, parabens or GMOs. Product has not been tested on animals. Vegan friendly. (Argan Oil is often misspelled as Argon.) Say no to other lubricants and moisturizers that are labeled with lesser fillers. Use after showering and while only slightly damp. Shampoo only a few times a week for extra nourishing effects.",
        "AS FEATURED IN GQ - Soaks in quickly to treat and calm dry, coarse, unruly and wild beard hair. Calms under-beard skin and moisturizes beards for a tidier, groomed beard look and reduce dark spots.",
        "Dark amber ounce glass bottle and glass stopper EXTENDS SHELF LIFE as oils are light sensitive & must be stored in dark amber bottles to protect them from UV light rays and oxidation. Pure natural oils not packaged in dark bottles will lose potency & become non effective.",
        "Leven Rose offers a 100% MONEY BACK GUARANTEE and outstanding customer service for no-risk purchasing. Don't absolutely love it? We'll quickly refund it - no questions asked. And we answer all emails and form submissions. LevenRose helps guys give their face the maintanance it deserves."
    ],
    "description": null,
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 2.0,
        "length": 490.00000000000006,
        "width": 350.0,
        "height": 160.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B019FYL7L2",
        "B00VKFT9II",
        "B009NNFB0O",
        "info.html",
        "B00M49SG0Q",
        "B01692GG8M",
        "B013XKK1KC",
        "B00TMV1TH6"
    ],
    "rating": null
}