{
    "asin": "B00JFC9BJU",
    "title": "Mediabridge Banana Plugs - Corrosion-Resistant 24K Gold-Plated Connectors - 12 Pair/24 Banana Plugs (Part# SPC-BP2-12)",
    "brand": "Mediabridge",
    "feature": [
        "Includes 12 pairs of banana plugs, which are meant for attaching to speaker wire and supplying a high-quality signal path from audio components like a speaker to an audio/video receiver, amplifier or other professional sound application.",
        "Compatible with bare wire, spades, or other banana plugs, and work with 8-18 AWG speaker wire. Connectors & crimping teeth are coated in corrosion-resistant 24K gold-plating for lasting, for secure fits with clarity, natural sonic accuracy and no distortion. A wider base minimizes shorting for maximum signal transfer, and a 2-piece screw-on design makes for reliable termination/reuse.",
        "Simply connect existing speaker wires to a banana plug through its bottom piece (step-by-step installation guide included). Self-crimping teeth make for easy one-time installs, and a low profile build only sticks out 1.",
        "The heavy-duty plugs are color coded, distinguishing left from right to enable matching polarity. Fast-lock is a great plug-and-play alternative to using bare wire when connecting devices, taking away the hassle of crimping or soldering.",
        "Each plug has a female banana plug connector on the bottom, allowing you to hook up speakers to a single output."
    ],
    "description": "Attaches to speaker wire, supplying a high-quality signal path from audio components like a speaker to an audio/video receiver, amplifier or other sound application. Works with bare wire, spades, other banana plugs & 8-18 AWG speaker wire. Connectors & crimping teeth are coated in 24K gold-plating for lasting corrosion-resistance. Corrosion-resistance provides secure fits with clarity, natural sonic accuracy & no distortion. A wider base minimizes shorting for maximum signal transfer, & a 2-piece screw-on design makes for reliable termination. ULTRA Series banana plugs are made from premium materials for a pro-grade output. Self-crimping teeth make for easy 1-time installs & a low profile build only sticks out 1”. Color coded, distinguishing left from right to enable matching polarity. Fast-lock is an easy plug-&-play alternative to bare wire setups, taking away the hassle of crimping/soldering.- Attaches to speaker wire, for a high-quality signal path between audio components- Corrosion-resistant 24K gold-plated connectors & crimping teeth for secure fits & clarity- Wider base for optimal signal transfer & 2 piece screw-on design for reliable termination/reuse- Color coded, distinguishing left/right to enable matching polarity- Self-crimping teeth for 1-time setup- Bare wire, spades, other banana plugs & 8-18 AWG speaker wire- Works with audio components like a speaker, audio/video receiver, amplifier & more Connect existing speaker wires to a plug through the bottom (step-by-step user guide included)Unlike tedious bare speaker wire installs, these reusable plugs are designed for quick connections without fraying, meaning that wire tension effects the plug’s hold",
    "price": 2699.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 95.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51KjFtdTBDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51l7lgLfZVL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61MWQSvB2gL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Etb2UACFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51QjvTNcQbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/415bzEzP2UL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31dI7L5DRxL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172532",
            "title": "Audio & Video Accessories"
        },
        {
            "node": "172544",
            "title": "Connectors & Adapters"
        }
    ],
    "similar": [
        "B06Y8YL2DM",
        "B0758CVS43",
        "B01E0E5CIG",
        "B00JFC9ALE",
        "B00VXQBK3Q",
        "B00N18V91W",
        "B01D5H8GYG",
        "B00DI89Z8E",
        "B00KGK2VHO",
        "B07DFKNFX5",
        "B006U3O566",
        "B004HKKZGS",
        "B077YG22Y9",
        "B00004SY4H",
        "B007QUYQSY",
        "B00GWOMMA4",
        "B0097JLQVC",
        "B073SQYXTW",
        "B07D2GS5WD",
        "B077JFK5YH",
        "B01MR7XLBS",
        "B00N18VBSI",
        "B06XCM9LJ4",
        "B016QVZF06",
        "B075DYPZ4N",
        "B00DI89IQS",
        "B01DFKC2SO",
        "B01N5F28ZK",
        "B003FVYXY0"
    ],
    "rating": "4.9"
}