{
    "asin": "B00JLPM8AK",
    "title": "Vitamin C serum 22 by serumtologie Anti Aging - 1.15 oz",
    "brand": "serumtologie",
    "feature": null,
    "description": "C serum 22. sérumtologié Vitamin C 22 facial serum is a painstakingly formulated skin care product that has the highest concentration levels of clinically proven ingredients, and is designed to be safe, effective, and non irritating to the skin. Our serum provides many benefits to the skin including hydration, skin softening and brightening, reducing the appearance of fine lines and wrinkles, and protection from damaging effects of the sun.Our professional grade serum contains 22% Vitamin C, (which is anywhere from 10-45% more than our competitors), and is blended with hyaluronic acid, Ferulic Acid, and Vitamin E to help boost collagen and reveal a more radiant, youthful complexion. Daily use of the C 22 serum is an effective anti aging treatment for men or women, and will have you looking your best at ANY age!For best results, we recommend using both morning and night, and pairing with our sérumtologié PURE whipped chiffon moisturizer. Purchase together and experience the sérumtologié difference!At sérumtologié, we do NOT test on animals and our products will never contain Parabens, Phthalates, Petrochemicals, Sulfates, Synthetic Dyes, Aromas, or GMO's. NOTE: due to the natural botanicals in the formulation of C º22 the color can vary from clear to a milky white. This is based on the fact that like all things that are grown in the ground, the color and consistency can vary due to the climate, soil & geography that the various natural ingredients are sourced from. BUY with confidence! Your skin is waiting for the nutrients it needs. Treat yourself to sérumtologié today!",
    "price": 3500.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 100.0,
        "width": 100.0,
        "height": 350.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412OAltsHZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51TUZr45ozL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61sP0Czv7ML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/514IyGtoIML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61rGK5jwfhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51e3Z0l5uVL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410RDtpGIRL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060711",
            "title": "Face"
        },
        {
            "node": "11062031",
            "title": "Treatments & Masks"
        },
        {
            "node": "7792528011",
            "title": "Serums"
        }
    ],
    "similar": [
        "B00HE1VY44",
        "B07FD53LQZ",
        "B00NVGK7E4",
        "B00FFANXMM",
        "B01KMSTCWG",
        "B01M4MCUAF",
        "B0049OLZ84",
        "B0090UJFYI",
        "B01M1HIIUT",
        "B06X9CVH9D",
        "B07785LK6X",
        "B071YDXRQP",
        "B01DPVXXUY",
        "B00QQIMZJO",
        "B01GKGNX56",
        "B00HE0ZJIM",
        "B00JEMRBCA",
        "B01B6PQAHY",
        "B0161WES0I",
        "B01BI7EQFI",
        "B01DPXX1HW",
        "B01N2BKB0X",
        "B01LX6BBMV",
        "B01FLQCIGQ",
        "B008VK3F94",
        "B00163JVJQ",
        "B0091OCE2I",
        "B072FP882G"
    ],
    "rating": "4.2"
}