{
    "asin": "B00KVOFOCY",
    "title": "BEST SELLING Professional 8 Piece Makeup Brush Set with Designer Case Plus BONUS Stippling Brush. Hand-Made Powder, Foundation, Concealer, Eyeshadow Brushes and More. Professionally Endorsed.",
    "brand": "AsaVea",
    "feature": null,
    "description": "Feel more confident knowing that you have the right tools to easily and effortlessly apply makeup that makes you feel beautiful, radiant, and confident. The right tools make everything easier and faster which is why the Professional Makeup Brush Set from Be You, BEAUTIFULLY was designed from the ground up to make application effortless. Get ready for it, your friends will be asking how you did your makeup so well.Our brushes are unlike any other set you’ve had before. Each brush is hand-crafted with the highest quality synthetic hair that lasts longer than real hair brushes. Plus, all of our brushes are VEGAN, involve no animal cruelty, and are never tested on animals.\"I absolutely love this set. It has everything I personally believe you'll need, from start to finish, completing your ideal makeup look.\" - Allison, Seattle Makeup Professional\"After using these brushes for a few weeks, I have replaced my more expensive ones with these ones.” - Astute Connoissuer, Amazon ReviewAll Be You, BEAUTIFULLY products are backed by our Lifetime Money-Back Guarantee. If for any reason you’re not happy with your order, let our friendly Customer Service team know and we’ll give you a full, no questions asked refund of your entire order. That’s how much we stand behind our products and when you try them, we know you will, too.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 100.0,
        "length": 950.0,
        "width": 250.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51kpwkweC0L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CAsQ%2BhH6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51JOJVwK0BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DxuV3iP9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51evCqEcAPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sxq5w929L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "11058091",
            "title": "Styling Tools & Appliances"
        },
        {
            "node": "17168139011",
            "title": "Irons"
        },
        {
            "node": "11058261",
            "title": "Straighteners"
        }
    ],
    "similar": [
        "B01N9RJ4D7",
        "B072C8XFVS",
        "B01DPW4H8A",
        "B01LZFH8PV",
        "B07DGCG3RN",
        "B01MT5FFF0",
        "B01DPVZ75S",
        "B07FDSL38K",
        "B01LZ3RLPC",
        "B07CRVCHMV",
        "B01DPW4F50",
        "B01GOW023M",
        "B071GDZKQS",
        "B07F8M559R",
        "B00SY7UYTS",
        "B01DPVUM62",
        "B074VYMGLF",
        "B07BY2KZSY",
        "B01DPVWKGW",
        "B00LBKBVTW",
        "B01DPW3YFW",
        "B00YE3CPW0",
        "B06XGXP9RP",
        "B01DPVWJWM",
        "B01G7QE538",
        "B07DGQB49X",
        "B01BSB56OY",
        "B01DPVH3ZA",
        "B01B29E2RO",
        "B00H2YL8W6",
        "B07FGV9NQG"
    ],
    "rating": "4.3"
}