{
    "asin": "B00KNO2B00",
    "title": "Victorinox Swiss Army RangerGrip 178 Multi-tool Pocket Knife",
    "brand": "Victorinox",
    "feature": [
        "Features 12 functions to equip you for everyday adventures including - 3.9\" one-hand 2/3 serrated lock blade, phillips screwdriver, and 4.2\" double-cut wood saw (See product description for full list of features)",
        "Stainless steel construction encased in two-component scales provides sleek durability",
        "Two-component contoured handle provides superior grip while one-hand locking blade mechanism keeps blade securely in place during use",
        "Length: 5.12\" (130mm), Weight: 5.6oz",
        "Made in Switzerland; Victorinox provides a lifetime guarantee against defects in material and workmanship",
        "Contains 9 Implements with 12 Different Functions",
        "Ergonomic handles with rubber inlays that improve grip"
    ],
    "description": "Made for skilled craftsman and tested by professionals, the RangerGrip series offers a more robust array of tools for larger jobs. The two component handles are ergonomic and offer superior grip and one-hand blade opens with a simple flick of your thumb, thus locking it securely into place during use.Durable enough to last a lifetime, and guaranteed for it, you can rely on this knife for years to come. With elements such as a can opener, Phillips screwdriver, and 4.2\" wood saw you'll always have the right tool for the right situation. Like all Swiss Army Knives, the RangerGrip has a lifetime warranty, stainless steel implements and Swiss-made quality and durability. Includes 12 Functions:In 1884, Master Cutler Karl Elsener opened a cutlery shop in Ibach, Switzerland. There, he and the cutlers’ union he formed produced the finest steel cutlery, finished with the now-famous proprietary edge preferred globally by professional and home cooks. In 1891, Karl supplied the Swiss Army with its standard issue Soldier’s Knife and in 1897 with the Officer’s Knife. In 1921, after the death of his mother, Victoria, and with the advent of stainless steel, then known as “inoxydable\" and used in the production of his cutlery, Karl changed the name of the company to Victorinox. It is from those humble beginnings that a worldwide icon was born.Today, Victorinox is still owned and operated by the Elsener family, and both the company and family still resides in the small village of Ibach, Switzerland. The various tools are manufactured from high-quality steel with precisely tuned features that are essential for the particular application. The steel is tempered, annealed and polished to achieve the necessary hardness and provide optimum resistance to corrosion.To re-sharpen your knife, use a whetstone at an angle of 15°– 20°. This will result in a cutting angle of 30°– 40°. If sharpening on a grinding wheel, always cool with plenty of water to avoid excessive temperatures and the resulting damages that may occur.After you’ve used your Swiss Army Knife for all of its various applications, such as cutting open numerous boxes, you may notice that the blades begin to stick together. Opening and closing the blades in warm water several times will allow the tools to easily move again. Once they have dried, it is recommended, to apply a small drop of oil between the blade or tool shank and the spring. To optimally maintain the locking mechanism, periodically apply a drop of our recommended Swiss Army Knife Oil. Never put Swiss Army Knives in the dishwasher.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 31.25,
        "length": 509.99999999999994,
        "width": 80.0,
        "height": 60.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41JeEiOyS8L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61ToJmrkG-L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3400371",
            "title": "Camping & Hiking"
        },
        {
            "node": "3400851",
            "title": "Knives & Tools"
        },
        {
            "node": "3400881",
            "title": "Folding Knives"
        }
    ],
    "similar": [
        "B00KNO2AVU",
        "B0000CF94L",
        "B01L13UUYU",
        "B000687B44",
        "B06XP8X3BQ",
        "B0002RIFL2",
        "B073VRGPNQ",
        "B06XX27R9X",
        "B005LHGBB4",
        "B0019WXPQY",
        "B01LXT4TOW",
        "B078GLWN79",
        "B01MY28X3L",
        "B00KQBKMT2",
        "B07GZTXNCG",
        "B01AC4E3N8",
        "B079Y8D1PS",
        "B00KNO2916",
        "B07DPVLX2Q",
        "B00YPUOLG0",
        "B00KNO2AV0",
        "B01LXHEQO1",
        "B0103JS8H4",
        "B00004YVB2",
        "B01MDKIGHZ",
        "B00004YVB4",
        "B00KNO2952",
        "B000AR7AKG",
        "B075SDLN71"
    ],
    "rating": "4.4"
}