{
    "asin": "B00LGRDFDK",
    "title": "SUN JVP-110 528-GPH Wave Maker Pumps, 4 Piece",
    "brand": "SUN",
    "feature": [
        "528 gph and wide-spread range which is ideal for freshwater or marine aquarium",
        "Totally submersible and oil-free motor to avoid pollution to the living circumstance",
        "360 degree rotation to allow full flow directions",
        "Suction cup with articulating ball joints for versatile directions"
    ],
    "description": "Are the dead spots in your aquarium annoying you so much? Do you feel the fish inanimate? The SUNSUN jvp-110 is dynamic and fully submersible 528 gph aquarium wave maker have your aquarium cleared and revitalized. With articulating ball joint, this maker allows a full 360 degree rotation to generate waves of water movement. This item can be used to improve oxygenation as well as to let your fishes, corals and other aquatics enjoy a vital and energetic ocean-like circumstance. Really an inexpensive way to improve water movement especially for saltwater coral, reef or fish tanks no more debris settling on the bottom or in the corners of the tank. Nor any sands being blown away from the bottom leaving a bare spot. No annoying noise, no other side effects to the fishes, the corals and other aquatics .",
    "price": 2099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 180.0,
        "length": 600.0,
        "width": 600.0,
        "height": 300.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/514fNTpdq6L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975446011",
            "title": "Fish & Aquatic Pets"
        },
        {
            "node": "2975469011",
            "title": "Aquarium Pumps & Filters"
        },
        {
            "node": "2975475011",
            "title": "Water Pumps"
        }
    ],
    "similar": [
        "B009YEEW2K",
        "B01M5E4N20",
        "B01GZPQ8OA",
        "B008E8K4G0",
        "B0002563MW",
        "B07C9FQTX3",
        "B005TJCU0U",
        "B0002DGNJC",
        "B01N3L3M4Y",
        "B079GVZ1YJ",
        "B075XR7BVF",
        "B01M68JT9V",
        "B078M7Q8HN",
        "B01M8L2YF2",
        "B00YYIHGXS",
        "B07812RVGQ",
        "B01IR4RCBU",
        "B00LGRDF8A",
        "B00YYIHGVA",
        "B078LZJJ2W",
        "B072BY352Y",
        "B01ITSXEX4",
        "B07D8H1C67"
    ],
    "rating": "4.0"
}