{
    "asin": "B00L87YFL4",
    "title": "Legion Triumph Daily Multivitamin Supplement - Vitamins and Minerals for Anxiety, Depression, Stress, Immune System, Heart Health, Energy, Sports & Bodybuilding Workouts. 30 Svgs.",
    "brand": "Legion Athletics",
    "feature": null,
    "description": "Triumph contains 21 essential vitamins and minerals, including those often overlooked or under-dosed in other natural multivitamins like vitamins K1, K2, and D, and zinc, magnesium, iodine, and chromium.That’s not all, though -- it also contains 14 additional herbs and phytonutrients proven to boost physical and mental health and performance, lower stress, improve sleep, and more.When you live an active lifestyle, your body needs all the immune support it can get to help fight off bugs and stay healthy.That’s why Triumph contains 3 ingredients scientifically proven to strengthen your immune system and ward off sickness.Triumph was formulated especially for athletes that demand a lot from their bodies and expect results from their sports vitamins.It contains 5 ingredients scientifically proven to improve physical performance and recovery, which means better workouts for you.Triumph contains 4 ingredients scientifically proven to improve cognition, memory, and mood, and to reduce anxiety and depression.We hear from customers every day that love the clean energy boost they get from Triumph.Legion Athletics manufactures its products in the USA in a CGMP- and NSF-certified facility.We want each and every customer to be completely happy, which is why we offer our IT’S-ON-US MONEY-BACK GUARANTEE.Give Triumph a shot and if you’re not satisfied for any reason, simply contact us within 90 days of the purchase date and we’ll issue you a prompt refund.Feel free to contact us if you have any questions as well--we take customer service very seriously and are always happy to help (just look at our reviews!).",
    "price": 3997.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 65.0,
        "length": 70.0,
        "width": 310.0,
        "height": 620.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41-7yNzsKbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51XncnVc8WL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-ZiK7TbuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5126cSBp79L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51whKBZ4PDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517tx8xI94L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51oHh9zGSWL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "6936686011",
            "title": "Multi & Prenatal Vitamins"
        },
        {
            "node": "3774861",
            "title": "Multivitamins"
        }
    ],
    "similar": [
        "B000GFHPCU",
        "B00QYZ6MLG",
        "B0788YFZWW",
        "B01DP1BVQM",
        "B01LXVMPL9",
        "B01FNEZA20",
        "B00KWL6GNW",
        "B01N6EJ2H6",
        "B079YTFGJM",
        "B00W0I6TIM",
        "B0711GCS4V",
        "B00LV3LE3C",
        "B01LTBZUJE",
        "B00XK6F7K4",
        "B00WR6JGD2",
        "B00CDGJIAW",
        "B07CJNBMP5",
        "B076VQ6HJV",
        "B07C2J3YQC",
        "B06X3TDP4D",
        "B01NBTJFJB",
        "B013PTDH0M",
        "B00GOD0SRC",
        "B01CSU8YN4",
        "B01GS64JUG",
        "B078SS8T3T",
        "B01EXHI95S",
        "B01HGR02IO",
        "B079TYHWPH"
    ],
    "rating": null
}