{
    "asin": "B00MR05DQ2",
    "title": "SKIN LIGHTENING Whitening Cream Mask. Use as Dark Spot Corrector to Brighten Dark Skin. Natural Whitening Cream Mask for Face Body Dark Spots and Age Spots. Contains Vitamin C + B3 + Lactic Acids + Various Clays. Face Legs Body Knee Elbow Skin Brighteners. Popular with Korean Japanese Women Men - 100% Satisfaction GUARANTEED 4.2oz",
    "brand": "Pink Madison",
    "feature": null,
    "description": "Your skin goes through a life time of exposure to harsh sun, germs, pollution and other damaging elements. You may not be able to tell right away but if you do not provide your body with essential tools to fight back, one day you will look in the mirror, and the premature aging will hit you hard. At Pink Madison, we strive for your well being; which is why our primary focus is to make YOU look and feel beautiful in your skin again. Pink Madison Whitening Cream Mask works miraculously to whiten your skin and remove the blemishes to make you skin even tone. Our formula utilizes the most effective and safe whitening agents such as Vitamin C, Lactic Acids, the amazing skin Clay Bentonite, Magnesium, Vitamin B3 Niacinamide et el. ✔ This jar is TWICE the size (124 ml / 4.2 fl oz) of ALL other equivalent products ✔ SPA Quality Whitening Cream Mask at less than /10th the cost of visiting a Spa. ✔ Contains the perfect form of active, bio-available Vitamin C on the market ✔ 70% natural ingredients include Jojoba seed oil, Morus Alba root extract, Bentonite Clay, Papaya extract ✔ Directly tackles fine lines, wrinkles, age spots, crow's feet and dark under eye circles ✔ Suitable for daily use on ALL skin types, including sensitive and combination skin ✔ Made fresh to order each day at our women owned FDA inspected facility in USA ✿ This product has 90 day MANUFACTURER MONEY BACK GUARANTEE ✿ We apologize for the limited stock of our Skin Whitening Cream Mask. If you see the green 'In Stock' text above, please order today to avoid disappointment.",
    "price": 2499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 300.0,
        "width": 400.0,
        "height": 300.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412pZGt-BEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pl9J5ymEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41RjVEqOXAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41eAnfyiO4L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512ytKsxE2L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060711",
            "title": "Face"
        },
        {
            "node": "11062031",
            "title": "Treatments & Masks"
        },
        {
            "node": "11061121",
            "title": "Masks"
        }
    ],
    "similar": [
        "B07BMNGSGV",
        "B07DXL7FR3",
        "B078ZKT5PR",
        "B07G4YXXYJ",
        "B07G5X8BVQ",
        "B01GR5PGQ4",
        "B001VJVP0S",
        "B07CLVGYC2",
        "B07FF7ND3G",
        "B07FSHYP9G",
        "B01N8XF244",
        "B00G2TQNZ4",
        "B07C8HF9MT",
        "B01G13C8UO",
        "B07C84H7LR",
        "B01MXLF8TY",
        "B071KNC9Q9",
        "B01AFILSR0",
        "B077NJH7LQ",
        "B00HE06A62",
        "B07F82M1D8",
        "B07D8D7XKQ",
        "B07G132CCN",
        "B01IPICD08"
    ],
    "rating": "3.5"
}