{
    "asin": "B00MVMCJ54",
    "title": "Blender Bottle Classic Loop Top Shaker Bottle, 20-Ounce, Clear/Black",
    "brand": "Blender Bottle",
    "feature": [
        "20-ounce capacity (note: measurements only go to 12 ounces) shaker cup for mixing protein shakes, smoothies, and supplements",
        "Patented mixing system uses 316 surgical-grade stainless steel BlenderBall wire whisk found only in BlenderBottle brand shaker bottles",
        "Screw-on lid creates leak-proof seal, and flip cap snaps securely shut to keep contents contained; loop top for easy carrying or attaching keys",
        "Wide mouth makes it easy to add mix scoops and liquids, and embossed markings measure both ounces and milliliters",
        "BPA and phthalate-free, dishwasher safe; manufacturer’s limited lifetime warranty",
        "20-ounce capacity (Note: measurements only go to 12 ounces)",
        "Patented mixing system uses 316 surgical-grade stainless steel BlenderBall found only in BlenderBottle brand shaker cups"
    ],
    "description": "The BlenderBottle Classic 20-Ounce Shaker Bottle makes it easy to maintain proper nutrition and hydration on-the-go. Featuring a patented mixing system—with a 316 surgical-grade stainless steel BlenderBall wire whisk (found only in BlenderBottle brand shaker cups) that moves freely inside the bottle to smooth out drink mixes and meal ingredients—it’s ideal for protein shakes, smoothies, fiber drinks, and meal replacements. It’s also a handy kitchen tool for mixing pancake batter, scrambled eggs, and salad dressings. The wide mouth makes it easy to add scoops of powdered mixes, meal ingredients, and liquids, and embossed markings show both ounces and milliliters for easy measuring anywhere (note that markings on the 20-ounce capacity shaker cup only go up to 12 ounces). Bottle contents and liquids are securely contained thanks to a tightly threaded screw-on lid that creates a leakproof seal, and a flip cap that snaps securely shut for shaking and transportation. The convenient loop top makes it easy to carry the bottle and offers a place to attach car keys while at the gym. The BlenderBottle Classic 20-Ounce Shaker Cup can also be used as a water bottle; the ball can be left inside, as it will never rust, chip, or peel. BPA and phthalate-free, dishwasher safe. Manufacturer’s limited lifetime warranty.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 380.0,
        "width": 380.0,
        "height": 680.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/314de%2BH%2BljL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41pgw5scg7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BbDb4-SyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/519pFzi30oL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41apC1V0UbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41annN%2BEypL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51a0jDa9FaL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Clear/Black"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "6973663011",
            "title": "Sports Nutrition"
        }
    ],
    "similar": [
        "B01LX4GU8P",
        "B00M1VN1HA",
        "B00M1VNAZI",
        "B00MVMCFEE",
        "B00MVMCUK8",
        "B01BKT7T9Y",
        "B07617WLJF",
        "B01M0DPDYW",
        "B00MVMCF26",
        "B01M115K27",
        "B076PLDX1S",
        "B01M0DPE4F",
        "B01LXRWXSB",
        "B01LYFCOY5",
        "B01LYFCNSG",
        "B01LXCJVEW",
        "B002DYIZH6",
        "B013WHJD96",
        "B076CZKKCC",
        "B00MVMCFC6",
        "B072XWVWJQ",
        "B00M1VNC1A",
        "B006VT9R8A",
        "B00M1VNK0I",
        "B00MVMCFJE",
        "B06XCW3P64",
        "B0107HE6UK",
        "B01LY3Q4HX",
        "B0758SXQLG",
        "B073L557JF",
        "B00M1VNBX4",
        "B01LZ2UP91",
        "B00MHNZ85U",
        "B01LX4GTDW",
        "B076W2TKXP",
        "B07C58D935",
        "B01LZEGLWB",
        "B00M1VNBJ8",
        "B000QSNYGI",
        "B01LYR4L38",
        "B0765Y8B75",
        "B00MVMCJ22",
        "B073XBZ56Z",
        "B00M1VN15M",
        "B00J074W94",
        "B01M115K28",
        "B06XYCVDB9",
        "B01LZ2UMH0",
        "B01N25BZXJ",
        "B00M1VNJO0",
        "B00004OCNS",
        "B076CZS4DP",
        "B07BN2KHWZ",
        "B06XCT7G2X",
        "B00M1VNC2Y"
    ],
    "rating": "4.5"
}