{
    "asin": "B00NCSIN4W",
    "title": "Skullcandy Hesh 2 Bluetooth Wireless Over-Ear Headphones with Microphone, Supreme Sound and Powerful Bass, 15-Hour Rechargeable Battery, Soft Synthetic Leather Ear Cushions, Black",
    "brand": "Skullcandy",
    "feature": [
        "Supreme sound: Hesh 2 Wireless features Supreme Sound technology, producing attacking, powerful bass, warm, natural vocals and precision highs.",
        "All-day comfort, everyday strength: Soft synthetic leather ear cushions provide endless comfrot for your longest playlists. The flexible headband features a metal understructure that can withstand the punishment of everyday use.",
        "Long battery life: The rechargeable battery provides up to 15 hours of music when fully charged. Behind the left ear cup is a micro USB port for charging. An LED indicator will blink red when the battery is at 10%. Fully recharges in just 2.5 hours.",
        "Wireless pairing and control: Stream your music from any Bluetooth enabled devise. On-board plus and minus buttongs let you adjust volume and choose songs. Answer and place calls on hold with the round power button.",
        "Back-up aux cable: If you've transcended the need to sleep and your 15-hour battery needs charging, just plug in the included AUX cord with microphone and remote and never miss a beat."
    ],
    "description": "Hesh 2 Wireless is the Bluetooth version of our iconic headphone with a new sleek profile and plush, synthetic leather ear pads. With on-board controls and a rechargeable battery, Hesh 2 Wireless lets you move freely with your playlist.",
    "price": 5999.0,
    "listPrice": 9999.0,
    "prime": true,
    "dimensions": {
        "weight": 85.0,
        "length": 810.0,
        "width": 370.0,
        "height": 850.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/419Ej-cXv1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61JpA7ArDDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51G5DlRJwqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41z8tzENvcL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dfwzcrj9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41tf0M6eAlL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [],
    "similar": [
        "B07DRFD9T2",
        "B07DZQ14VJ",
        "B076X1VYF2",
        "B07C7VTD4Z",
        "B019U00D7K",
        "B00WGMRD2S",
        "B01J4SK6M0",
        "B01NAJGGA2",
        "B075749KHR",
        "B01L160DLW",
        "B07BXGNP2L",
        "B01DY0NRCA",
        "B07GDBR6TZ",
        "B077YG22Y9",
        "B0798NR83K",
        "B076RDTFTF",
        "B013J7JM4K",
        "B00J0BXPD4",
        "B0143R8DT0",
        "B01JC4T4VK",
        "B0195OPLKK",
        "B01EYCNUKG",
        "B0774K2WRM",
        "B07C77M3HL",
        "B07G7Z7GHD",
        "B01DWH77GC",
        "B011899B60",
        "B06XX123SH",
        "B06Y4XNK8L",
        "B07G85YWMX",
        "B00OES2XM2"
    ],
    "rating": "4.2"
}