{
    "asin": "B00NLVSMBY",
    "title": "Men's Rogaine Hair Regrowth Treatment, Extra Strength - 3 Month Supply",
    "brand": "Rogaine",
    "feature": null,
    "description": "Men's Rogaine Extra Strength Topical Solution is ideal for men who experience hair loss and thinning on the top of scalp due to hereditary reasons. It helps in growing hair besides reducing further hair loss. This package contains bottles of Extra Strength meant for three months usage and one dropper applicator. It also contains an information booklet with easy-to-use directions for great results.Men's Rogaine Extra Strength Topical Solution is unscented and a brand approved by dermatologists. It helps in the growth of hair in men with thinning hair as stipulated on the package and information booklet.Thinning hair Men's Rogaine Extra Strength Topical Solution comes with five percent Minoxidil to rejuvenate shrunken hair follicles by increasing their size. Larger follicles produce a thicker growth of hair.Apply 1 ml with dropper on the hair loss area of the scalp. Massage the area and allow it to dry before styling hair. The process should be repeated two times a day.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 70.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/519qqCtHwNL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dr6AToI%2BL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10898755011",
            "title": "Hair Loss Products"
        },
        {
            "node": "11057581",
            "title": "Hair Regrowth Treatments"
        }
    ],
    "similar": [
        "B01B29PCUU",
        "B00KU8FYN0",
        "B079VW9VBM",
        "B004US07YC",
        "B0000Y8H3S",
        "B01ENCBOA0",
        "B079RDR8ZD",
        "B01NBH0C91",
        "B074M6JNML",
        "B00BMLOKHU",
        "B01F9BQF9E",
        "B00JELF11O",
        "B00FH692PQ",
        "B0012BNVE8",
        "B0009RF9PA",
        "B004H7GB9G",
        "B07BJ8YMGM",
        "B01904PI6W",
        "B01DQ09EYS",
        "B00UYY2GXG",
        "B01H5GS8T6",
        "B00CFBCX1Q"
    ],
    "rating": "3.5"
}