{
    "asin": "B00QKGAOSQ",
    "title": "Pure Garcinia Cambogia Extract - 95% HCA Capsules - Best Weight Loss Supplement - Non GMO - Gluten and Gelatin Free - Natural Appetite Suppressant - 100% Money Back Guarantee - Order Risk Free!",
    "brand": "Potent Organics",
    "feature": [
        "THIS ULTRA POWERFUL GARCINIA CAMBOGIA EXTRACT with 95% Hydroxycitric Acid is the best natural weight loss pills supplement , appetite suppressant & fat burner. Diet without risking your health the way Mother Nature intended!",
        "IT'S A 100% SAFE SUPPLEMENT when combined with a healthy, nutritional eating program! You'll slim down, detox your digestive system and increase your natural immunity!",
        "THIS GLUTEN FREE, VEGETARIAN, VEGAN FORMULA will effectively support men and women weight loss with HCA and potassium for rapid fat burning! Finally, enjoy permanent diet success!",
        "THIS ULTRA POWERFUL GARCINIA CAMBOGIA EXTRACT with 95% Hydroxycitric Acid is the best natural weight loss pills supplement , appetite suppressant & fat burner. Diet without risking your health the way Mother Nature intended!",
        "IT'S A 100% SAFE SUPPLEMENT when combined with a healthy, nutritional eating program! You'll slim down, detox your digestive system and increase your natural immunity!",
        "THIS GLUTEN FREE, VEGETARIAN, VEGAN FORMULA will effectively support men and women weight loss with HCA and potassium for rapid fat burning! Finally, enjoy permanent diet success!",
        "WORKS AS AN APPETITE SUPPRESSANT and carb blocker to increase metabolism and stop overeating and curb appetite to help reduce calorie intake and lose belly fat fast! Take care of your colon with regular bowel movements to detoxify and cleanse.",
        "100%, 90 DAY MONEY BACK GUARANTEE: Our Garcinia is one of the best products in the weight loss market. If for any reason you’re not satisfied, contact us within 90 days from the delivery date and we will place you a 100% full refund plus shipping cost, No Questions Asked!"
    ],
    "description": null,
    "price": 1797.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 450.0,
        "width": 450.0,
        "height": 380.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B079X275TH",
        "B06XS2RC2L",
        "B07CLCJ98B",
        "B06XR1Z3FJ",
        "B07D5CWJ6T",
        "B00FV58KB0",
        "B00J5BR0NU",
        "B075CS379B",
        "B074JYTHQJ",
        "B07D153HS3",
        "B00B5H5BGA",
        "B06VY4GVWW",
        "B0728KTHM4"
    ],
    "rating": null
}