{
    "asin": "B00R11WPK4",
    "title": "Anker 3.5mm Nylon Braided Auxiliary Audio Cable (4ft/1.2m) Tangle-Free AUX Cable for Headphones, iPods, iPhones, iPads, Home/Car Stereos and More (Red)",
    "brand": "Anker",
    "feature": [
        "Universal Compatibility: Play audio from any phone, tablet, iPod, laptop or other media-playing device on your headphones, Hi-Fi or car stereo (fits standard 3.5mm aux ports).",
        "Premium Sound Quality: Built with the same grade materials as premium headphone brands. 24K gold-plated contacts ensure the cleanest sound experience possible.",
        "Incredibly Durable: With a 10000+ bend lifespan several times longer than original audio cables, premium metal housing and four feet of durable, tangle-free cord, this cable really is made to last.",
        "Superb Fit: Ultra slim extensions to the aux jacks enable use with pretty much any phone or tablet case (unlike standard aux cables). Please note: This cable does not fit some Beats headphones.",
        "What You Get: Anker Nylon Braided Auxiliary Audio Cable, our fan-favorite 18-month warranty and friendly customer service."
    ],
    "description": "Plug in and play your sound.Phones, tablets, iPods, CD & cassette players (remember those). Link just about anything to your home or car stereo via its 3.5mm aux port.Our cables are built to the exact same standards as leading headphone brands. 24 carat gold-plated contacts ensure the purest possible sound experience.We bent this cable over 10000 times and saw no damage or change in performance. Premium nylon fabric feels great and doesn't tangle.Each aux jack has been slightly extended to enable use with pretty much any phone or tablet case (unlike most other aux cables).At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.•iPhone, iPod, iPad, other smartphones, tablets, laptops, MP3 players, Walkman, Discman and all other audio-playing devices with a 3.5mm aux port from brands including Sony, SanDisk, Samsung, HTC, Motorola, Nexus, Nokia, LG, Blackberry and many more.•Headphones, Hi-Fi stereo sound systems, car stereos, radios, portable bluetooth speakers and wireless audio receivers with a 3.5mm aux port. The audio jack's upper end measures 5.7mm across and 2.3mm long , please confirm compatibility with your device before purchase. Sony MDR-1000X Beats Solo Echo Dot iPhone 7 / 7 Plus / 8 / 8 Plus / X",
    "price": 699.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 4800.0,
        "width": 20.0,
        "height": 20.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31gmENjbOvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DAsvM7iLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41E6fbtt2AL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/415DkhmvNwL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172532",
            "title": "Audio & Video Accessories"
        },
        {
            "node": "172540",
            "title": "Cables & Interconnects"
        },
        {
            "node": "597566",
            "title": "Audio Cables"
        },
        {
            "node": "3224439011",
            "title": "Stereo Jack Cables"
        }
    ],
    "similar": [
        "B00R10DWWK",
        "B00VH84L5E",
        "B07B6KZB9X",
        "B00NO73MUQ",
        "B00HY4PICU",
        "B00AJHB8R8",
        "B01KSTT08A",
        "B01K3WXBQ4",
        "B0180T7XPC",
        "B076BFZDG2",
        "B01KSTSV76",
        "B00SUIKMJ8",
        "B07DL2NHY7",
        "B01ESINRAY",
        "B01K3WX1U0",
        "B01C73FAG6",
        "B07FQTFZVC",
        "B01ESIMPZC",
        "B00R124LAK",
        "B01I0SI1SG",
        "B01K3WXV8C",
        "B00NO73IN2",
        "B00KAU0G0O"
    ],
    "rating": "4.6"
}