{
    "asin": "B00SI09VLS",
    "title": "Amazing Nutrition Amazing Formulas Extra Virgin Coconut Oil Dietary Supplement - 1000mg - 180 Softgels - Weight Management & Immune System Support - Promotes Heart Health",
    "brand": "Amazing Nutrition",
    "feature": null,
    "description": "* AN EASY WAY TO BENEFIT FROM VIRGIN COCONUT OIL Our coconut oil capsules contain 100% pure coconut oil and allow you to add this healthy source of fat to your diet without having to swallow raw oil* SUPPORT FOR WEIGHT LOSS Coconut oil has been shown to aid in metabolism function to help the body burn fat. Plus, coconut oil can reduce your appetite, so you're less likely to snack and overeat* NUTRIENT RICH Our coconut oil pills feature virgin coconut oil that was produced through cold pressing rather than heat. This helps to preserve the vital nutrients and compounds in the oil to make it as healthy as possible. It's free of artificial preservatives, flavors and sweeteners and contains no sugar, starch, gluten, milk, soy, lactose, wheat, yeast, fish or sodium* QUALITY All Amazing Nutrition products are manufactured in accordance with Good Manufacturing Practices (GMP), among the highest standards in the world.* PURITY & POTENCY All our products are proudly made in USA with Guaranteed Purity & Potency. We offer best quality products for the best value. All our products are Third Party Tested. We do not compromise on quality, our products are free of Artificial Colors, Preservatives, or FlavorsCoconuts grow in many tropical areas of the world and have long been a staple of many types of cuisine. The flesh of the coconut can be used to make oil that is commonly utilized for cooking.Coconut oil has many beneficial properties that have earned it super food status. Specifically, pure coconut oil has been shown to:- ASSIST WITH WEIGHT LOSS. Coconut oil weight loss benefits include providing metabolism support to aid in fat burning and reducing appetite to help people eat smaller portions at meals and snack less frequently.- SUPPORT THE IMMUNE SYSTEM. A natural substance in coconut oil called lauric acid has been shown to fight certain types of germs and can aid the immune system in defending...",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 66.875,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51e6VOZU%2BiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51PfX1XvxkL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51rXEAOaPWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YKjanCYiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51bSBLGeHqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51P-KAbleiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mIfIaIcZL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "6939426011",
            "title": "Supplements"
        },
        {
            "node": "6943343011",
            "title": "Essential Fatty Acids"
        },
        {
            "node": "3773501",
            "title": "Combinations"
        }
    ],
    "similar": [
        "B004R63N8O",
        "B003B6VI60",
        "B078SJH4V3",
        "B06XPRCY4R",
        "B00U2CUNQC",
        "B07FP4KS3R",
        "B0792JFQN8",
        "B00KJANORC",
        "B07FFFBWFL",
        "B01BKVD536",
        "B076PT9MT8",
        "B00PMR3QF2",
        "B00O1XCPL4",
        "B07D18QWFJ",
        "B01IUPWHFM",
        "info.html",
        "B0001TNCK0",
        "B00Z84KVZW",
        "B0786Q3BZ6",
        "B072HXD211",
        "B07B2LFN95",
        "B077XW2LKS",
        "B01G4M1G1O",
        "B0765CSXNM",
        "B00I2C7EEI",
        "B005NIX5VU",
        "B077VTB4FN",
        "B073VNQLFX",
        "B0019GW3G8"
    ],
    "rating": "4.3"
}