{
    "asin": "B00SSTMMVK",
    "title": "4ucycling Windproof Athletic Pants for Outdoor and Multi Sports",
    "brand": "4ucycling",
    "feature": [
        "fleece",
        "Imported",
        "Double-layer synthetic material (75% polyester) in the front, which gives the pants a unique water repellent quality without being too clingy or tight. This offers the athlete more flexibility in mobility.",
        "Breathable material on the back, which is composed of 85% polyester 15% spandex. Engineered to offer the athlete extra comfort levels through exceptional padding and cushioning. The improved aeration is quintessential in preventing excessive sweating during rigorous training sessions.",
        "Thermo-lined fleece interior. Useful for prevention of loss of heat from the body, even under extreme wintry or snowy conditions. The thermal retention capabilities of these pants are also enhanced by the draping design in the knee area.",
        "Zippered pockets with sturdily built zips on each side coupled with easy to adjust leg openings. This gives the athletes the much-needed flexibility around the knee area.",
        "Reflective logo on the left . Improves the visibility of the athlete under low or poor lighting conditions. Integrated as a safety standard for professional and fitness cyclists."
    ],
    "description": "This professional athlete pants designed for most outdoor activities. The spandex and polyester knitting makes these pants one the most sturdy professional athletes pants. This well-built, industrial durable material, makes it an excellent choice for cycling, camping,hiking and other outdoor activities. The pants has an integrated lined fleece interior, useful for warmth retention. Trainers in cold find this particular feature very convenient. The micro-fleece lining in addition to promoting thermal insulation,It's also tailored to allow outdoor activities comfortably in weather or areas with temperatures as low as 14 degrees. The front area has an integrated high-quality polymer which is water repellent, thus, it can also be used even under wet weather conditions.The backside area is functional enough to keep a significant amount of moisture away.Two pockets fully zippered with sturdily built zips to avoid falling off when You carry phone or wallet to your training session. The knee cap area has a relaxed pattern for ease of mobility and adjustable to suit your personal style or comfort. These pants have zippered ankles designed for putting over the boots and thus reduce the flap and loose fitting. long distance cyclists or avid hikers, the reflective logo assures safety in the dark. It's also an essential safety requirement for riders at night, early mornings or at dusk. These pants are not just intended for outdoor. They can also be worn as comfy luxury pants inside the house during chilly or cold weather when you are not outside.",
    "price": 3611.9999999999995,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 85.0,
        "length": 1310.0,
        "width": 1000.0,
        "height": 180.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/319SMwmAouL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31PUzdwQ-hL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31kinlgOklL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31sdcs07ekL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51w0q5uusRL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513yrLipZJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-Z5lZHHXL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        },
        {
            "name": "Size:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3403201",
            "title": "Cycling"
        },
        {
            "node": "2371051011",
            "title": "Clothing"
        },
        {
            "node": "2419332011",
            "title": "Men"
        },
        {
            "node": "2420094011",
            "title": "Pants"
        }
    ],
    "similar": [
        "B07B639B8Q",
        "B01LX4HT55",
        "B07BNNLTM3",
        "B07F36L1LR",
        "B07BDN2HFD",
        "B01GCA4BJC",
        "B01N3PSJES",
        "B075CWX5H9",
        "B07BHD9ZPG",
        "B07FQQ1HFZ",
        "B07C1GMP58",
        "B014UTFU4C",
        "B01MRHP8J5",
        "B00SD1SWJO",
        "B019GUHXWM",
        "B0774R82FH",
        "B012FYD31G",
        "B0711J23Q9",
        "B01HBBEWQ8",
        "B07GDCXB3S",
        "B015H1SPK8",
        "B01LZK0QX0",
        "B075YR3KXH",
        "B014Y8HGBE",
        "B019F2JWP2",
        "B074KW14VD",
        "B01MFBM09K"
    ],
    "rating": "4.6"
}