{
    "asin": "B00UOLG84W",
    "title": "Neutrogena T/Gel Therapeutic Shampoo Original Formula, Anti-Dandruff Treatment for Long-Lasting Relief of Itching and Flaking Scalp as a Result of Psoriasis and Seborrheic Dermatitis, 8.5 fl. oz",
    "brand": "Neutrogena",
    "feature": [
        "8.5-fluid ounce bottle of Neutrogena T/Gel Therapeutic and Anti-Dandruff Shampoo to get long lasting relief from itching and flaking",
        "Original therapeutic formula helps control scalp itching and flaking caused by chronic scalp psoriasis, seborrheic dermatitis and even common dandruff",
        "Contains coal tar extract, which scientific tests have proved continues to work for hours after the shampoo is rinsed off",
        "8.5-fluid ounce bottle of Neutrogena T/Gel Therapeutic and Anti-Dandruff Shampoo to get long lasting relief from itching and flaking",
        "Original therapeutic formula helps control scalp itching and flaking caused by chronic scalp psoriasis, seborrheic dermatitis and even common dandruff",
        "Contains coal tar extract, which scientific tests have proved continues to work for hours after the shampoo is rinsed off",
        "From the #1 dermatologist-recommended brand, this dandruff treatment shampoo helps maintain a healthy scalp and leaves hair clean and manageable.",
        "Designed for daily use. For best results, use at least twice a week or as directed by a doctor. Massage shampoo into your scalp, lather, leaving on your hair and scalp for several minutes, and then rinse."
    ],
    "description": "Get lasting relief from itching and flaking with Neutrogena T/Gel Therapeutic and Anti-Dandruff Shampoo. Safe for daily use, this original formula helps control itching and flaking caused by chronic s ...",
    "price": 798.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 71.875,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B0012DK1HQ",
        "B00UOLI6ME",
        "B00UOL93CG",
        "B00YPBISW2",
        "B01KLJK6XU"
    ],
    "rating": null
}