{
    "asin": "B00UOLAELU",
    "title": "Aveeno Clear Complexion Foaming Oil-Free Facial Cleanser with Salicylic Acid for Breakout Prone Skin, Face Wash with Soy Extracts, Hypoallergenic and Non-Comedogenic, 6 fl. oz",
    "brand": "Aveeno",
    "feature": [
        "6-fluid ounce bottle of Aveeno Clear Complexion Foaming Cleanser to help prevent breakouts and improve complexion while cleansing skin",
        "Facial cleanser is formulated with salicylic acid acne treatment and soy extracts to help clear up breakouts and acne while helping improve skin’s tone and texture",
        "Face wash formula is oil-free, soap-free, hypoallergenic, and non-comedogenic. It won’t overdry skin and is gentle enough for everyday use and sensitive skin.",
        "6-fluid ounce bottle of Aveeno Clear Complexion Foaming Cleanser to help prevent breakouts and improve complexion while cleansing skin",
        "Facial cleanser is formulated with salicylic acid acne treatment and soy extracts to help clear up breakouts and acne while helping improve skin’s tone and texture",
        "Face wash formula is oil-free, soap-free, hypoallergenic, and non-comedogenic. It won’t overdry skin and is gentle enough for everyday use and sensitive skin.",
        "Leaves skin feeling soft, smooth, and even-looking. Foaming cleanser is from Aveeno, which has been dermatologist recommended for over 65 years.",
        "The Aveeno Clear Complexion collection is designed to clear skin without dulling your natural glow. Each exclusive soy-enriched product, with clinically proven acne medication, clears blemishes and helps reveal your skin’s true radiance."
    ],
    "description": "This Aveeno Clear Complexion Foaming Cleanser helps prevent breakouts and improve skin tone and texture. This foam cleanser leaves skin feeling soft, smooth and even-looking. Salicylic acid treats and ...",
    "price": 677.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 53.75,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01FKUSPY2",
        "B01EMYN18M",
        "B01H4DHUL2",
        "B00NQ2OGU4",
        "B01H4DGN06",
        "B00NQ2OKL4",
        "B00NQ2NI2G"
    ],
    "rating": null
}