{
    "asin": "B00VSAGVIQ",
    "title": "Eveline Slim Extreme 4D Bust Enhancing Serum Mezo Push-Up, 7.04 Fluid Ounce",
    "brand": "Eveline Cosmetics",
    "feature": null,
    "description": "With revolutionary technology Mesotherapy ANTI-AGE Complex TM serum after the first application ensures spectacular results and firming breast enlargement without the need for invasive surgery. Counteracts the effects of the passage of time, such as drooping and sagging and allows to keep the beautiful appearance of the bust for a long time. INNOVATIVE ACTIVE INGREDIENTS: VOLUFILINE TM - spectacularly bust sculpted by increasing the amount of lipids and adipocytes. Breast size small increase in volume and a larger breast size gain firmness and round shape. PhytoCellTec is a biologically active Swiss apple stem cells that trigger a process of rapid rebirth of skin cells and rejuvenate it actively. PULLULAN tissue regenerates the skin and prevents sagging, improves microcirculation, firms and tones the skin, lifts, tightens and shapes the bust. Kigelia AFRICANA has an extremely strong filler / magnifying bust. ACACIA Collagen - stimulates skin cells to increased production of collagen. Creates an invisible micro-mesh skin lifting and supporting the breasts. Shapes the bust line and gives an immediate effect of push-ups. bioHyaluron COMPLEX - hyaluronic acid penetrates into the deep layers of the skin, stopping in the water, which improves tension, skin firmness and elasticity of the bust.",
    "price": 1000.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 51.24999999999999,
        "length": 430.0,
        "width": 229.99999999999997,
        "height": 240.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41O6Ui-K-CL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060521",
            "title": "Body"
        },
        {
            "node": "11060661",
            "title": "Moisturizers"
        },
        {
            "node": "11060681",
            "title": "Creams"
        }
    ],
    "similar": [
        "B002BS7XX6",
        "B005FO1S0W",
        "B008A0SH3E",
        "B07DBWK1WC",
        "B01HQ2U7U2",
        "B00Q5CIL4Y",
        "B00QU7Q1JG",
        "B07C846YP9",
        "B00D14C3QQ",
        "B07BMNGSGV",
        "B0087RK12A",
        "B06XF752F7",
        "B06WCZXT3C",
        "B01DSZX6GI",
        "B00943LO8G",
        "B00KJRWVYC",
        "B07F82M1D8",
        "B0079398W2",
        "B07C8HF9MT"
    ],
    "rating": "3.5"
}