{
    "asin": "B00XV7Z5LS",
    "title": "Gland Kids Hair Trimmer, Professional Cordless Hair Clipper for Baby Children Infant Haircut, Waterproof Ultra Slient Electric Rechargeable Haircutting Kit",
    "brand": "GL",
    "feature": null,
    "description": "Description: 1. Detachable and washable ceramic blade, easy to clean, smooth treated blade angle (unique bevel design) protects baby skin from scratch; 2. Precision motor, low vibration and ultra quiet (mute) design, free it from work noise with only about 50 db, to help the child feel at ease, not afraid haircut any more; 3. Powerful high-power motor (the spindle of which is made of fine copper), not to clamp and hurt baby hair. The body adopts ABS eco-friendly material; 4. Imported ceramic blade, unique bevel design, no hurt to baby's skin; 5. With 4 attachment guide combs:3/6mm, 9/12mm, skin-friendly contour-following combs make it safe, easy, comfortable; 6. Quick charge, can be charged during using, Input voltage:AC 110V 50~60Hz, Rechargeable time:3-5 hours; Features: 1. Suit for 0~12 years kids. 2. With specially rounded comb tips and blades, the kids clipper will not scratch your child's skin. The ultra low working noise would not awake the sleeping baby when its hair is cut. 3. Easy to use: easy to maneuver and less tiring for parents. You can use the combs kit the moment you have it without worrying about that you are a green hand and could screw it up. The ingenious design of guide comb ensure a new mother a clean and even haircut at length of 3mm, 6mm, 9mm or 12mm. 4. Waterproof body design of the hair clipper, is to IPX-7 level. Package Includes: 1 x Hair Clipper 1 x Charger 1 x Cleaning brush 1 x Chinese/ English instruction 2 x Fixed Comb 1 x tonsorial cloth 1 x sponge powder puff Mark:USB type or Home charger type will be shipped stochastically. About the feedback:If you have any problem,please feel free to let us know before you post the neutral/negative feedback. We will try our best to solve any problem.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 100.0,
        "length": 590.0,
        "width": 130.0,
        "height": 130.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51TrdpywgLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/416xJfsoNhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ep6WU2vDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/519Jbo04RuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51KVubfUrxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51GCkHvHFqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DLBKx70KL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10676449011",
            "title": "Hair Cutting Tools"
        },
        {
            "node": "7706130011",
            "title": "Hair Clippers & Accessories"
        }
    ],
    "similar": [
        "B01I407MXU",
        "B007ROCZVY",
        "B07BK2VL2M",
        "B01DPZPRW2",
        "B00UYY2GUO",
        "B0756J4R14",
        "B07FMVYHWY",
        "B076H1LKVQ",
        "B003CT36NE",
        "B00XMC5I8M",
        "B07F1YPCNM",
        "B01DQ08K8O",
        "B07D344G6J",
        "B004PXIR1W",
        "B071K226DN",
        "B006YFCHSS",
        "B00F9X34XS",
        "B071S7852V",
        "B00TKS5Y3Q",
        "B06Y5CJG3Z",
        "B0748FB7VP",
        "B06XK316ZG",
        "B01MV4OLNM"
    ],
    "rating": "4.2"
}