{
    "asin": "B00XTAM6PA",
    "title": "3 pack King BKOU172 Multi Utility Lighter Assorted Colors",
    "brand": "KING",
    "feature": [
        "Nullify",
        "Imported",
        "N/A",
        "Imported",
        "King utility lighter is great for starting grills, campfires, fireplaces, pilot lights, or hard-to-reach places.",
        "Visible fuel supply. Adjustable flame height.",
        "3 Lighters Included"
    ],
    "description": "In 1952, friends combined their passions for model airplanes to develop a thriving business dedicated to providing high quality products to enthusiasts around the world. More than 50 years later, Midwest's product line and distribution have grown and changed, but its passion for quality has remained steadfast. Today, Midwest Products is a leading supplier worldwide of quality raw materials, accessories and kits to distributors and retailers. People use our products for leisure, educational and professional pursuits, from model airplanes and boats to architectural and educational projects. We are proud that our products enrich the lives of literally hundreds of thousands of people around the world everyday. A domestic wood cut in Northern Michigan and Wisconsin, desired because of its economy, workability and finishing qualities. Its close, tight homogeneous grain structure makes it ideal for a wide variety of hobby, craft and miniature projects. Thin Basswood may be cut with a hobby knife; thicker Basswood requires a saw for cutting. Basswood may be stained or painted to represent any wood type. This 24 inch strip measures 0.0625 x 0.0625 Inch.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 300.0,
        "width": 100.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31Uwor0YW4L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "15342811",
            "title": "Household Supplies"
        },
        {
            "node": "10342347011",
            "title": "Lighters & Matches"
        },
        {
            "node": "10342354011",
            "title": "Lighters"
        }
    ],
    "similar": [
        "B078T3FW2B",
        "B07F1NV2M4",
        "B07F8ZVRDT",
        "B07DZXZCXP",
        "B003IJHYJU",
        "B005TL0DNE",
        "B00X2EPA24",
        "B00DUGTQD8",
        "B0742K1VMV",
        "B006SM2G1U",
        "B01N1O8ZBN",
        "B07CG6R7DJ",
        "B00K4KHD38",
        "B0718WJNHC",
        "B07DN2BNMV",
        "B0086630A2",
        "B07G3TWFFC",
        "B07CG7Y7LJ",
        "B005JUQL36",
        "B000Q0QK7Q",
        "B078Q54MF8",
        "B0771TSBJ3",
        "B06Y6GW3QR",
        "B0713XF69S"
    ],
    "rating": "3.6"
}