{
    "asin": "B00XPHZC3A",
    "title": "EocuSun Children Kids Play Tent Tents House Pop Up Outdoor Indoor Ball Pit Baby Beach Tent Playhouse w/ Zipper Storage Case for Boys Girls",
    "brand": "EocuSun",
    "feature": [
        "Colorful polka dot hexagon theme castle princess kids play tent, improving the baby's aesthetic capacity.",
        "Perfect breathable mesh design for childs visibility, keep the air fresh and you can look after your kid.",
        "Great fun for children or pets, give your kids an independent space without too much help, improve the independent ability.",
        "Light weight, fold-pop-up for easy and quick assemble, non toxic paint, safe for kids.",
        "Easy to clean, wipes clean for a long life of fun and entertainment. Perfect for indoor or outdoor play. (note: play balls are not included,they are sold separately)."
    ],
    "description": "Perfect for every little kid, boys and girls all can spend hours of fun playing in this Play tent. The cute pop up house provides a secret getaway from adults. This fun polka-dotted tent has a roll-up polka dot flap over the entrance and screened sides to provide privacy and the ability to discover. Great for at-home entertainment, a day at the beach, and more, this pop up play tent is every little kid's dream escape. Bright colored polka dot design adds excitement, Features airy mesh sides adds visibility. Features a special twist storing option for folding to a very compact size for travel, tight area storage, etc. Easy to use, the tent folds and unfolds with little effort. Perfect for ages 1+. Perfectly sized makes it suitable for small indoor spaces like playrooms, bedrooms and more. Stimulate the imagination Improve the language competence Increase the ingenuity of children The cultivation of the independent personality Color perception, train children to colorific acuity Develop coordinating abilities and logical thinking ability 1 x Play tent 1 x Zippered storage bag Play balls are NOT included and are sold separately. Open the packaging and carefully to expand it. Note that the product will quickly bounce open. How many pit balls you need: we recommend 200-300 balls.",
    "price": 1798.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 110.00000000000001,
        "length": 1400.0,
        "width": 1320.0,
        "height": 170.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51E-Ns6XJfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51LdfzBuPPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51UCftXGhyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Xh43t-wCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61s%2B%2B8D3eCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61im7bKwxZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51u413RVJtL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "165793011",
            "title": "Toys & Games"
        },
        {
            "node": "166420011",
            "title": "Sports & Outdoor Play"
        },
        {
            "node": "166434011",
            "title": "Play Tents & Tunnels"
        }
    ],
    "similar": [
        "B06VWYQN2V",
        "B07599Q9XY",
        "B075LX4WVN",
        "B01IWEX7ZK",
        "B07BRNYBLT",
        "B0719J5RP2",
        "B01N1JSZH7",
        "B00TI10CT6",
        "B01MCTE79S",
        "B01FFOZ3FC",
        "B07DWYG2CS",
        "B076KT1F8V",
        "B00PYLU3GG",
        "B07C57J7VQ",
        "B01C5A2WJO",
        "B075RFGR9G",
        "B00G3BN3HW",
        "B009CAPYR8",
        "B07C7G41BM",
        "B00009IMAT",
        "B01N6BTZ6Q",
        "B075RFSPWQ",
        "B01M9GM4MQ",
        "B00SOU87PS",
        "B00PYLJGQ4",
        "B00THZWA6Q",
        "B07C5989D4",
        "B076GTLVHF",
        "B0041EGT0Q"
    ],
    "rating": "4.4"
}