{
    "asin": "B00YRHHDAW",
    "title": "Mehr Elegant Leather Valet Key Chain - Detachable Keychain & 3 Key Rings (Turquoise Blue)",
    "brand": "Mehr Enterprises",
    "feature": [
        "✓ Material - Crafted from durable 100% genuine full grain leather, rust proof zinc alloy, and stitched together with care; Mehr keychains are built to last",
        "✓ Compact and Portable - At 4.2 x 0.7 x 0.3 inches, and only 1.3 ounces in weight, this key chain is designed to be easily located from distance, or even inside your purse",
        "✓ Functionality - Keys can easily be removed by sliding the side button, offering you the convenience to separate your car, home, and office keys quickly. Every keychain will include 3 key rings (another 2 can be added if need be)",
        "✓ Quality Control - Every key chain is thoroughly inspected before leaving our facility in California",
        "✓ Warranty - 1 year from the date of purchase in United States"
    ],
    "description": "This is one of the most useful key chains available on the market today. It allows you to have your car, house, or office keys separated by simply sliding down a button. This can be useful for many reasons, especially if you have multiple cars, valet your car frequently, share your keys with roommates or family members, or even if you're tired of breaking your nails when trying to remove or switch your keys from most regular key chains. We inspect every one of our products at our location in California to make sure that they meet the highest quality standards possible. Every part of the key ring, including the screws, the leather, the spring, and the button is designed to last. We go that extra mile to make sure that our products meet today’s competitive quality standards in every possible way. We assure you that, if there are any issues with your order , we will be fully responsible to take care of it. All it takes for you is to contact us within a reasonable time from the date of your purchase (up to 30 days). Nearly all inquiries are replied to within 3 hours. As an Amazon Prime member, in case there be any problems with the key holder, you are more than welcome to return the item within 30 days for a full refund. Ultimately, If you’re looking for a stocking stuffer for your loved ones, this could be a great Christmas present or a clever gift idea for different occasions; whether it’d be a simple birthday present or an appreciation gift. Nearly all our items will arrive in a red pouch, making them a perfect gift for your friends, loved ones, or family members; or even for Valentine's Day.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 70.0,
        "width": 30.0,
        "height": 420.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/4139-PjBpLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zZvY1Vo8L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qrHFU2LlL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41JjyFZ-lPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41sv2QFCYHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51toh7V9mnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DT07tFbCL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Turquoise Blue"
        }
    ],
    "categories": [
        {
            "node": "1064954",
            "title": "Office Products"
        },
        {
            "node": "1069242",
            "title": "Office & School Supplies"
        },
        {
            "node": "1069376",
            "title": "Forms, Recordkeeping & Money Handling"
        },
        {
            "node": "12900971",
            "title": "Key Tags & Chains"
        }
    ],
    "similar": [
        "B01GOUWHEG",
        "B07FTFRY21",
        "B07CL7P3JP",
        "B07F1W8157",
        "B078TLY2JJ",
        "B0125PPW6O",
        "B07F6DT77G",
        "B01MQ1DZNZ",
        "B074K251GZ",
        "B079FT8LYV",
        "B00OW0UAJA",
        "B06XXFZHJQ",
        "B07BFJDNQX",
        "B07GNCFF7Z",
        "B077P129FH",
        "B00SUPGDFI",
        "B077LXVGKY",
        "B00SUPGDM6",
        "B00VE1C3OK",
        "B01M6W9D6D",
        "B00TQ62O7Q",
        "B01MCYV8L9",
        "B01JZ5HSGE",
        "B079SJ1R7T",
        "B073311ZS8",
        "B07F8TCNGW",
        "B071GNL4G5",
        "B01G8L4T74",
        "B01M71Y8WJ",
        "B06Y3Y666G",
        "B00SGFZCTA"
    ],
    "rating": "4.7"
}