{
    "asin": "B00YKR92IK",
    "title": null,
    "brand": "Prophet and Tools",
    "feature": [
        "OUR BEARD OIL WILL MAKE YOUR BEARD LOOK PERFECT - It will restore, protect and bring your hairs back to life. We are seeing guys daily with beards that are dry, thin and FALLING OUT! - you can’t be that guy! Our beard oil promises to moisturise, treats split ends, reduce painful irritations, eliminate nasty flakes, de-tangles hairs, promote healthy faster beard growth, add glorious shine and SO MUCH MORE! You can even use it on dry scalp, face or hair!",
        "SEE THE DIFFERENCE WITH JUST YOUR FIRST APPLICATION - 90% of our customers say their beard looks and feels amazing on just their first application! See great results in just a week! You don’t have to blame your genetics anymore! It’s all about how you take care of your beard and giving it what it needs! With the public attention and compliments from family and friends you’re going to get, we guarantee that you will never want to purchase beard oil from any other brand!",
        "IT’S THE ULTIMATE BUNDLE FOR REAL MEN - In your box, you’re getting a PREMIUM QUALITY 30ML/1OZ unscented Beard oil + handmade animal engraved Beard Comb + Beard Care eBook guide to help you get the best out of your beard! This kit is awesome for men just starting to grow a beard!",
        "OUR BEARD OIL WILL MAKE YOUR BEARD LOOK PERFECT - It will restore, protect and bring your hairs back to life. We are seeing guys daily with beards that are dry, thin and FALLING OUT! - you can’t be that guy! Our beard oil promises to moisturise, treats split ends, reduce painful irritations, eliminate nasty flakes, de-tangles hairs, promote healthy faster beard growth, add glorious shine and SO MUCH MORE! You can even use it on dry scalp, face or hair!",
        "SEE THE DIFFERENCE WITH JUST YOUR FIRST APPLICATION - 90% of our customers say their beard looks and feels amazing on just their first application! See great results in just a week! You don’t have to blame your genetics anymore! It’s all about how you take care of your beard and giving it what it needs! With the public attention and compliments from family and friends you’re going to get, we guarantee that you will never want to purchase beard oil from any other brand!",
        "IT’S THE ULTIMATE BUNDLE FOR REAL MEN - In your box, you’re getting a PREMIUM QUALITY 30ML/1OZ unscented Beard oil + handmade animal engraved Beard Comb + Beard Care eBook guide to help you get the best out of your beard! This kit is awesome for men just starting to grow a beard!",
        "THICKER, FULLER, HEALTHIER FACIAL HAIR FOR ALL ETHNICS & AGE - White, Black or Asian! 1-3 drops is all you need! Simply just apply to your beard and comb in place! Any excess oils on your hand can be used on your hair or face as a moisturizer! It’s non greasy and quick absorbent! Store away out of direct sunlight. The beard oil will last for 24 months before expiring. Can be used after showering, trimming, morning routine - whenever and however you want!",
        "EPIC BEARD OR YOUR MONEY BACK! – Here, at Prophet and Tools, your satisfaction means the world to us and that is why we offer you a FULL money-back guarantee in the unlikely scenario that there’s anything wrong with your purchase! Guaranteed to give you the best beard experience or your money back. Order now and see for yourself! Add 2 to the basket and receive 10% OFF! Use Promotion Code below."
    ],
    "description": null,
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 120.0,
        "width": 120.0,
        "height": 390.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01AYMHBLY",
        "B071HJP1VH",
        "B01CEKCXXK",
        "B076NZ6W1B",
        "B009NNFB0O",
        "B01692GG8M"
    ],
    "rating": null
}