{
    "asin": "B00Z9QVE4Q",
    "title": "Anker PowerCore 13000, Compact 13000mAh 2-Port Ultra-Portable Phone Charger Power Bank with PowerIQ and VoltageBoost Technology for iPhone, iPad, Samsung Galaxy (Black)",
    "brand": "Anker",
    "feature": [
        "The Anker Advantage: Join the 30 million+ powered by our leading technology.",
        "Upgraded Capacity: The successor to PowerCore 10400—identical compact size but packed with even more power. Charges an iPhone 8 almost 5 times, an iPhone X or Samsung Galaxy S8 3 times, or an iPad Air 2 once.",
        "Light and Compact: A super-high 13000 mAh capacity with two high speed USB ports is all contained in a portable charger smaller than a wallet.",
        "High-Speed Charging: PowerIQ and VoltageBoost combine to deliver a max speed charge to any device (up to 3A - Qualcomm Quick Charge not supported). Input: 5V / 2A.",
        "What You Get: Anker PowerCore 13000 Portable Charger, Micro USB cable, travel pouch, welcome guide, our worry-free 18-month warranty and friendly customer service."
    ],
    "description": "The Compact Super-High-Capacity Portable Charger Faster and safer charging with our advanced technology 10 million+ happy users and counting Enough power to keep you going for days. Charge an iPhone 8 almost 5 times, an iPhone X or Samsung Galaxy S8 3 times or an iPad Air 2 once. PowerIQ ensures intelligent high-speed charging for all your devices and VoltageBoost prevents cable resistance from slowing your charging speeds. Surge protection, short circuit prevention and premium LG battery cells keep you and your devices safe. Enhances grip and prevents smudges and fingerprints. At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support. Use the included cable, your original cable or a third-party certified one (such as MFi). It is advised not to use in confined, poorly ventilated spaces (e.g. pockets). Compatible with the new 12 inch MacBook, 2015 (USB-C cable needed), Apple and Android smartphones, tablets (including the Nexus 7) and other USB-charged devices EXCEPT for the iPod nano, iPod Classic, HP TouchPad, Dell Venue 11 Pro, some Asus tablets, GPS and Bluetooth devices. Please use the original Apple charging cable (not included) to charge Apple products. AC adapter not included. 1 Anker PowerCore 13000 portable charger 1 Micro USB cable 1 travel pouch 1 welcome guide",
    "price": 3599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 71.25,
        "length": 80.0,
        "width": 80.0,
        "height": 80.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31iKwrc2dDL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CTyk1tfKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Aui8htHRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51OVJsJgtIL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YvUkomwUL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41A%2BMb1NrSL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41A9CzVVeBL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407758011",
            "title": "Batteries & Battery Packs"
        },
        {
            "node": "7073960011",
            "title": "Portable Power Banks"
        }
    ],
    "similar": [
        "B078R5FYMP",
        "B07428YK3D",
        "B00GBTSHZE",
        "B00X5RV14Y",
        "B075ZR745R",
        "B06XGC72TL",
        "B078JSJHPK",
        "B07GDY2Z4D",
        "B01KC74M7C",
        "B074FPFPMH",
        "B00DTXA578",
        "B01NBQX0O5",
        "B0716N7HTG",
        "B06XGL74FL",
        "B01N64FT67",
        "B07GK8HGLB",
        "B079RDD916",
        "B00MQSMEEE",
        "B079RC1MNV",
        "B071DGRXRX",
        "B01N47PCGQ",
        "B074W6384W",
        "B07DT4RN77",
        "B01G1XH46M",
        "B00ISGFY54",
        "B072MH1434",
        "B06XGBS743",
        "B01LQ81QR0",
        "B01NCL75QK",
        "B00AANQLRI",
        "B077N9KYV8",
        "B00MH4QKP6",
        "B00Z9R26HE",
        "B07BWBMZDL",
        "B07C2Z5R9X",
        "B01N0I1W2T",
        "B0194WDVHI",
        "B018L2WM86"
    ],
    "rating": "4.6"
}