{
    "asin": "B00ZZYBAI2",
    "title": "Portable Chargers RAVPower Luster Mini 3350mAh External Battery Pack Battery Bank External Phone Charger Power Pack Most Compact Power Bank with iSmart Technology for Smartphones and More (Black)",
    "brand": "RAVPower",
    "feature": [
        "Small But Powerful Enough: Sleek mini size fits easily into any pocket or bag, but powerful enough to get a full charge of your iPhone 7 or other smartphones (14 hours of additional talk time or 90 hrs of music playback from your cell phone).",
        "Thoughtful And Ergonomic Design: White plastic cap at the top and unique clip-inspired design would prevent the charger from scratching and rolling off your desk; same anodic oxidation technology as Apple matched with a gorgeous metal shell will transform you into a style icon; Easy to press the power button, 3 status LEDs keep you informed of remaining capacity.",
        "Exclusive iSmart Technology: 1A output and 1A input, charge faster and smarter than others, automatically detects and delivers the optimal charging current for any connected device- ensuring the fastest and most efficient charge.",
        "Safety Protection: Short-circuit and over-current protection will make the charger automatically shut it down if a short circuit or overload output occurred while the unit is charging; Ultra reliable A (plus) Lithium-Ion battery with over 500 battery charge cycles.",
        "What You Get: RAVPower 3rd Gen Luster Mini 3350mAh Portable Charger, Micro USB cable, welcome guide, our fan-favorite 18-month quality guarantee and friendly customer service."
    ],
    "description": "For those looking to make a fashion statement, the RAVPower Luster Mini 3350mAh Portable charger External Battery Charger comes in 4 bold colors: Gold, Black, Blue and Pink. Whether you are after a classy look or something trendy and fun, the Luster comes in a color for you. With a minimalistic design weighing in at only 2.6 oz and providing up to 1 extra charge for most smartphones, the Luster Battery Pack is essential for keeping your devices powered throughout the day. Cased in a fresh anodized finish with aluminum alloy from the same manufacturing standard as Apple's products; plastic on both ends and a unique clip-inspired design prevents the charging from scratching or from rolling off your desk; 3 LED's keep you informed of battery status. iSmart 2.0 technology automatically detects and delivers the optimal charging current for any connected device - ensuring the fastest, most efficient charge. iSmart technology ensure the RAVPower Luster Mini Charger is compatible with most smartphone models: iPhone, Galaxy, Note, Nexus, Droid, LG, HTC, Lumia, and other devices. Capacity: 3350mAh Input: DC 5V / 1A Output: DC 5V / 1A Size: 4.02 x 0.91 x 0.91 in Weight: 2.6 oz 1.Please use the original 8Pin/30Pin Cable (Not Included) by Apple to charge Apple products. 2. Due to nature of portable battery chargers, it is suggested you'd better not use this unit to charge a tablet in case the unit gets overheated. - 1 x RAVPower 3350mAh Power Bank (Model: RP-PB33) - 1 x USB to Micro USB cable - 1 x User Guide",
    "price": 1199.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 400.0,
        "width": 90.0,
        "height": 90.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41nGZ9JsYnL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41NXPRn85dL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41h-4uWHCxL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41aZCMnnftL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412TUYY5K3L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vxODjdvsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/617OoudlkuL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407758011",
            "title": "Batteries & Battery Packs"
        },
        {
            "node": "7073960011",
            "title": "Portable Power Banks"
        }
    ],
    "similar": [
        "B00AA6CS86",
        "B005X1Y7I2",
        "B071DTJ4GL",
        "B074QLZBRL",
        "B073P83PHF",
        "B00AANQLRI",
        "B00KG45W08",
        "B075RP6929",
        "B00KG45W1C",
        "B01CU1EC6Y",
        "B00AANMVNQ",
        "B075ZR745R",
        "B076DZ9VCS",
        "B00ISGFY54",
        "B076H3G7YL",
        "B00MWU1GGI",
        "B01L0I0514",
        "B00Y2PX4TS",
        "B00OT6YUIY",
        "B06XQ8J81R",
        "B010U3XA0I",
        "B075L21GQS",
        "B012NIQG5E",
        "B00MNAWM74",
        "B07FKZKTYJ",
        "B07BWBMZDL",
        "B01M0Z2H38",
        "B00MQSMEEE",
        "B07DLTN2PP",
        "B00MNAWM92",
        "B073SPLSRB",
        "B01G1XH46M",
        "B00KG45W58",
        "B01MCQLWSS",
        "B00L9F95RO",
        "B00N2JBTEM",
        "B075ZR4N99",
        "B073ZC5J9J"
    ],
    "rating": "4.2"
}