{
    "asin": "B00ZV9RDKK",
    "title": "Fire TV Stick with Alexa Voice Remote | Streaming Media Player",
    "brand": "Amazon",
    "feature": [
        "The next generation of our best-selling Fire TV Stick–now with the Alexa Voice Remote.",
        "Enjoy tens of thousands of channels, apps, and Alexa skills with access to over 500,000 movies and TV episodes from Netflix, Prime Video, Hulu, HBO, SHOWTIME, NBC, and more. Plus, access millions of websites such as YouTube, Facebook, and Reddit with browsers like Silk and Firefox.",
        "Launch and control content with the included Alexa Voice Remote. Simply say, “Play Game of Thrones” or “Launch Netflix” and Alexa will respond instantly. Plus, play music, find movie show times, order a pizza, and more—just ask.",
        "The next generation of our best-selling Fire TV Stick–now with the Alexa Voice Remote.",
        "Enjoy tens of thousands of channels, apps, and Alexa skills with access to over 500,000 movies and TV episodes from Netflix, Prime Video, Hulu, HBO, SHOWTIME, NBC, and more. Plus, access millions of websites such as YouTube, Facebook, and Reddit with browsers like Silk and Firefox.",
        "Launch and control content with the included Alexa Voice Remote. Simply say, “Play Game of Thrones” or “Launch Netflix” and Alexa will respond instantly. Plus, play music, find movie show times, order a pizza, and more—just ask.",
        "No cable or satellite? No problem. Watch the best of live TV and sports from AMC, HGTV, ESPN, FOX, and others with a subscription to DIRECTV NOW, Sling TV, or top-rated primetime shows with CBS All Access.",
        "Find the best way to watch with universal search results from over 200 channels and apps including Netflix, Hulu, and Prime Video.",
        "Amazon Prime membership unlocks thousands of movies and TV episodes, including \"Thursday Night Football\", Amazon Original Series, Prime Video Channels, and ad-free listening to millions of songs with Prime Music.",
        "Pick up where you left off. Bring hit shows and movies with you when you travel. Plug Fire TV Stick into any TV’s HDMI port, connect to Wi-Fi, and continue streaming.",
        "Play current favorites or quickly discover what to watch next directly from the Home screen."
    ],
    "description": "Fire TV Stick connects your HDTV to a world of online entertainment. Stream a massive selection of movies and TV episodes from Netflix, Amazon Video, Hulu, and more, and easily find and control conten ...",
    "price": 3999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 53.75,
        "length": 340.0,
        "width": 120.0,
        "height": 50.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B074TC662N",
        "B01IQEADVC",
        "B01N9O3UTF",
        "B01IQEADEE",
        "B01N32NCPM",
        "B075XN1NZC"
    ],
    "rating": null
}