{
    "asin": "B010UM8UP4",
    "title": "Steel Straw - Utopia Kitchen",
    "brand": "Utopia Kitchen",
    "feature": [
        "Set of 4 Stainless steel straws are manufactured with high-quality stainless steel for optimal longevity; it also includes a free cleaning brush in order to avoid any hassle",
        "They measure about 5 1/2 inches vertical before you get to the bend where you have almost another three inches; they are about 1/2 inch longer than a traditional straw",
        "One particular advantage of using a stainless steel straw when drinking is the reduction of tooth decay as most sodas have acidic components and using a straw reduces the liquid contact with the teeth particularly the anterior teeth reducing tooth decay and the risk of cavities",
        "It's also a rust-proof and stain-resistant material so it will maintain its shine and preserve all of the aesthetic qualities of your straw for a long time",
        "Sleek design adds class and sophistication to your kitchen collection"
    ],
    "description": "The Stainless Steel Straws are the perfect way to add flair and utility to your drink setup. Equal parts practical and cost-efficient, these reusable straws are heavy duty and easy to clean. Reduce plastic waste by eliminated disposable straws! Use with drink glasses or fruits (coconuts, oranges, etc.) for best results. Because stainless steel is non-porous, it resists bacteria and germs more effectively than wood or plastic surfaces. Stainless steel can be wiped clean with a disinfectant cleaner after use, and is an attractive option for homes with young children and pets or for anyone who wants to keep their kitchen as clean and immaculate as possible.Stainless steel is one of the most hygienic surfaces available, so any foods that come into contact with the surface or material do not attract dirt or germs. Stainless steel also does not react with any foods that may be used during meal preparation and cooking.",
    "price": 399.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": 800.0,
        "width": 30.0,
        "height": 10.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41QUaMMn0iL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Vqm3QjOVL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2BNp5ySdrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517yViR0RzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31EPX35YGDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41m%2BJdBPjgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51N1um0HKpL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "284507",
            "title": "Kitchen & Dining"
        },
        {
            "node": "289814",
            "title": "Cookware"
        }
    ],
    "similar": [
        "B07997SL3Z",
        "B00P1M12XG",
        "B07GFKMKY1",
        "B0763K5R5Y",
        "B07D15858D",
        "B07G9LC93M",
        "B01CP0TYTA",
        "B07FB4T3SS",
        "B01FUXN5NA",
        "B07FDQWYJL",
        "B07D248DXC",
        "B07G78J9WX",
        "B01JSLZV7I",
        "B075FQ2W28",
        "B01J9W5C0M",
        "B06ZYTPJBP",
        "B01DPA6OHO",
        "B077S81YXY",
        "B072M1RT2H",
        "B07DXLJZDN",
        "B004BCXAM8",
        "B07G25CLYP",
        "B075ZF2FK8",
        "B07D41SXYS",
        "B07GBRM3DD",
        "B073Q9WV8S",
        "B07G42QW6L",
        "B01DWH4E54",
        "B07FR7LNXY",
        "B07FP4RM18",
        "B07F343LFJ"
    ],
    "rating": "4.4"
}