{
    "asin": "B011P6080O",
    "title": "Ringke [Fusion] Compatible with OnePlus 2 Case Crystal Clear PC Back TPU Bumper with Screen Protector [Drop Protection, Shock Absorption Technology][Attached Dust Cap] for OnePlus Two - Clear",
    "brand": "Ringke",
    "feature": [
        "Fits perfectly on the OnePlus 2 in classic style Sandstone Black (May not be fully compatible for StyleSwap covers including Bamboo, Rosewood, Black Apricot or Kevlar.)",
        "Crystal clear protection enhances the OnePlus 2 original look with minimal bulk.",
        "Slim shock absorption TPU bumper designed with Active Touch Technology for easy access to all key ports and buttons.",
        "Attached dust covers fit neatly on headphone jacks to protect from dust and debris! No more tiny dust particles to attack your phone!",
        "Free Bonus Value Pack: Includes 1 Free HD Screen Protector and DIY template to customize your perfect case."
    ],
    "description": "Crystal clear PC backing with superior coating and rubberized edge protection for a more solid and comfortable grip.Let all the color and vibrancy come alive with your perfect sophisticated frame protecting all 4-sided edges and crystal clear PC portrait back panel!Dual layer protective style improves slim and clean quality for a perfect back that doesn't discolor or blur with scratches.Designed with Shock Absorption Technology and Enhanced Dual Coating to defend with 2x longer lasting durability.Innovative technologies including Anti-Static and Anti-Scratch Elements protect your phone against more dirt and dust than other cases.New Active Touch Technology buttons are also specially designed for a more natural responsive feel when pushing the volume and power button.Ringke top rated FUSION offers a specialized tight grip against dust for all edges and protects the phone.Concise cutouts for audio jack and ports allow for easy access and no compromise to full functionality.Crystal clear frame design to contour the natural dimensions of the OnePlus 2 with lasting protection and Anti-Slip comfort in your hand.Ringke's Design It Yourself provides you with a free template to help as you unleash your creativity and personalize your ownfully customizable Ringke FUSION protective case. It's our way of helping you become one simple step closer to suit all your aesthetic needs.Maximize your value with 1 FREE extra Invisible Defender film sheet included inside as an additional bonus!",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 830.0000000000001,
        "width": 470.0,
        "height": 50.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51ecQ3HgKyL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51GOrkFEBEL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fzU3LRRVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61xCCceUZVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DtuoHoK%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dCFc3DfNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51p-9xySgmL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B012Y59YYQ",
        "B075CTSYHH",
        "B013HN0GEQ",
        "B07D9DKH9R",
        "B014Y0DXQE",
        "B010QYKIBK",
        "B013SZ0AVM",
        "B07GZBW19B",
        "B014T8YAHW",
        "B014RS5BHW",
        "B013PDTKV8",
        "B0731G2HWT",
        "B015FZLA8A",
        "B013V43S28",
        "B013PDTVOE",
        "B07C547543",
        "B06XNQSYK8",
        "B010QYKI2O",
        "B011P6084A",
        "B07GCBH7KJ",
        "B0168YKR1I",
        "B01637DRZI",
        "B073CRB1PS",
        "B07G95VDJZ",
        "B012D3RIOW",
        "B01GYZ7FCU",
        "B078NVF2F3",
        "B01IN11AJ2",
        "B076F64PC2",
        "B0168YKUBK",
        "B017C40SXU",
        "B0149A1KYQ",
        "B00WYBFT90",
        "B01N3UZ5RQ",
        "B0111LAYOS"
    ],
    "rating": "3.6"
}