{
    "asin": "B011RCGSP0",
    "title": "Seiko Men's SSC385 RECRAFT Solar Chrono Analog Display Japanese Quartz Black Watch",
    "brand": "Seiko",
    "feature": [
        "Men's recraft solar chronograph black ion finish",
        "Black dial with gold highlights and silicone strap 100 M 100",
        "Japanese-quartz Movement",
        "Case Diameter: 43.5mm",
        "Water Resistant To 330 Feet"
    ],
    "description": "Black ion-plated stainless steel case with a black silicone strap. Fixed black ion-plated bezel. Black dial with gold-tone skeleton hands and index hour markers. An Arabic numeral appears at the 12 o'clock position. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 second, 60 minute and 1/20th of a second. Solar quartz movement. Scratch resistant Hardlex crystal. Screw down crown. Solid case back. Case diameter: 43.5 mm. Case thickness: 12 mm. Round case shape. Band width: 22 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: chronograph, date, hour, minute, second. Casual watch style. Seiko Recraft Solar Chronograph Black Dial Black Silicone Mens Watch SSC385. Seiko Solar chronograph. Recraft series. This handsome timepiece is designed with a black ion finished stainless steel case and black silicone strap. No battery change required and powered by light energy, using Solar cells with high performance electricity generation. Energy-efficient Solar movement with 6 month power reserve once fully charged. The black dial features gold highlights, three subdials, luminous hands and date calendar. Chronograph measures up to 60 minutes in 1/20 second increments with split time measurement function. Screw down Case back. 100 meters water resistant.",
    "price": 14494.999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 60.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/5183ga0w3nL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31mblo6oeVL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51GWJpi4hZL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31MpUA8mLjL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B06XS9NQPF",
        "B0792MBNGJ",
        "B06Y391SCN",
        "B06XS9VSXR",
        "B000EI858M",
        "B000LTAY1U",
        "B076HC5ZH2",
        "B01HZT4Z54",
        "B0044XDZII",
        "B00NIFXB8C",
        "B000KG93BQ",
        "B077N8MY56",
        "B01M0PRC2F",
        "B077MX23NN",
        "B002SSUQFG",
        "B006CHML4I",
        "B00J4JKOX6",
        "B06Y3KMQZB",
        "B078VCJRLV",
        "B077N6RXRM",
        "B011RCGT2W",
        "B07CPRKBXD",
        "B07195L174",
        "B00HLVH1GW",
        "B07657P1FN",
        "B000FVE3A2"
    ],
    "rating": "3.3"
}