{
    "asin": "B012VWH6PQ",
    "title": "Anker Powerline Micro USB - Charging Cable, with Aramid Fiber and 5000+ Bend Lifespan for Samsung, Nexus, LG, Motorola, Android Smartphones and More (Gray, 3ft)",
    "brand": "Anker",
    "feature": [
        "The Anker Advantage: Join the 10 million+ powered by our leading technology.",
        "Strengthened Construction: One of the first ever charging cable built with bulletproof aramid fiber, PowerLine is much stronger than ordinary cables.",
        "Lasts 10X Longer: Reinforced stress points with a 5000+ bend lifespan make PowerLine many times more durable than anything else on the market.",
        "Faster Charging: Thick gauge wiring and reduced cable resistance enable PowerLine to provide the speed possible charge via any USB charger, plus data transfer.",
        "What You Get: Anker PowerLine Micro USB (3ft including both ends), our fan-favorite 18-month warranty and friendly customer service."
    ],
    "description": "The incredibly fast and durable charging cable. - Faster and safer charging with our advanced technology- 10 million+ happy users and countingA first for USB charging cables, the Anker PowerLine is reinforced with bulletproof aramid fiber. That makes it much stronger than conventional cables.We bent this cable over 5000 times and saw no damage or change in performance. PowerLine Micro USB is one of the most remarkably durable cables in existence. Thanks to wide diameter wires and reduced cord resistance, PowerLine enables the fastest possible charge speed via any USB charger. To maximize case compatibility, we made PowerLine's Micro USB connector as compact as possible, without compromising its durability.At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.Android smartphones and tablets, e-readers, cameras, MP3 players, hard drives, portable chargers, handheld game consoles and all other Micro USB devices from brands including Samsung, HTC, Motorola, Nexus, Nokia, LG, HP, Sony, Blackberry and many more PowerLine Micro USB The world's incredibly fast and durable charging cable. From ANKER, America's Leading USB Charging Brand- Faster and safer charging with our advanced technology- 10 million+ happy users and countingStrengthened ConstructionA first for USB charging cables, the Anker PowerLine is reinforced with bulletproof aramid fiber. That makes it much stronger than conventional cables.Incredibly DurableWe bent this cable over 5000 times and saw no damage or change in performance. PowerLine Micro USB is a remarkably cable you've ever seen. Faster ChargingThanks to wide diameter wires and reduced cord resistance, PowerLine enables the fastest possible charge speed via any USB charger. Superb FitTo maximize case compatibility, we made PowerLine's Micro USB connector as compact as possible, without compromising its durability.Outstanding WarrantyAt Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.Compatible With:Android smartphones and tablets, e-readers, cameras, MP3 players, hard drives, portable chargers, handheld game consoles and all other Micro USB devices from brands including Samsung, HTC, Motorola, Nexus, Nokia, LG, HP, Sony, Blackberry and many more.",
    "price": 549.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 3540.0,
        "width": 60.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41jGk0rMCNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41p7sQ3v%2BTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41beXAYJN-L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41vQvMaMM4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41LDOufLRkL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31Tav2V0vPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/319UA1swrQL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        },
        {
            "name": "Size:",
            "value": "Gray"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407774011",
            "title": "Cables"
        }
    ],
    "similar": [
        "B01MTXZ3U8",
        "B013DOCZAC",
        "B0152VEHD2",
        "B015XPL2JE",
        "B071YMZ4LD",
        "B071H25C43",
        "B07BWFRBTG",
        "B075S8HL41",
        "B013DP1QBK",
        "B01GFB1SLC",
        "B01MUJJVOG",
        "B01L1HH5TY",
        "B015MJLEUS",
        "B00MLSY6MM",
        "B014CYWWT6",
        "B014D0VKDS",
        "B012WF7ORW",
        "B078BPFW1D",
        "B07BRQSN5C",
        "B013JMBAMC",
        "B019Q4TJZC",
        "B07D2879Z9",
        "B019Q0U31A",
        "B019Q3T7YG",
        "B0714KJKRQ",
        "B07B2SYXT6",
        "B07H2DPGTC",
        "B078QHT2KY",
        "B005WKIQCC",
        "B01MTYA3IS",
        "B07D78YNKR",
        "B012VYPCY6",
        "B01A6F3WHG",
        "B01GJC4WRO",
        "B078X4NQ6M",
        "B07CG78NBT",
        "B00M850USW",
        "B07DGWK7RD",
        "B012VZ7MUM",
        "B013JNAUMW"
    ],
    "rating": "4.4"
}