{
    "asin": "B013P0K8OE",
    "title": "Logitech G633 Artemis Spectrum – RGB 7.1 Dolby and DST Headphone Surround Sound Gaming Headset – PC, PS4, Xbox One, Switch, and Mobile Compatible – Exceptional Audio Performance – Black",
    "brand": "Logitech",
    "feature": [
        "EXCEPTIONAL AUDIO PERFORMANCE: The G633 Artemis Spectrum produces crisp 7.1 Dolby and DTS headphone surround sound. The advanced Pro-G drivers and On-Board Equalizers allow customizable audio for serious gamers",
        "COMPATABLE ON MULTIPLE PLATFORMS: This gaming headphone is compatible with PCs, mobile devices, PS4s, the Xbox One, and more.Frequency response: 100Hz-20KHz",
        "MULTIPLE SOURCE AUDIO MIXING: Plug in two devices (1 USB and a 3.5-millimeter connection) to answer calls and play music without interrupting your gaming session",
        "FULLY CUSTOMIZABLE: Utilize Logitech Gaming Software to choose from millions of lighting colors, set customized audio EQ, and program three G-keys with your favorite game macros",
        "FOLDAWAY NOISE-CANCELLING MIC: The flexible boom microphone includes an LED light to let you know when you're on mute settings. Fold it back when not in use for a superior audio experience"
    ],
    "description": "The Logitech G633 Artemis Spectrum is the perfect option for the multiple-platform gamer on the go. Engineered to be compatible with PCs, mobile devices, PS4s, and the Xbox One, these G633 gaming headphones deliver the expansive cinematic gaming experience you deserve. The Pro-G audio drivers deliver 7.1 Dolby and DTS Headphone: X Surround sound for an incredibly lifelike gaming experience. This gaming headset is designed for serious gamers who demand precision audio, allowing them to detect special ability clues, recognize sneak attacks from enemies, and enhance their gaming ability with adrenaline-pumping soundtracks and audio effects programmed into today's top games.Furthermore, comfort is enhanced with the Logitech G633 Artemis Spectrum gaming headphones. The advanced Pro-G drivers are made with hybrid mesh materials that deliver crystal clear highs and rich deep bass. You'll be immersed in surround sound and hear the audio details that inferior headphones often miss. You can also customize your options, including millions of RGB lighting options, sound profiles, and G-key macros, allowing you to program customized functions for your favorite games. This gaming headset also lets you mix sound from two devices at the same time, permitting you to chat with friends, answer calls, and listen to music all at once. The G633 also comes with a secondary cable and an in-line mic for your mobile devices when you’re gaming on the go. The system requirements for the Logitech G633 Artemis Spectrum gaming headset include Windows 10, Windows 8.1, Windows 8, Windows 7, the PS4, or the Xbox One. An internet connection is also required for Logitech Gaming Software installation as well as a USB port, a 3.5mm audio port, or RCA audio output ports. The 7.1 surround sound, lighting configuration, and G-key programming require Logitech Gaming Software. In the box, you'll find the Logitech G633 Artemis Spectrum Performance Gaming Headset, a 3.5mm analog cable w/ audio controls, a USB data cable, user documentation, and custom tags (left/right).",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 175.0,
        "length": 880.0000000000001,
        "width": 370.0,
        "height": 880.0000000000001
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41lrbBLLvYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WOVen5HHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/317%2B1rAAzUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41x5hI7kZwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/4138O%2B1YO5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XxKP5ILYL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        },
        {
            "node": "11548951011",
            "title": "Audio & Video Accessories"
        },
        {
            "node": "3015405011",
            "title": "Computer Headsets"
        }
    ],
    "similar": [
        "B072BY1H95",
        "B019OB663A",
        "B076WSTTY2",
        "B0716ZFWWV",
        "B075ZMFBW8",
        "B00CQ35C1Q",
        "B01MXE0FKC",
        "B07C7KN5ZG",
        "B072FJQ82Y",
        "B07C83DF39",
        "B075NRNZWD",
        "B06XCM9LJ4",
        "B079J3TH9M",
        "B01LYNEIEI",
        "B073SQYXTW",
        "B01KED6QR8",
        "B07DDH2DJT",
        "B073DPY16B",
        "B00QFRWZF0",
        "B071S8M8TB",
        "B01M4JR54F",
        "B01K48R5V4",
        "B01N5MU23P",
        "B07B2XCDMV",
        "B073C9NFY8",
        "B07DHMFQYK",
        "B071LH74GS",
        "B07D4D8HLT",
        "B006JH8T3S",
        "B07D93W89Z",
        "B01M16Y46E",
        "B073C92JML",
        "B01L160DLW",
        "B00N3OELPU",
        "B0148NPJ78",
        "B077YG22Y9",
        "B01DFKC2SO",
        "B01K4AE4MK",
        "B079GPFJTT",
        "B00CLUASI6",
        "B073C5HFRH"
    ],
    "rating": "3.3"
}