{
    "asin": "B013UFYCDC",
    "title": "Skullcandy Smokin' Buds 2 in-Ear Bluetooth Wireless Earbuds Microphone, Customizable Fit, Removeable Moldable Collar, 7-Hour Rechargeable Battery, Noise Isolating Supreme Sound, Black/Red",
    "brand": "Skullcandy",
    "feature": [
        "LIGHTWEIGHT, LOW PROFILE, AND FLEXIBLE: Unlike other bulky and stiff products on the market, this low-profile lightweight collar is made of moldable plastic that gently hugs your neck, and can be removed entirely if you prefer. Use the notches in the collar or the provided \"S\" clip to adjust for the perfect fit or keep cables secure in place.",
        "SUPREME SOUND: Experience attacking bass, crisp vocals and precision highs, so you can hear your music with the highest quality possible.",
        "DESIGNED TO FIT NATURAL EAR SHAPE: No ear canal is a perfect circle, so why should your buds be? The Smokin' Buds 2 feature an angled and oval-shaped nozzle that aligns better with the natural shape of the ear, improving comfort and noise isolation.",
        "ONBOARD MIC AND REMOTE: Take calls and navigate your playlists with the easily located microphone and remote just under the left earbud. Use the plus and minus buttons to adjust volume or switch up music tracks. Press the middle button to answer/end calls or play/pause music.",
        "LONG LASTING BATTERY: Enjoy the comfort and sound of your Bluetooth wireless earbuds for a full 6 hours, without having to worry about recharging. Carefree listening is yours wherever you choose to take your soundtrack. Plus, the battery fully recharges in just 2.5 hours."
    ],
    "description": "One of the best-fitting earbuds on the market is now wireless. Unlike other bulky or stiff wireless earbuds, the Smokin’ Buds 2 Wireless deliver Bluetooth functionality in a lightweight around-the-neck collar that is flexible and even fully removable for your preferred fit. Experience 6 hours of your music non-stop while this bud’s unique shape keeps your ears comfortable and happy. Smokin’ Buds 2 Wireless: Freedom that Fits",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 509.99999999999994,
        "width": 130.0,
        "height": 720.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/413lWTRKKPL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Black/Red"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097478011",
            "title": "Earbud Headphones"
        }
    ],
    "similar": [
        "B07F3GWP51",
        "B0747JQVC8",
        "B00YZSXGQS",
        "B06XPK9N8L",
        "B01LVTKBM1",
        "B0792QJQT1",
        "B00J2TGZPO",
        "B013UFETBW",
        "B078TVNF83",
        "B01DWHPK5C",
        "B06XX123SH",
        "B072M48L1T",
        "B013UFPODY",
        "B0785NB978",
        "B00NCSIN4W",
        "B07GB2FT4J",
        "B07C886F1K",
        "B075VZNWWN",
        "B00C2B3EE4",
        "B075NRNZWD",
        "B078STLBMH",
        "B076FCKV6P",
        "B078J3WTYC",
        "B01DWHPMEG",
        "B07BLGWWZ8",
        "B00J9O3XHK",
        "B077YG22Y9",
        "B07FN9154F",
        "B01L160DLW",
        "B071J3XY6S",
        "B01DWHPJ94",
        "B01G8JO5F2",
        "B00NTR5GBO",
        "B072JJF6RS",
        "B07D334JSX",
        "B07CGDTWSH"
    ],
    "rating": "3.6"
}