{
    "asin": "B014LDT0ZM",
    "title": null,
    "brand": "Viva Naturals",
    "feature": [
        "CONCENTRATED FORMULA - Unlike other fish-oil products, we use supercritical extraction to concentrate the omega-3’s in our fish oil without the use of heat or chemicals. The result is a purified fish oil that delivers 3x more omega-3’s per serving than you would get with many leading supplements. Each daily serving provides you 2,200 mg of fish oil, 1,400 mg of EPA and 480 mg of DHA.",
        "SUPPORTS HEART, BRAIN, SKIN & EYE HEALTH* - Science has shown that not only do the omega-3’s in fish oil offer cardiovascular support for men and women, but they promote brain health, and help keep your skin and eyes healthy as you age.* They’ve even been shown to help adults support their metabolism, too.* An important supplement for day-to-day health.*",
        "DESIGNED FOR BETTER ABSORPTION* - Because the omega’s in Viva Naturals Ultra Strength Omega-3 Fish Oil are delivered in triglyceride form, they’ve been clinically shown to be more easily and readily available for your body to use, helping you get the most out of every serving.*",
        "CONCENTRATED FORMULA - Unlike other fish-oil products, we use supercritical extraction to concentrate the omega-3’s in our fish oil without the use of heat or chemicals. The result is a purified fish oil that delivers 3x more omega-3’s per serving than you would get with many leading supplements. Each daily serving provides you 2,200 mg of fish oil, 1,400 mg of EPA and 480 mg of DHA.",
        "SUPPORTS HEART, BRAIN, SKIN & EYE HEALTH* - Science has shown that not only do the omega-3’s in fish oil offer cardiovascular support for men and women, but they promote brain health, and help keep your skin and eyes healthy as you age.* They’ve even been shown to help adults support their metabolism, too.* An important supplement for day-to-day health.*",
        "DESIGNED FOR BETTER ABSORPTION* - Because the omega’s in Viva Naturals Ultra Strength Omega-3 Fish Oil are delivered in triglyceride form, they’ve been clinically shown to be more easily and readily available for your body to use, helping you get the most out of every serving.*",
        "NO FISHY AFTERTASTE - There’s nothing worse than the fishy aftertaste left by lower-quality fish oil supplements. Because we use an extraction method that helps strip away toxins and heavy metals, Viva Naturals Ultra Strength Omega-3 Fish Oil is purified to give you clean, high quality oil with no fishy burps or aftertaste!",
        "IFOS 5-STAR CERTIFIED - Our fish are never farm-raised; they’re wild caught from the highly-regulated coastal waters of Peru using sustainable fishing practices. Plus, we use a combination of small fish (like sardines and mackerel), known to have less mercury and fewer toxins than bigger fish like salmon. Each batch is rigorously tested for purity and IFOS 5-Star Certified, a ranking system for premium quality fish oil."
    ],
    "description": "Extracted from wild, sustainably-caught fish, Viva Naturals Ultra Strength Omega-3 Fish Oil gives you highly concentrated omega-3's for nutrition that supports your cardiovascular, cognitive, skin and ...",
    "price": 3786.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 90.0,
        "length": 340.0,
        "width": 340.0,
        "height": 650.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00C6C3GCY",
        "B071SHSG3T",
        "B01BTBZWBU",
        "B00323NW5C",
        "B00L1I9Y5C",
        "info.html",
        "B000BD0RT0",
        "B00CAZAU62",
        "B00QFTGSK6",
        "B000NPYY04",
        "B071KGQSDQ"
    ],
    "rating": null
}