{
    "asin": "B014QNQ2R6",
    "title": null,
    "brand": "Healths Harmony",
    "feature": [
        "✔ REJUVENATE YOUR KIDNEYS WITH VITACRAN CRANBERRY EXTRACT: Your kidneys are always working hard – Give them the support they need with our powerful detox! Thanks to VitaCran Cranberry Extract & other potent ingredients this cleanse helps flush toxins and maintain healthy function.",
        "✔ IMPROVE BLADDER CONTROL: With Java Tea Leaf, Birch Leaf, and Horsetail, our incredible kidney cleanse can help with occasional bladder control issues.",
        "✔ URINARY TRACT SUPPORT: With potent ingredients like Goldenrod, Uva-Ursi, and Buchu, our cleanse soothes the urinary tract promoting good health.",
        "✔ REJUVENATE YOUR KIDNEYS WITH VITACRAN CRANBERRY EXTRACT: Your kidneys are always working hard – Give them the support they need with our powerful detox! Thanks to VitaCran Cranberry Extract & other potent ingredients this cleanse helps flush toxins and maintain healthy function.",
        "✔ IMPROVE BLADDER CONTROL: With Java Tea Leaf, Birch Leaf, and Horsetail, our incredible kidney cleanse can help with occasional bladder control issues.",
        "✔ URINARY TRACT SUPPORT: With potent ingredients like Goldenrod, Uva-Ursi, and Buchu, our cleanse soothes the urinary tract promoting good health.",
        "✔ NATURAL VEGETARIAN KIDNEY SUPPORT FORMULA: When the Healths Harmony team set out to craft our cranberry pills, we wanted to create a highly effective cleanse that didn’t sacrifice quality. Made in the USA in FDA-approved facilities, our kidney supplement uses natural ingredients to bring great results without the side effects!"
    ],
    "description": "Natural Kidney Cleanse with VitaCran Cranberry Extract! Your body counts on the kidneys to help filter waste. But if you consume a high protein diet, drink alcohol, or regularly smoke, you could be pu ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 2.0,
        "length": 240.0,
        "width": 220.00000000000003,
        "height": 220.00000000000003
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01512ZY7K",
        "B01FVQHUDC",
        "B0776FL541",
        "info.html",
        "B01B1WZWN0",
        "B000N3BZIA",
        "B07GZXZKCD",
        "B001EM2UR4"
    ],
    "rating": null
}