{
    "asin": "B014EBQ4OQ",
    "title": "Osprey Packs Manta AG 36 Hydration Pack",
    "brand": "Osprey",
    "feature": [
        "Osprey's stow-on-the-go trekking pole attachment is designed to quickly attach and carry trekking poles while wearing the pack",
        "An integrated and removable rain cover protects your gear from foul weather. It stows away in its own external pocket at the bottom of the pack",
        "Care Instructions: Do NOT wash your pack in a washing machine clean your pack and components in a bathtub or large sink using a mild detergent and warm water and the zippers using a mild soap, warm water and a soft brush. Keeping dirt and debris out of the zippers and buckles will help keep them in proper working condition. Rinse the pack thoroughly and hang your pack to dry outside or in a well ventilated area, out of direct sunlight",
        "A large zippered front panel pocket contains internal mesh pockets for gear organization",
        "The blinker light attachment found near the base of the front panel of the pack allows for Quick light attachment for high visibility in the dark"
    ],
    "description": "Grab osprey's Manta ag 36 and hit the trail for a long day hike. The anti-gravity (ag) suspension system-a combination of light wire frame, mesh back panel, bio stretch shoulder harness and ag hip belt-distributes weight to keep you comfortable no matter how far you roam. Dual upper and lower compression straps help stabilize the load and provide add-on storage options if you have extra bulky gear. The pack's main compartment is accessed via a front zip panel so you can see all your gear at a glance. A series of well-designed pockets keep you organized on the trail. There's a front panel fabric Shove-It pocket for quick transitions and a large zippered front panel pocket with internal mesh pockets for securing small items. Dual side stretch mesh pockets provide space for extra water bottles and the hip belt has two zippered pockets for keeping trail snacks or a phone. A scratch-free zippered slash pocket provides safe harbor for your shades. Additional storage features include a helmet attachment loop and osprey's stow-on-the-go trekking pole attachment system to stash your sticks. An integrated removable rain cover protects your gear if the weather rolls in. This pack comes with a hydraulics lt 2.5 liter reservoir compete with osprey's magnetic sternum strap bite valve for instant access to fluids.",
    "price": 17500.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 340.0,
        "length": 2200.0,
        "width": 1500.0,
        "height": 1300.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41g2vU47TCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513WdZXWcBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5124%2Bly93hL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61nz9OrIAIL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sBMglaN3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41io85xkOSL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        },
        {
            "name": "Size:",
            "value": "Fossil Grey"
        }
    ],
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3400371",
            "title": "Camping & Hiking"
        },
        {
            "node": "3400391",
            "title": "Backpacks & Bags"
        },
        {
            "node": "10208054011",
            "title": "Backpacking Packs"
        },
        {
            "node": "3400551",
            "title": "Hydration Packs"
        }
    ],
    "similar": [
        "B00HOATE7O",
        "B014EBPC5I",
        "B01LXGGUEP",
        "B017P6EFYI",
        "B014EBQ7LG",
        "B014EBT9TS",
        "B07C8136GR",
        "B00HA0I064",
        "B00PKMXQNQ",
        "B014EBTRHM",
        "B0747PH7XJ",
        "B077MG3J45",
        "B019UTM2GG",
        "B0759Y6TDS",
        "B07BS41MN1",
        "B014EBQE0A",
        "B072KJW34Q",
        "B014EBQH3O",
        "B073QFMN7R",
        "B010GEXFQU",
        "B019UTJ386",
        "B01BD5HR6A",
        "B078HRZFCJ",
        "B0128EJ57E",
        "B0714R38BC",
        "B014EBPEP6",
        "B0747PYLSS",
        "B01DCCTTP4",
        "B014EBPSLQ",
        "B019UTKOQG",
        "B019UTJ6AQ",
        "B01MRSIGI8",
        "B078HPC7VB",
        "B07F3LPDM3",
        "B00HOAVI5A",
        "B019NKU688",
        "B00W9O3A4I",
        "B00WTUVBMA",
        "B01DZK64QA",
        "B00YI6ZJ0I"
    ],
    "rating": "4.5"
}