{
    "asin": "B01419Q6LW",
    "title": "SanDisk 16 GB Class 10 SD HC Ultra Flash Memory Card - 4 Pack With Everything But Stromboli (tm) MicroFiber Cleaning Cloth",
    "brand": "SanDisk",
    "feature": [
        "Cards include security feature for protection of copyrighted data",
        "SDHC cards are fully compatible with all SDHC-compliant devices",
        "Speed performance rating: Class 10",
        "Everything But Stromboli (tm) Contact Cleaning Cloth",
        "High quality and reliability backed by a 5-year limited manufacturer warranty"
    ],
    "description": "Capture and store all your memories with the affordable and reliable SanDisk SDHC Memory Card (16GB). With 16GB of storage space, the card allows you to take plenty of photos and video without running out of space. The card also features a writeable label, making it easier than ever to keep everything organized. 16GB of Storage for Music, Data, Photos, and Video In addition to digital cameras, many portable media players feature SDHC card slots for storing music, data, and video. The SanDisk SDHC Memory Card gives you plenty of space for all your tunes, TV shows, video clips, and more. The card is also ideal for moving files between computers, cameras, and other gadgets. Writeable Label for Easy Organization The SanDisk SDHC Memory Card has a blank writeable white space on the front of the card, making it easy to identify your different cards. Use one memory card for all your vacation photos, and another for all your favorite music--the label makes it easy to see which is which at a glance. Proven Reliable and Built to Withstand Harsh Conditions The SanDisk SDHC Memory Card provides reliable performance. The card is waterproof, temperature proof, shock and vibration proof, and x-ray proof. No matter where your travels take you, you'll always be able to capture the most memorable moments. Legal Disclaimers 1GB=1,000,000,000 bytes. Actual user storage less.",
    "price": 2900.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 700.0,
        "width": 480.0,
        "height": 60.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51M%2BTiV237L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51O75%2BjWdWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41itTWmLktL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        }
    ],
    "similar": [
        "B017HPZKLO",
        "B0143RT8OY",
        "B06XSMV1DW",
        "B075Z5WM4V",
        "B07FDTPSKJ",
        "B0782XMMKV",
        "B01IMKEMC6",
        "B00297BRYA",
        "B00YHMZRUA",
        "B0085DZRDE",
        "B07BJHHQKG",
        "B00RH09P0M",
        "B07CC93KG1",
        "B00ESW9SWW",
        "B0189DKN2E",
        "B07DPL6Q8H",
        "B01N75X6MW",
        "B079GVC56W",
        "B007JFOLMW",
        "B07F23XX1B",
        "B0127VENV6",
        "B07G2F6N74",
        "B00WWBCSG4",
        "B01LQV181G",
        "B01419SYGW",
        "B00JIXRXKA",
        "B07FS5KBH5",
        "B007E273MK",
        "B074CLNZWN"
    ],
    "rating": "4.5"
}