{
    "asin": "B0144NYGJY",
    "title": "Norton Security Deluxe - 5 Device [Key Card]",
    "brand": "Symantec",
    "feature": [
        "Note: Product accesses is updated constantly, as it is a subscription product",
        "Norton Security Deluxe secures up to 5 PCs, Macs, iOS & Android devices - A physical activation key code will be mailed to you (select ‘PC/Mac Download’ option for instant download of activation code). This product is 2018 ready",
        "Antivirus is included, and your protection is always up-to-date to defend against ransomeware, spyware, malware, and unsafe websites, while safeguarding your identity and online transactions",
        "Norton consistently outperforms the competition in independent, head-to-head tests; Winner of AV-TEST’s coveted Best Protection Award and 39x winner of PC Magazine Editor’s Choice Award",
        "Please note that if you have an existing Norton subscription, your old subscription days do not get added to this new subscription, so it’s best to activate your new subscription when the old one is about to expire",
        "Installs in minutes, rated highest in usability, includes unlimited 24/7 access to a Norton technician, and offers a 100% guarantee that helps keep you virus free or your money back"
    ],
    "description": "Norton Security Deluxe protects your identity and financial data from cybercrime. If you pay your bills on your smartphone, shop on your tablet or keep important financial information on your laptop, get Norton Security Deluxe for one easy solution that protects up to five of your devices-PCs, Macs, smartphones, and tablets-all backed by our 100% guarantee. To be eligible for the Virus Protection Promise, you must purchase, renew or upgrade your Norton subscription directly from Symantec, or subscribe to the Norton Automatic Renewal Service.",
    "price": null,
    "listPrice": 7998.999999999999,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 100.0,
        "width": 520.0,
        "height": 750.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51-e9PP3XyL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51L3fEE%2BZ2L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YRv5sBdqL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vQCGyg4LL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ikUQE5EYL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Platform:",
            "value": "1"
        },
        {
            "name": "Edition:",
            "value": "Key Card [12 month]"
        }
    ],
    "categories": [
        {
            "node": "229534",
            "title": "Software"
        },
        {
            "node": "229677",
            "title": "Antivirus & Security"
        },
        {
            "node": "2251987011",
            "title": "Internet Security Suites"
        }
    ],
    "similar": [
        "B009SPTUW2",
        "B00EZKNYXG",
        "B073HXXCWZ",
        "B076CXSG7F",
        "B076D1YSD4",
        "B00EZKNY8G",
        "B07C65YB6Y",
        "B076CWK6GD",
        "B0144NY79S",
        "B015724OVG",
        "B07CY54KL5",
        "B009PFT17Y",
        "B07CYH3HPD",
        "B0144NY8OW",
        "B07BFS3G7P",
        "B0148BYIAO",
        "B0144NYEY6",
        "B015724RQI",
        "B076D1YW3Q",
        "B0114ZV22E",
        "B07CCK6KV5",
        "B06Y2L54K6",
        "B013X956R6",
        "B07CPK95TF"
    ],
    "rating": "4.2"
}