{
    "asin": "B014ZOJX7W",
    "title": "Anker 3-Port USB 3.0 Portable Data Hub with 1 Gbps Ethernet Port Network Adapter for MacBook, Mac Pro/Mini, iMac, XPS, Surface Pro, Notebooks, Desktop PCs, USB Flash Drives, Mobile HDD, and More",
    "brand": "Anker",
    "feature": [
        "The Anker Advantage: Join the 20 million+ powered by our leading technology.",
        "Quick Sync: Enjoy data transfer speeds of up to 5 Gbps. Transfer an HD movie in seconds.",
        "Cabled Connection: Get reliable, fast access to the web at speeds of up to 1 Gbps through the Ethernet port.",
        "Compact and Convenient: Distinctive “power-bar” design takes up the least possible amount of space in your computer bag.",
        "What You Get: Anker 3-Port USB 3.0 Portable Data Hub and Ethernet Network Adapter, 1.6ft / 50cm USB 3.0 cable, welcome guide, our fan-favorite 18-month warranty and friendly customer service."
    ],
    "description": "Sync and Connect With Ease Industry-Leading Technology 99% Positive Feedback Transmit data via USB at up to 5Gbps, fast enough to transfer a high-definition movie in seconds—no more wait times when sending and receiving important files. Access stable connection speeds of up to 1 Gbps through the Ethernet port. Also supports 10, 100, and 1000 Mbps connectivity. Just 1cm thick and weighing about the same as a bar of soap. Slips easily into a pocket, purse or laptop bag to easily go wherever you do. At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support. Note: To ensure a stable connection, don't use this hub with high power-consumption devices such as some large-capacity hard drives. This hub is not meant to serve as a stand-alone charger. It is not compatible with iPads or any other devices with irregular charging requirements. Mac OS X Lion 10.7.4 users should upgrade to Mountain Lion 10.8.2 or later to avoid unstable connections. 2.4Ghz wireless devices (keyboards, mice, etc.) may not work around USB 3.0 ports. Try using a USB 2.0 connection. System Requirements: Windows (32/64 bit) 10 / 8.1 / 8 / 7 / Vista / XP, Mac OS X 10.6 to 10.9, Linux 2.6.14 or above. On Windows, a driver needs to be manually installed to enable ethernet connection. No drivers required for data ports on all compatible systems.",
    "price": 2499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 370.0,
        "width": 120.0,
        "height": 90.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41N7AqLCVXL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41k983H9FaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41KSkQYigIL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41PRdEv4PRL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51XP8oEcs3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41g2RYA70NL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XCR01geUL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172504",
            "title": "Networking Products"
        },
        {
            "node": "281413",
            "title": "Hubs"
        }
    ],
    "similar": [
        "B01MTAOW7T",
        "B01DBGVB7K",
        "B01M7PL2WP",
        "B00ESM3ISM",
        "B07D724XXL",
        "B00M77HMU0",
        "B01D0XTF9U",
        "B07FTDGXKK",
        "B0178HOTOU",
        "B00LLUEJXW",
        "B00NOP70EC",
        "B00MYT481C",
        "B00PC07T02",
        "B00N2VIALK",
        "B0163HP38W",
        "B01M4J1DDP",
        "B00MYTSN18",
        "B001W28L2Y",
        "B00XMD7KPU",
        "B074XK1GTS",
        "B07DQDTP46",
        "B075ZX24H4",
        "B00ZZ6NW5E",
        "B0716J3CYJ",
        "B071G83L1J",
        "B00IJU0K2Q",
        "B00PC0H9IE",
        "B0756TYZ8W",
        "B00LLUEJFU"
    ],
    "rating": "4.4"
}