{
    "asin": "B015EQNVLO",
    "title": "Most Effective Whitening Cream - Mother of Pearl (Concha de Nacar) Mask for Face and Body: Brightens and Whitens Skin - Cleansing - Moisturizing - Anti-Aging Ingredients for Naturally Radiant Skin",
    "brand": "Portugal Cosmetics",
    "feature": null,
    "description": "Is your skin starting to show some wear and tear from daily living, like acne scars, aging spots, stretch marks, or uneven blotchy skin from sun damage? Would you like to restore your skin to a youthful radiant glow? If you’re like most of us, life can be rough on our skin! Environmental toxins and sun damage cause skin to age and look dull, with dark spots and uneven skin tone and texture. Here’s a product that’s going to be your best friend! It’s a cream mask that you leave on your skin, made with mother-of-pearl shell for whitening and brightening. What is Mother-of-Pearl? It comes from the iridescent lining of abalone and pearl oyster shells. It has been used to whiten and brighten skin since the ancient Chinese Ming Dynasty and pre-Colombian Incan Empire! When crushed into a fine powder, Mother-of-Pearl exfoliates and deep cleans the pores, moisturizes and smooths, and evens skin tone all in one cream! Great as a bleaching mask at night. And, the Nacar ingredient leaves behind a fine luminescent sheen on your skin that gives you a radiant, healthy glow! Our customers have reported that within just a few days they begin to see their skin tone even, dark spots fade, and they say their skin has never felt so silky smooth and soft. They like the non-greasy cream that absorbs quickly, so they can apply makeup for the day, and they L-O-V-E the soft, radiant glow!",
    "price": 1995.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 400.0,
        "width": 200.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51m6vAPBbnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/519HeVZRFHL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060711",
            "title": "Face"
        },
        {
            "node": "11061301",
            "title": "Creams & Moisturizers"
        }
    ],
    "similar": [
        "B07GVBQ8JS",
        "B00OU2VDZU",
        "B00CHMWAY8",
        "B07B8RLSCX",
        "B004S7U8XK",
        "B01N7O3HS6",
        "B0034F9K36",
        "B01BCRC37C",
        "B00B5ULG34",
        "B000XPC8MA",
        "B00OC0DUNI",
        "B073ZL3G6S",
        "B01IA8NG9A",
        "B07D27CN1P",
        "B01B6PQAHY",
        "B00NQFEVLK",
        "B00L2LAIDU",
        "B01457FYU4",
        "B01BCQKI5M",
        "B01CLJCVKE",
        "B01B9HY1NY"
    ],
    "rating": "3.6"
}