{
    "asin": "B0153VTN9E",
    "title": null,
    "brand": "Honeydew",
    "feature": [
        "Premium Tea Tree shampoo enhanced with peppermint essential oil for a cool and refreshing experience. Formulated with gentle, nourishing constituents safe for everyday use.",
        "Contains specially sourced organic ingredients to provide a natural hair treatment for dandruff, dry scalp, lice as well as damaged and malnourished hair.",
        "Augmented with a 100% natural, energizing and invigorating aroma of 100% pure organic essential oils for a refreshing shower experience.",
        "Premium Tea Tree shampoo enhanced with peppermint essential oil for a cool and refreshing experience. Formulated with gentle, nourishing constituents safe for everyday use.",
        "Contains specially sourced organic ingredients to provide a natural hair treatment for dandruff, dry scalp, lice as well as damaged and malnourished hair.",
        "Augmented with a 100% natural, energizing and invigorating aroma of 100% pure organic essential oils for a refreshing shower experience.",
        "Moisturizing and thickening shampoo is ideal for hair types. Contains no parabens, sulfate free, and safe for color treated hair. For kids, women and men of all ages.",
        "Manufactured in a state-of-the-art facility in the USA which exceeds all GMP standards. Clean, pure and natural, Honeydew Products premium Tea Tree Peppermint Shampoo is assured to exceed expectations in quality and effectiveness – 100% money-back guaranteed!"
    ],
    "description": "Honeydew Products premium Tea Tree Peppermint shampoo combines 100% pure, therapeutic-grade essentials Tea Tree, Rosemary and Peppermint to provide first-rate treatment for malnourished hair and scalp ...",
    "price": null,
    "listPrice": 3900.0,
    "prime": true,
    "dimensions": {
        "weight": 60.0,
        "length": 150.0,
        "width": 150.0,
        "height": 800.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B018WP6E3Q",
        "B01527GXCE",
        "B010FHRA4G",
        "B00CNTJHQO",
        "B01MYN5U1K",
        "B00ZFJKCXG",
        "B01DZ0G0I2",
        "B018J6KIBW",
        "info.html"
    ],
    "rating": null
}