{
    "asin": "B015XPU7RC",
    "title": "Anker [6-Pack] PowerLine Micro USB - Durable Charging Cable [Assorted Lengths] for Samsung, Nexus, LG, Motorola, Android Smartphones and More (Black)",
    "brand": "Anker",
    "feature": [
        "The Anker Advantage: Join the 10 million+ powered by our leading technology.",
        "Lasts 10x Longer: With aramid fiber construction and a 5000+ bend lifespan, PowerLine is many times more durable than anything else on the market.",
        "Faster Charging: Thick gauge wiring and reduced cable resistance enable PowerLine to provide the fastest possible charge via any USB charger, plus data transfer.",
        "Great Lengths: Two 1ft, three 3ft (including plugs) and one 6ft cables offer a length ready for every situation.",
        "What You Get: 6 Anker PowerLine Micro USB cables in assorted lengths, our worry-free 18-month warranty and friendly customer service."
    ],
    "description": "The faster and durable charging cable. - Faster and safer charging with our advanced technology - 10 million+ happy users and counting The Anker PowerLine is reinforced with bulletproof aramid fiber. That makes it much stronger than conventional cables. We bent this cable over 5000 times and saw no damage or change in performance. PowerLine Micro USB is one of the most remarkably durable cables in existence. Thanks to wide diameter wires and reduced cord resistance, PowerLine enables the fastest possible charge speed via any USB charger. To maximize case compatibility, we made PowerLine's Micro USB connector as compact as possible, without compromising its durability. At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support. Android smartphones and tablets, e-readers, cameras, MP3 players, hard drives, portable chargers, handheld game consoles and all other Micro USB devices from brands including Samsung, HTC, Motorola, Nexus, Nokia, LG, HP, Sony, Blackberry and many more.",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 7090.000000000001,
        "width": 60.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Eneby90JL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41BFF1%2BmAjL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2BTI6Ue1bL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407774011",
            "title": "Cables"
        }
    ],
    "similar": [
        "B07DKYS1R2",
        "B079BJWP8X",
        "B015XPL2JE",
        "B071YMZ4LD",
        "B071H25C43",
        "B015XR60MQ",
        "B01N5FMY50",
        "B00XVU4IPO",
        "B00P936188",
        "B07GV8CQ4X",
        "B01MUJJVOG",
        "B073WRH9QN",
        "B01MUJOA5E",
        "B01L1HH5TY",
        "B015MJLEUS",
        "B0741DPYKX",
        "B019JY97QA",
        "B01F9RGJJO",
        "B077ZX4FZD",
        "B01IUTIUEA",
        "B01HF0YGCK",
        "B07C3J28X8",
        "B07D2879Z9",
        "B07B7FZZB7",
        "B07GRLQZJ1",
        "B01I0VD8JA",
        "B01GJC4WRO",
        "B01NAMTC5T",
        "B01NGTUJ4Y",
        "B00T38OHQ8",
        "B07DGWK7RD",
        "B07FCH2P3R"
    ],
    "rating": "4.5"
}