{
    "asin": "B015YE7SM4",
    "title": "G.SKILL RIPJAWS MX780 Cutting Edge Ambidextrous RGB 8200 DPI Laser Gaming Mouse with Adjustable Grips, Height, and Weights",
    "brand": "G.Skill",
    "feature": [
        "ESPORTS APPROVED - Designed for pin point accuracy and pro-longed gaming across all game types",
        "ADJUSTABLE ERGONOMICS - Ambidextrous and interchangeable side grips along with customization height and weights ensure perfect ergonomics no matter your hand shape, grip type, and orientation",
        "SAVED CUSTOMIZATIONS – On-Board profile storage for 8 fully programmable buttons and RGB lighting effects",
        "HIGH GRADE COMPONENTS - Gaming Grade AVAGO 8200 DPI Laser and Omron micro switch provide the best performance and durability",
        "UNIQUE AESTHETICS - Uplift your gaming station with purposefully designed angles and unconventional shapes"
    ],
    "description": "The RIPJAWS MX 780 from G. SKILL is the newest gaming mouse to shake up the community with its gaming focused engineering, innovative features, and affordable price. The RIPJAWS MX 780 has been thoroughly tested by top eSport gamers from CS:GO (FPS), League of Legends (MOBA) and, Starcraft II (RTS) and ensures the best mouse gaming experience for all games and all players. G.SKILL has elevated the gaming experience with the RIPJAWS MX 780! The perfect ergonomic is the key to pro-longed gaming performance. G.SKILL has through extensive researched determined the two main factors when considering ergonomics is width and height. The MX 780 has solved this problem by offering ambidextrous and interchangeable side grips and a fully adjustable palm rest. Together the MX 780 is the perfect wired gaming mouse for all hand sizes and orientations. The adjustable polling rate (125Hz/250Hz/500Hz/1000Hz) allows you to find the perfect balance between mouse latency and CPU usage. Add more personal customizations with the 8 programmable keys and 4-zone RGB lighting which can be saved to 5 on-board profiles. The features list continues on with an 8,200 DPI AVAGO laser which provides unparalleled pin point accuracy for the perfect headshot twitch. Paired with PTFE glide pads, you will never have another death or lose because of a poorly designed mouse. G.SKILL RIPJAWS MX 780 is the best peripheral to bring to battle. The G.SKILL RIPJAWS MX780 is the perfect pairing for your RGB gaming PC, chair, laptop, monitor, desk, and even motherboard with its MSI mystic light RGB sync and Gigabyte RGB fusion with a full spectrum of RGB colors. Create your own color theme for each year, day, or even hour! Purchase worry free with the G.SKILL’s 2 year warranty and excellent customer support! Have questions? We encourage you to email us at ustech@gskillusa.com. Sensor: AVAGO Laser Switch: Omron DPI: 100 to 8,200 Polling Rates: 125Hz/250Hz/500Hz/1000Hz Lighting: 4-Zone Full Spectrum RGB Profiles: 5 Programmable Keys: 5 Weights: (2) 4.5g Dimensions: 130 x 70 x 38mm (5.12 x 2.76 x 1.5in) With Grips: 130 x 93 x 38mm (5.12 x 3.66 x 1.5in) Weight: 111g Cable Length: 1.8m (6ft) Cable Type: USB, Braided Mouse Feet: PTFE Glide Pads On-Board Memory: 512KB 2 year limited warranty",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 70.0,
        "length": 509.99999999999994,
        "width": 370.0,
        "height": 150.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41aE0Wz6KPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51LLsG%2BnDHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410YazILuJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51iLb8GTXcL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41MiaIRAwFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41tRXBQDozL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "468642",
            "title": "Video Games"
        },
        {
            "node": "229575",
            "title": "PC"
        },
        {
            "node": "318813011",
            "title": "Accessories"
        },
        {
            "node": "402052011",
            "title": "Gaming Mice"
        }
    ],
    "similar": [
        "B0186W6PGQ",
        "B077XDQD2D",
        "B01798XY7G",
        "B01DW2VQ5A",
        "B011HMDZ0Q",
        "B07D99ZDCH",
        "B0788MCRGC",
        "B07C7TXH11",
        "B01MTQS2SE",
        "B078STZ2DK",
        "B00FNKMVUO",
        "B0186W6QG0",
        "B013P0HW7K",
        "B073WGB8G6",
        "B06XD43FWC",
        "B0756T2H5F",
        "B015MQH59A",
        "B01M99JQIZ",
        "B014CP231W",
        "B014W3FHTE",
        "B073WGFLQY",
        "B015YE7II8",
        "B078LJ6RPK",
        "B01LZ0VSIH",
        "B072C3LFD6",
        "B0186W6PMK",
        "B01MYPYCP6"
    ],
    "rating": "4.0"
}