{
    "asin": "B01690WI6S",
    "title": "GLYSOLID Skin Cream, Jar 6.76 fl oz (200 ml)",
    "brand": "Glysolid",
    "feature": null,
    "description": "Glysolid® Glycerin Skin Cream is the advanced European formula that helps to smooth and soften dry to very dry skin on hands, feet, and the body. With allantoin and a high glycerin content, Glysolid® greatly improves the look and feel of skin in just one application.Glysolid® is thick, smooth, and silky. When applied to the skin, Glysolid® adds a light protective film, locking in your skin's natural oils and moisture. This protection lasts for hours, providing your skin with the soothing moisture to help repair even the driest skin.Due to its unique formula, Glysolid® is especially effective on the toughest areas of your body: hands, elbows, feet, heels, and knees. Light creams and lotions are almost completely ineffective for these trouble spots. However, Glysolid® quickly restores the natural beauty and softness of your skin. With regular use, your skin remains soft, smooth, and healthy looking.Glysolid® contains no mineral oils, parabens, petroleum, or cheap fillers. It also contains no skin irritants, such as perfumes, coloring, or preservatives. This makes Glysolid® compatible with all skin types, including sensitive skin.",
    "price": 1295.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 50.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51UjeLdWB6L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3760941",
            "title": "Health Care"
        },
        {
            "node": "10079990011",
            "title": "Medications & Treatments"
        },
        {
            "node": "10728461",
            "title": "Eczema, Psoriasis & Rosacea Care"
        }
    ],
    "similar": [
        "B017MOR60S",
        "B000CEOT6A",
        "B00HU6Q8IA",
        "B005BXY390",
        "B00G04Z17C",
        "B01B3DHD9S",
        "B01690Q616",
        "B07CVQHMG5",
        "B014Q6EC7K",
        "B07B3XHQDQ",
        "B00WRN3TBU",
        "B0012V8CHE",
        "B002OV2I6W",
        "B07BZ1SF5J",
        "B006K3J5B6",
        "B01MFAPPKH",
        "B01B8BQGQ6",
        "B076VRCC4X",
        "B07B3X67TL",
        "B01ES349CY",
        "B00HFDZ3UW",
        "B07BYYDZS9"
    ],
    "rating": "4.7"
}