{
    "asin": "B017PDRDZE",
    "title": "Coco Mademoiselle by Chanel 3.4 oz Eau De Parfum Spray FOR WOMEN",
    "brand": "Mind",
    "feature": null,
    "description": "Coco Mademoiselle was introduced as eau de parfum in 2001, as well as eau de toilette in 2002. Both compositions were created by Jacques Polge – perfumer for .C H A N E L. since 1978. Feminine edition Coco Mademoiselle was presented as pure perfume as the very essence of this edition. A richer composition full of contrasts and nuances can be found in 7.5 ml perfume flacons and each of its drops celebrates famous spirit of .C H A N E L.'s Coco Mademoiselle. A luxurious purse edition arrives in a flacon shaped just like EDP edition, decorated with a seal on its neck. The composition is focused on two characteristic ingredients of .C H A N E L. editions – jasmine absolute and May rose absolute. Delicate flowers are enhanced and enriched with a touch of Florentine iris. Top notes of Coco Mademoiselle Parfum incorporate Sicilian oranges, Calabrian bergamot and Sicilian grapefruit. A floral heart is created of pure rose extract and pure jasmine extract, along with a fruity touch of litchi, while its base notes carry a combination of Indonesian patchouli, Haitian vetiver, Bourbon vanilla ad white musk. This fragrance is dedicated to courageous, brave and modern women who prefer luxury and elegance. .C H A N E L. Coco Mademoiselle Parfum – fragrant gem can be combined with glittery body gel, which refreshes and seduces with its oriental-fresh notes of citruses in top, flowers and litchi in a heart and cuddling finish in base notes.",
    "price": 16493.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 81.25,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Ea8l3%2B0WL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pcwrsqPUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41k7%2BPrXjuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41NHIVmWdQL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11056591",
            "title": "Fragrance"
        },
        {
            "node": "11056931",
            "title": "Women's"
        },
        {
            "node": "11057071",
            "title": "Eau de Parfum"
        }
    ],
    "similar": [
        "B018RMJD3M",
        "B00QOR0Z12",
        "B009NI9R86",
        "B077R6MR3R",
        "B0192EMZAC",
        "B00HNZOVVY",
        "B00DW10WMK",
        "B01A0MFUIO",
        "B01MU90OEK",
        "B002XQ1YTK",
        "B00TI6TSLO",
        "B076LP6F92",
        "B014Q8YMCI",
        "B00X6ZNWG0",
        "B002XQ1YT0",
        "B0762VLTKF",
        "B0768MNVS2",
        "B0768FJJW7",
        "B016M9UEY4",
        "B019IZAWOG",
        "B00SH46VR2",
        "B01JV8ROBE"
    ],
    "rating": "4.1"
}