{
    "asin": "B017BYJZVM",
    "title": "DURBPRO 58\" Lavalier Microphone Clip-on Lapel Omnidirectional Condenser Mic for Apple iPhone, iPad, iPod Touch, Samsung Android, MacBook, iMac, and Windows Smartphones Podcast Phone Video Recording",
    "brand": "DURBPRO",
    "feature": [
        "IDEAL FOR ANY KIND OF AUDIO AND VIDEO RECORDING NEEDS: The perfect tool for work, school and much more. Connect it easily to your phone/laptop/tablet using the 1/8\" TRRS jack. Instantly record podcasts, videos and all kinds of audio with professional, clear, definite sound.",
        "SUPER EASY TO USE, HANDS FREE DESIGN: The ergonomically engineered clip allows for attaching the lavalier microphone to your clothes without any hassle. On top of that, the mic is incredibly lightweight and doesn’t create a single second of discomfort!",
        "PERFORMS SIGNIFICANTLY BETTER THAN YOUR PHONE’S MIC: More consistent recording even when you are outside. Carefully engineered to ignore the outside noises and focus only on the sound of your voice!",
        "YOU CAN GET IT FREE OF RISK: We are so confident in the efficacy of our products that they are backed up by an 100% Money Back Guarantee. If for any reason you aren’t delighted with our Omnidirectional Condenser Microphone, that we will refund every penny with no questions asked!",
        "INCLUDES: 58\" Cable Length and a deluxe carrying pouch for extra convenience and maximum portability. Also includes a Tie Clip and (2) Windscreens!"
    ],
    "description": "If you are looking for the best clip-on lapel microphone money can buy, then you have come to the right place. Now you can finally record audio anywhere, anytime. And the best thing? You can do that of professional equipment or recording studios. The DURBPRO lavalier microphone was designed with practicality and efficiency in mind. As a result, it offers a reliable way to record videos, podcasts, interviews or vlogs with crystal-clear, rich audio. When you start using it, you will experience a profound difference compared to your phone's built in Microphone. DURBPRO closely touches the sound quality and efficiency of a studio mic, while also being portable and economical. Don't lose any more time!",
    "price": 994.9999999999999,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 2.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41uA75UG8QL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/419jN9M45KL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31obdwRKanL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31pFUperqWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DUMZSgguL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/415RCjuv1BL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "11091801",
            "title": "Musical Instruments"
        },
        {
            "node": "11974521",
            "title": "Microphones & Accessories"
        },
        {
            "node": "8882489011",
            "title": "Microphones"
        },
        {
            "node": "11974711",
            "title": "Wireless Microphones & Systems"
        },
        {
            "node": "11974761",
            "title": "Wireless Lavalier Microphones"
        }
    ],
    "similar": [
        "B076F5W8Q5",
        "B009YCI62Y",
        "B075JHG28K",
        "B01AG56HYQ",
        "B015GDVSJ2",
        "B000MYPPPE",
        "B01MEDL9RK",
        "B00XIQCFWY",
        "B01M4J5WCM",
        "B075VQ7VG7",
        "B005JPWNVU",
        "B002HJ9PTO",
        "B01N5HDGYV",
        "B01E3L1ESS",
        "B01M6VFHMH",
        "B074QTNY4C",
        "B00EBK6C20",
        "B016C4ZG74",
        "B074KJ1N3D",
        "B01DQ0BJ2S",
        "B000UVCSNQ",
        "B00SHJPMEU",
        "B01M58FRP9"
    ],
    "rating": "3.9"
}