{
    "asin": "B018M8YEX0",
    "title": "8in USB OTG Cable - Micro USB to Micro USB - M/M - USB OTG Mobile Device Adapter Cable - 8 inch",
    "brand": "StarTech",
    "feature": [
        "Connect your USB On-the-Go capable tablet or phone to an external drive or other Micro-USB device",
        "8\" Micro USB to Micro USB OTG Cable M/M / 8in USB OTG Cable / Micro to Micro OTG Mobile Device Adapter Cable",
        "Connect a Micro-USB external drive or game controller to your Micro-USB mobile device / Create an interactive digital signage kiosk with USB touchscreen",
        "Support for USB OTG (On-the-Go) capable devices / 8-inch cable is a portable solution which is perfect for carrying as a tablet accessory",
        "This adapter will only work with devices that support USB OTG (On-the-Go)",
        "Guaranteed reliability with a lifetime warranty"
    ],
    "description": "Now, you can download confidential information from your smartphone or tablet to an external drive, without having to use a Wi-Fi or mobile data connection. This 8 in. USB OTG cable gives you the perfect solution for backing up your important research and other data collected while you’re on the road. The cable turns the Micro-USB port on your mobile device into a USB OTG host port, so that you can connect a Micro-USB drive or other Micro-USB device, such as a game controller, directly to your phone or tablet. The OTG cable features a compact design that’s perfect for carrying as a tablet accessory. The UUUSBOTG8IN is backed by StarTech.com’s lifetime warranty for guaranteed reliability. Please Note: This adapter will only work with devices that support USB OTG. Please consult your documentation and/or your service provider to ensure that your device supports USB OTG functionality.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 2.0,
        "length": 890.0,
        "width": 490.00000000000006,
        "height": 40.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41KFD3Jjk6L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "8in Micro USB to Micro USB Cable"
        },
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172532",
            "title": "Audio & Video Accessories"
        },
        {
            "node": "172544",
            "title": "Connectors & Adapters"
        }
    ],
    "similar": [
        "B0753G7SJ5",
        "B00TQOEST0",
        "B01M5GZ3N0",
        "B07CWS7LMM",
        "B00K4RZQWQ",
        "B00NH11R3I",
        "B073DZCNGV",
        "B00N9S9Z0G",
        "B076HGJGPK",
        "B0742DGRCN",
        "B00D8YZ2SA",
        "B07DHJMM3T",
        "B00BFYH11Q",
        "B00KL7C10O",
        "B00B4GGW5Q",
        "B07DJ6RSB9",
        "B0744BW2B2",
        "B074H5B7CP",
        "B00DHN9CMO",
        "B07G3689NK",
        "B018M8YNDG",
        "B002O1S8IE",
        "B00O519I9E",
        "B07G3692MQ",
        "B075YQ7Y9K",
        "B00KILQLKE",
        "B0786WD79M",
        "B076WX64RF",
        "B06XGCML55",
        "B00T28JQUG"
    ],
    "rating": "4.3"
}