{
    "asin": "B0188BQO7K",
    "title": "Ohuhu 175 PCS Watch Repair Tool Kit Case, Professional Spring Bar Tool Set, Watch Band Link Pin Tools",
    "brand": "Ohuhu",
    "feature": [
        "✔ Deluxe Watch Repair Kit: With a grand total of 175 pieces, this Ohuhu Watch Repair Tool Kit includes everything you could ever need for watch repairs. Comes with 156 spring bars to the greatest extent to meet the different needs of various watches",
        "✔ Free Storage Case: Stay organized with the included storage case! Your tools will stay neat, organized, and ready to go",
        "✔ Professional Quality: This kit is built to last. Made from premium materials like aluminum alloy, ABS, copper, and plastic, the tools will withstand years of wear, tear, and abuse",
        "✔ Precise Repairs: These tools are for more than just watches— they’re also a good helper for toys and small electronics! You’ll never know when this kit might come in handy box for every details of your daily life",
        "✔ Portable: Take your kit on the go! The storage case is light, compact, and travel-friendly"
    ],
    "description": "The Ohuhu 175 Piece Watch Repair Kit is a must for anyone who loves to accessorize. This kit includes everything you’ll need to fine-tune your timepiece and make other small repairs. Each kit includes 156 spring bars, 6 precision screwdrivers, 3 loupes, 2 watch back openers, 1 set of tweezers, 1 adjustable watch case opener, and 1 hammer with both a metal and plastic head. Each order also includes a bonus storage case! Toss in your tools, keep them organized, and bring them with you wherever you go. Life is better with Ohuhu! -Material: Plastic, aluminum alloy, copper, glass -Weight: 1.34lbs -Dimension: 230 x 180 x 50mm (9.0 x 7.0 x 2.0inch) -6 x Precision screwdrivers -1 x Hammer -1 x Metal head (for hammer) -1 x Plastic head -156 x spring bars - 1 x storage box for spring bars -1 x Tweezer -3 x Loupes -1 x Watch block -1 x Watch band link remover -2 x Watch back openers -1 x Adjustable watch case opener",
    "price": 1898.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 160.0,
        "length": 900.0,
        "width": 200.0,
        "height": 700.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51UdOV66WEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sDL0fiOHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41JD7AER%2BTL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51yKv--aE9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ow0N2fz7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41vjUHEnJ2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41G2n0D5knL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7586146011",
            "title": "Shoe, Jewelry & Watch Accessories"
        },
        {
            "node": "9616099011",
            "title": "Watch Accessories"
        },
        {
            "node": "378531011",
            "title": "Repair Tools & Kits"
        }
    ],
    "similar": [
        "B00D6608IE",
        "B0796MRTKW",
        "B076K2925G",
        "B003UCODIA",
        "B07CBJGKYZ",
        "B0714DJYLQ",
        "B07C75RFG4",
        "B078NVCSLS",
        "B078MKFHMZ",
        "B079L6316T",
        "B075LM4332",
        "B0753C7Z9T",
        "B00PVN1DC0",
        "B01DU47EEM",
        "B00VBYZU5E",
        "B07BRHFWF2",
        "B075BKF7QK",
        "B07C5N3VFW",
        "B07G532RBV",
        "B073PW85HS",
        "B074MHQR6M"
    ],
    "rating": "4.0"
}