{
    "asin": "B018FYNPK4",
    "title": "Cutelook TM 12v Universal Motorcycle Motorbike Scooter Compact Security Alarm System Remote Control Engine Start for Suzuki Honda Yamaha Kawasaki, Harley Davidson and all Other Motorcycles",
    "brand": "Cutelook",
    "feature": [
        "This is new Motorcycle Anti-theft Alarm device, which is specially designed for your Motorcycle and protects it from steal of the thieves. This Anti-theft Alarm device is characterized by a sensitive motion sensor, a 4 buttons remote controller and automatic remote engine start.And, it will call for help in emergency to warn its owner and has two ways of warning such as, flashing light warning, 125db powerful siren",
        "With compact portable design; Work with any motorcycle with 12 Volt batteries; This electronic Anti-theft Alarm with remote controller can let your motorbike keep away from thieves",
        "Automatic remote engine start; Adjustable Shock Sensor; Remote Arming/Disarming (Flashing lights warning/125db powerful siren warning",
        "Compatible Modes: Suzuki, Honda, Yamaha, Kawasaki, Harley Davidson and all Other Motorcycles",
        "Call for help in Emergency; Emergency alarm: Anti-Hijacking by Cutting off Power Supply; 4 Buttons remote transmitters; Smart alarm can automatically recognizes vibration frequency"
    ],
    "description": "Specification: - Color: Black (The cables are colorful) - Size: The high power siren device: 6.0 x 4.9 x 2.6cm. The Brain Module System Built-in Shock Sensor: 6.4 x 6.0 x 1.8cm - Package weight: 9.8oz/279g - Compatible Modes: Suzuki, Honda, Yamaha, Kawasaki, Harley Davidson and all Other Motorcycles Installing way: Red wire: connects the anode of the storage battery Black wire: connect the cathode of the storage battery (Ground) Two Yellow wires: separately connect them with the Left/Right turn lights control line (generally, baby blue and orange) Pink wire and Gray wire control the flameout of motorcycle. You can cut off the original flameout cable of motorcycle; connect the Pink wire to the top of the original flameout cable and the Gray wire to the bottom of the original flameout cable. Orange wire is connected to the anode cable of the electric door or the anode cable of brake switch. Blue wire is forward start cable which is generally connected to the yellowish red wire of starting relay. Note: This kind of wiring way is generally suitable for the motorcycle with AC ignition. The different motorcycle has different ignition mode and the wiring way is possibly different.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 105.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41SkrUMYEzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31dfUDmqBnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qOobbusiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41g6bzkmzAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41gvHLsX5fL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41cJ-O6w1IL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X%2BifX5h3L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "524136",
            "title": "Security & Surveillance"
        },
        {
            "node": "14241131",
            "title": "Security Sensors"
        }
    ],
    "similar": [
        "B010AGHUMO",
        "B01F4PYHRW",
        "B01HTGWYBA",
        "B078B7LBSG",
        "B00PAT27P2",
        "B01C4UY0JK",
        "B00OTZWJE2",
        "B06XCZCRCM",
        "B07F74C7B3",
        "B06XCM9LJ4",
        "B01M0GFGRD",
        "B01IVIMR7Q",
        "B073LD3TLH",
        "B077GW7QWY",
        "B01MRFZJT7",
        "B0753LC2DQ",
        "B00UD36JZE",
        "B0734QN8KR",
        "B07425TPBT",
        "B00PAT287E"
    ],
    "rating": "2.4"
}