{
    "asin": "B018HJMYSQ",
    "title": "bmbu 300g Bamboo Charcoal Car Deodorizer/Car Freshener Bag - Remove Air Odor, Control Moisture & Purifier your Car, Closet, Bathroom, Kitchen, Litter Box - Non-Fragrant Alternative to Sprays",
    "brand": "bmbu",
    "feature": [
        "✓ PREMIUM QUALITY Bamboo Charcoal Home & Car Freshener Bags 300g. Enclosed in Airtight Sealed Eco-Friendly Packaging (to retain carbon activation before you receive them)",
        "✓ EFFECTIVE ODOR NEUTRALIZER : Removes Odors and Moisture by Filtering Odors, Bacteria & Allergens - eliminating them at the source, all without adding harmful chemicals to your air.",
        "✓ MULTI-USE DEODORIZER : Use Our Special Rope Attachment to Hang in Your Automobile as a Car Freshener - Car / Truck / Van, Bathroom, Closet, Pantry, Kitchen, Locker, Cabinets, Refrigerator / Freezer, Changing Room, Sports Bag, Litter Box, Bird or Pet Cage, Luggage, Storage Box / Bins, Smoking Ashtray and in or near anything else that smells bag or has excess moisture!",
        "✓ NON TOXIC + NON FRAGRANT + CHEMICAL FREE : Safe to Use around Your Kids and Pets + No more headaches! Freshen air by removing odors, not merely masking them with foul smelling chemicals.",
        "✓ LONG LASTING : Use for over a year and recharge effectiveness by placing in direct sunlight"
    ],
    "description": "Does Your Car Stink? How about your Closet, Pantry, or Storage Room? Our carbon activated bamboo air purifiers cleanse air and remove odors by filtering and trapping smells, bacteria, mold, mildew, and any other bad things floating around. The carbon in our bamboo charcoal works it magic by binding to and trapping foul air. The magic lies in the high grade carbon activated bamboo charcoal. Every one of our air purifying bags comes packed with 300 grams of activated carbon charcoal -- a filtering agent similar to carbon water filters but for open air. Other 200g bamboo charcoal air purifiers are the same price as our 300g air purifying bags. We provide 300 gram air purifiers at a price much better than others offer. Great for use in car, SUV, truck, pantry, closet, storage, utility room, under your sink, bathroom, gym bags, yoga bags/ totes, diaper pails, hockey bag / gear, sports equipment, travel suitcases, storage containers, coolers, near garbages, litter boxes, locker, and many other places! Are you tired of masking foul smells with even fouler smelling chemical air fresheners? Does anyone actually like the smell of those things? Our bamboo charcoal air purifier cleans air by trapping, filtering, and eliminating smells and smell causing bacteria / moisture.",
    "price": 899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 60.0,
        "length": 200.0,
        "width": 600.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/514BOG21p-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51x1pYvOKxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/510uxjABDDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51isDEuqCzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qFAeWvxFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ei0S54mCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BH7VoAHJL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Package Quantity:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "15684181",
            "title": "Automotive"
        },
        {
            "node": "15857501",
            "title": "Interior Accessories"
        },
        {
            "node": "15735121",
            "title": "Air Fresheners"
        }
    ],
    "similar": [
        "B078XR36WN",
        "B01D3TQHUQ",
        "B004BOH6BM",
        "B00JL5DGHY",
        "B002J7VX4Y",
        "B01LVV5JGP",
        "B01M9EFTUD",
        "B01N8S735Y",
        "B00RD982MO",
        "B008XNZZ7O",
        "B012CDEMFG",
        "B00G49DVGG",
        "B07CRB51XD",
        "B06Y5LXR9V",
        "B019NXUJ5K",
        "B01E9IZOR2",
        "B00FVXL7EO",
        "B01N7NHVZK",
        "B018R68O74",
        "B07919M314"
    ],
    "rating": "4.0"
}