{
    "asin": "B019BIBVWC",
    "title": "Mini iROLLER: Reusable Liquid Free Touchscreen Cleaner for Smartphones and Tablets - Immediately Sanitizes - Easy to Use and Incredibly Effective on Any Touch Screen (Mini)",
    "brand": "SKT Productions",
    "feature": [
        "WITH A FEW QUICK ROLLS IT INSTANTLY REMOVES fingerprints, smudges, germs and smears from touch screens on your phone or tablet better than any microfiber cloth can!",
        "OFFERS A SANITIZING CLEANSE quickly removing bacteria and sanitizes your iPhone, iPad, cell phone, mac, tablet, or laptop touchscreen.",
        "PORTABLE AND CONVENIENT measuring only 3.5 inches for the Original and 3 inches for the Mini, you can stick it in a purse or pocket and easily do a quick touch-up while on the go.",
        "SAVE MONEY on disposable wipes, microfiber cloths, and sprays, simply occasionally rinse the iRoller under water and you will have countless uses, saving you time and money! BETTER than Microfiber Cloths!",
        "COMPLETELY LIQUID-FREE in contrast to many liquid sprays which can easily damage your devices! The Mini iRoller features advanced materials and is completely safe to use on anything!"
    ],
    "description": "This liquid free patented design touch screen cleaner is perfect for small devices. If you have smudges or dirt on your iPhone, Tablet, Samsung Phone, Cell Phone, Smart Phone, and eyeglasses you need a Mini iRoller. The mini iRoller provides a more compact size that is perfect for your pocket. Get rid of all those microfiber cloths that suck up dirt and eventually wear out. The Mini iRoller is your one stop touch screen solution. It will clean your touchscreen the safe, effective, and reusable way. To remove any attached dried out touchscreen stains, massage them with your finger tip into an oily smudge. Then its easy to remove the smudge with the Mini iRoller. If the roller surface becomes blunted with debris wash under warm water with a liquid soap detergent, rinse off and stand it upright to dry and its tackiness will return refreshed. It can be used countless times and does not have to be washed after every use.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 300.0,
        "width": 100.0,
        "height": 100.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/418mSNwYxsL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41duEHg%2BTjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/413GXZRkdWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51t%2Bjt4PhFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418jCyoC3lL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41qBAR9k0qL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41k60SwEj5L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Style:",
            "value": "Mini 3\""
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172532",
            "title": "Audio & Video Accessories"
        }
    ],
    "similar": [
        "B01GKIO0LK",
        "B01FXJZ9QC",
        "B00VULYGD0",
        "B07BY7L9D3",
        "B01054S5FM",
        "B07DPWL598",
        "B06XCM9LJ4",
        "B01BO03TRA",
        "B00740H87C",
        "B0774S56RN",
        "B074512LY1",
        "B01DPVB12G",
        "B01M6ZZ0GM",
        "B002SBB0SU",
        "B017UJ7RXG",
        "B07DQ8FJSL",
        "B00U21WCHG",
        "B074DQYFK7",
        "B07BVZ4TN7",
        "B00U21WD4S",
        "B00F9X34XS",
        "B01LWQ63NZ",
        "B00BX1AOVA",
        "B01DK13VZ6",
        "B01DFKC2SO",
        "B06XBQQC8D",
        "B072FQHM3J"
    ],
    "rating": "4.1"
}