{
    "asin": "B019FYL7L2",
    "title": "Beard Brush & Comb Set for Men Care - Gift Box & Friendly Bag - Best Bamboo Grooming Kit for Home & Travel - Great for Dry or Wet Beards - Distributes Balm for Growth & Styling - Adds Shine & Softness",
    "brand": "Grow A Beard",
    "feature": null,
    "description": "The Grow A Beard Set, Have The Highest Reputation For Polishing And Maintaining All Kind Of Beards, That Are Able To Hold Moisture, Lift Away The Dust, And Distribute The Natural Oil To All Your Beard. The Military Style Set Has Bristles That Are Designed To Penetrate Your Normal, Fine Or Damaged Beard, And Helps To Reduce Static. Bamboo Is Farmed vs Wood That Comes From Cutting Forests, Damaging To The Environment. Bamboo Grows Naturally Without Using Any Pesticides Or Fertilizers And Is 100% Biodegradable. Two Piece Pocket And Palm Size Beard Brush And Comb With Only One Purchase. Perfect For All Size And All Beard Style, That Allow You to Keep Your Beard In Control. Designed For Sophisticated And Confident Beard Men. It Was Created To Last Forever, So You Only Have To Purchase One Time, Saving Valuable Resources From Both The Earth And Your Wallet. We're Passionate About Providing The Highest Quality Set, While Still Being Economically Reasonable, So That Everyone Can Enjoy The Best Beard Set Ever. Go Ahead And Compare Our Beard Kit With Any Other On The Market. The Grow A Beard Set Are Going Fast At This Price, So Click the \"\" To Enjoy Your New Premium And Friendly Beard Set Now. If For Whatever Reason, You Don't Absolutely Love Your Beard Set, Just Return It, And We'll Refund Every Penny. And Please Remember... Being Weak Is A Choice So Grow A Beard.",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 28.125,
        "length": 430.0,
        "width": 140.0,
        "height": 220.00000000000003
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51gdSVtRuHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51F4DMmzirL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/81i1KgRNo1L._SS40_PKmb-play-button-overlay-thumb_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "3778591",
            "title": "Shave & Hair Removal"
        },
        {
            "node": "13271079011",
            "title": "Men's"
        },
        {
            "node": "13271118011",
            "title": "Beard & Mustache Care"
        },
        {
            "node": "7655032011",
            "title": "Beard & Mustache Combs"
        }
    ],
    "similar": [
        "B0787JNN97",
        "B01DPY4HU6",
        "B00THGRPA6",
        "B07BMDQWZ3",
        "B07D99GV2Y",
        "B06W9MZYFB",
        "B0796PQ636",
        "B00QXIK13O",
        "B07C6XKMRQ",
        "B019CFQORQ",
        "B00M49SG0Q",
        "B073FF88W4",
        "B07CVX2RQB",
        "B078N1DBY9",
        "B01E6CI9I2",
        "B00HBSC3JA",
        "B00THGUN4G",
        "B00IB6IAOS",
        "B06XD86WNT",
        "B01LPT25A2",
        "B07DTZFB3X",
        "B071RTF9HN",
        "B00Q5JHGVQ",
        "B06X3ZL2CV",
        "B009NNFB0O",
        "B07B53Q3BX",
        "B0753JJZM3",
        "B01AYMHBLY",
        "B07CNTYFMF"
    ],
    "rating": "4.4"
}