{
    "asin": "B01BTTVKXG",
    "title": "Fossil Q Marshal Gen 2 Stainless Steel Touchscreen Smartwatch FTW2109",
    "brand": null,
    "feature": [
        "Stay connected with display notifications and touchscreen functionality for texts, calls, emails, and app updates. Wear OS by Google connects your watch and smartphone using Bluetooth technology, so you can stay on top of what’s happening in your world.",
        "With built-in activity tracking, you can track your everyday accomplishments including steps, distance, and calories burned. Automatically syncs to your phone so you can keep tabs on your activity and notifications without ever pushing a button.",
        "Customize the face of your smartwatch anytime you want. Choose a Fossil or Wear OS by Google design, adjust the colors, and assign your favorite apps to the dial. Fit your style with interchangeable straps - compatible with all Fossil brand 22m straps.",
        "Effortlessly charge your Fossil Q by placing it on the inductive charging magnet (included). This wearable has an estimated 24-hour battery life, based on usage.",
        "Powered with Wear OS by Google, a trademark of Google LLC. Your wearable is compatible with Android and iOS smartphones, specifically with Android OS 4.4+ (excluding Go) or iOS 9.3+. All devices have Bluetooth(R) 4.1 Low Energy and Wi-Fi 802.11 b/g/n."
    ],
    "description": "Q Marshal is our everyday digital display watch that connects seamlessly to your phone. Styled in stainless steel, the tech-savvy dial with touchscreen functionality includes the all-new Wear OS by Google's interactive dials (for info at a glance), user-friendly messaging, customizable watch faces and automatic activity tracking. Smartwatches built with Wear OS by Google are compatible with iPhone and Android phones. Wear OS by Google and other related marks are trademarks of Google LLC. Touchscreen smartwatches built with Wear OS by Google require a phone running Android OS 4.4+ (excluding Go edition) or iOS 9.3+. Supported features may vary between platforms. Founded in 1984 when timepieces were created more for function than fashion, Fossil began to transform this notion with its unique combination of vintage 1950s Americana design and affordably accessible cool style. Adding to their collectability were the one-of-a-kind, trademark tins that came with the watches that mixed a creative spirit with a sense of humor. These iconic boxes are nearly as popular as the watches they hold and are regularly collected and traded throughout the world at flea markets, antique shops, and on eBay. Today, Fossil produces over 300 different styles of watches in a continuously changing lineup. While the majority of designs are created by in-house designers, Fossil has reached out to such contemporary artisans as product designer Philip Starck and famed architect Frank Gehry (designer of the Guggenheim Museum in Bilbao, Spain) to create uniquely modern timepieces. In addition to style innovations, Fossil has also helped introduce innovative technologies into watches, such as the Wrist PDA that ran the Palm operating system. Fossil also offers complementary lines of small leather goods, belts, handbags, sunglasses, jewelry and apparel.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 93.125,
        "length": 450.0,
        "width": 450.0,
        "height": 340.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51z04axiT2L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xBCyDFRQL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31uQqt0KssL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ZBBklLx4L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31ggMU%2BgOGL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        },
        {
            "node": "6358543011",
            "title": "Watches"
        },
        {
            "node": "14130291011",
            "title": "Smartwatches"
        }
    ],
    "similar": [
        "B01EUEIL3E",
        "B01BTTUPPA",
        "B07G14YLMH",
        "B01MSBGX7W",
        "B077TR54RF",
        "B014S8TZL4",
        "B0781ZPTKZ",
        "B01D4LI06W",
        "B074G2DH94",
        "B0757FSYVN",
        "B07657P1FN",
        "B01D99TVDA",
        "B01BTTUC2Q",
        "B075T1VV1N",
        "B07CPTW827",
        "B01MRPR5VZ",
        "B07D148MDG",
        "B0722W9QC3",
        "B06XS9LKTK",
        "B07C6S96NN",
        "product-description",
        "B01BTTUCSK",
        "B074QNMS1J",
        "B07C6S92B8",
        "B077TXG824",
        "B074G3F54X",
        "B01MSPIQ43",
        "B075N7V2RT",
        "B01LX6D574",
        "B076HQPDRF",
        "B01MDJWCRR",
        "B01NA6F40Y",
        "B076HQ133W",
        "B0781VNB9L"
    ],
    "rating": "3.4"
}