{
    "asin": "B01B12KCGC",
    "title": "100% Organic Blend of Olive, Lavender, Almond and Grapeseed oils with Vitamin E. Daily Moisturizer for Skin, Hair, Face, Cuticle, Nail, Scalp, Foot. Pure Cold Pressed, Full Body oil for Men and Women",
    "brand": "Bliss of Greece",
    "feature": null,
    "description": "Ancient Greek Remedy Oil is made of 100% PURE Blend of Organic Sweet Almond, Cold pressed Olive, Lavender and Grapeseed oil with Vitamin E, VEGAN, GLUTEN and GMO FREE. Multi purpose moisturizer packed with hair skin and nails vitamins, promotes natural health and beauty solutions which are superior than any single oil. each one from the 4 magical oils is a source of unique Vitamins and antioxidants that together create the ultimate solution all for your health needs.OLIVE OIL is full with anti aging vitamins and hydrating squalene, making it superb to use as firming body oil for smooth and even skin tone. reduces facial dark spots, promotes healthy soft and beautiful hair, help thickening thin hair, good for wavy, curly, straight & afro hair.LAVENDER Oil is one of the most well known essential oils in aromatherapy, benefits include its ability to Reduce anxiety and stress, migraine and headache relief, improves sleep apnea, prevent pregnancy stretch marks, Stop chronic scalp itch and cure dandruff, Effective treatment for skin discoloration, Acne scars, rosacea, eczema, psoriasis, alopecia, seborrheic and atopic dermatitis.ALMOND OIL is rich in hair and Skin care Vitamins includes, monounsaturated fatty acids, proteins, potassium and zinc, which explains why its a favorite massage oil and great for firm skin, optimal for treating hair loss and damaged hair, best natural toenail and cuticle Softener.GRAPESEED OIL due to their nutritional and medicinal properties grapes been used in many home remedies for centuries. GrapeSeed Oil provides lasting moisture for rough hands, feet and cracked heels, tighten loose skin, frizzy hair and healing flaky scalp.Safe for Adults, Toddler, baby and kidsBuy Now with complete confidence and experience ANCIENT GREEK REMEDY OIL to its fullest",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 65.0,
        "length": 200.0,
        "width": 200.0,
        "height": 500.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/516WGeOmL6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51KGGnGG2TL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41l3Io0eH8L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41FLV839ENL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vwYfik20L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11060521",
            "title": "Body"
        },
        {
            "node": "11060661",
            "title": "Moisturizers"
        },
        {
            "node": "11060691",
            "title": "Oils"
        }
    ],
    "similar": [
        "B00GMAWI66",
        "B07889FPS5",
        "B00IEDYZS8",
        "B0776G1Z9R",
        "B07G48WF34",
        "B00WFAGPL6",
        "B00O0IFOKE",
        "B073VZ6X4M",
        "B0084H2KLI",
        "B00ZPO05TW",
        "B014Q9656I",
        "B01MYVF3B3",
        "B01258AK8Q",
        "B00O0IFSKK",
        "B0186U9736",
        "B00I32AN4K",
        "B00HRAXUH6",
        "B00GJX58PE",
        "B06Y4VS5KD",
        "B00QZ144JG",
        "B00NQ7TJMY",
        "B00FKNC2WG",
        "B01FMP7D1Q",
        "B00FH692PQ",
        "B011QHFB4A",
        "B01BKVCSTS",
        "B00V7DXECA"
    ],
    "rating": "4.7"
}