{
    "asin": "B01B6L70EK",
    "title": null,
    "brand": "Access Denied",
    "feature": [
        "100% Genuine Leather",
        "PREMIUM QUALITY: This credit card holder is made with high quality genuine full grain leather that is extremely soft and durable. Its smooth texture makes for an elegant slim wallet, perfect for every day use. This wallet is made with high fashion and design style in mind for you to look like the best gentleman wherever you are. Whether you are on a night out with some friends, a social event, wedding, or party this wallet is made to compliment you when it matters most.",
        "SUPER SLIM AND MINIMALIST: This extra small mens wallet is only 1/8 inch thick and measures only 4.3 inches x 2.75 inches. Yet, it is very convenient with its 3 credit card slots, 1 ID Window in the back and 1 center pocket for cash or an additional card. You can squeeze 2 cards in one of the three card slots if necessary. Such a minimalist wallet will easily fit in any front pocket, back pocket, or vest pocket. We tried to create one of the slimmest and minimal wallets for a true minimalist.",
        "100% Genuine Leather",
        "PREMIUM QUALITY: This credit card holder is made with high quality genuine full grain leather that is extremely soft and durable. Its smooth texture makes for an elegant slim wallet, perfect for every day use. This wallet is made with high fashion and design style in mind for you to look like the best gentleman wherever you are. Whether you are on a night out with some friends, a social event, wedding, or party this wallet is made to compliment you when it matters most.",
        "SUPER SLIM AND MINIMALIST: This extra small mens wallet is only 1/8 inch thick and measures only 4.3 inches x 2.75 inches. Yet, it is very convenient with its 3 credit card slots, 1 ID Window in the back and 1 center pocket for cash or an additional card. You can squeeze 2 cards in one of the three card slots if necessary. Such a minimalist wallet will easily fit in any front pocket, back pocket, or vest pocket. We tried to create one of the slimmest and minimal wallets for a true minimalist.",
        "PROTECT YOUR IDENTITY AND DATA: This RFID wallet complies with the FIPS-201 specifications and is guaranteed to protect your identity and data from being stolen. All our wallets for men and women have been tested to block High Frequencies RFID signals (13.56 MHz) in which credit cards, debit cards, driver licenses and passports operate. Please note that most id badges, access cards and hotel room cards operate at a much lower frequency (120-150 KHz) and may not be blocked by this wallet.",
        "PERFECT GIFT: This credit card wallet comes in a gift box perfect for any special occasion such as a Birthdays, Anniversaries, Christmas, Father's Day, Groomsmen's Gifts for Weddings, Valentine's Day…",
        "1 YEAR WARRANTY: Our warranty covers any defect caused during production and delivery. We will offer you a full refund or replacement if you are not 100% satisfied."
    ],
    "description": null,
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 440.00000000000006,
        "width": 20.0,
        "height": 320.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01M3UNQ2Y",
        "B0773JZJQB",
        "B079R2G9WM",
        "B0057AP0WG",
        "B07DGXY1PQ",
        "B07F8YFZ3V",
        "B00HC65NC0",
        "B010RXSU06",
        "B005NWK4WY",
        "B072MPFCR8",
        "B06XD318QF",
        "B07873Q1JN",
        "B01G0X56YU"
    ],
    "rating": null
}