{
    "asin": "B01BPFDTDS",
    "title": "Skullcandy Uproar Bluetooth Wireless On-Ear Headphones with Built-in Microphone and Remote, 10-Hour Rechargeable Battery, Soft Synthetic Leather Ear Pillows for Comfort, Royal Blue",
    "brand": "Skullcandy",
    "feature": [
        "EASY ON THE EARS: The synthetic leather ear pillows are so soft that you might forget you're wearing them. Low-profile and lightweight design makes it easy to wear these headphones all day.",
        "LONG LASTING BATTERY: Enjoy the comfort and sound of your headphones for a full 10 hours, without having to worry about recharging. Carefree listening is yours wherever you choose to take your soundtrack.",
        "ONBOARD MIC AND REMOTE: Take calls and navigate your playlists with the built in microphone and easy-to-access buttons on the ear cup. Use the plus and minus buttons to adjust volume, change songs and hit the circle button to answer and end calls or play and pause the music.",
        "BLUEOOTH WIRELESS: Whether you're walking down the street or gaming on the couch, Bluetooth functionality makes it possible to take your audio anywhere you go.",
        "Take calls and manage your music using the built-in TapTech mic + remote"
    ],
    "description": "Skullcandy's Uproar Wireless on-ear headphones deliver all-day comfort and convenience for an incredible price. Bluetooth functionality means you can take your playlist wherever you go and experience 10 hours of non-stop play while the plush synthetic leather ear pillows keep you comfortable the whole way through. Use the built-in microphone and remote to take calls and manage your device directly from the ear cup. Finally, the Uproar Wireless comes with a one-year manufacturer warranty so you can be both cord and worry-free.",
    "price": 3997.0,
    "listPrice": 4999.0,
    "prime": true,
    "dimensions": {
        "weight": 61.875,
        "length": 730.0,
        "width": 310.0,
        "height": 730.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41KzBmuuCHL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097480011",
            "title": "On-Ear Headphones"
        }
    ],
    "similar": [
        "B013IKWU7Y",
        "B00BTL70KW",
        "B013J7JM4K",
        "B00YZT4RL0",
        "B00TS1AZRK",
        "B07518KZ17",
        "B075NRNZWD",
        "B00U57K7JC",
        "B01KVD1NYM",
        "B01BPFGMZK",
        "B01EF5DBTC",
        "B078HQ5QQJ",
        "B078XZX9MD",
        "B00WGM39QM",
        "B07GNWN26F",
        "B07C89GX7Z",
        "B0719HCN9M",
        "B013UQN7JG",
        "B00SA1IAWG",
        "B00WGM835E",
        "B00TS1B8XK",
        "B01N9EU76H",
        "B00NCSIN4W",
        "B01BPFGAG6",
        "B01BPF49RI",
        "B07585JXNZ",
        "B0013RKHJI",
        "B00WGMRD2S",
        "B00S2P0M1C",
        "B00N771OEE",
        "B01BPF3LK4",
        "B018UYHBJA",
        "B01L160DLW",
        "B01JVXWNCO",
        "B00JL1C95I",
        "B01IEHIMLY",
        "B077YG22Y9",
        "B00TS1B91G",
        "B074PYS1JK",
        "B01MA1MJ6H",
        "B01824UV0E",
        "B01BPFHT70",
        "B06XWZYY21",
        "B01JOFCM8Y"
    ],
    "rating": "4.2"
}