{
    "asin": "B01B1WZWN0",
    "title": null,
    "brand": "Sunergetic",
    "feature": [
        "POWERFUL KIDNEY CLEANSE SUPPLEMENT: Your kidneys are important organs that require key nutrients to operate optimally and stay healthy. Our Kidney Supplement has ingredients that have shown to help support kidney health and urinary tract health. Give your kidneys the support they need with our kidney formula.",
        "ADVANCED KIDNEY & URINARY TRACT SUPPORT: We combine powerful herbs that have shown to help support kidney health. Our kidney health formula with Cranberry Extract, Astragalus root, Uva Ursi herb and Stinging Nettle have ingredients that have shown to help maintain a healthy kidney cleansing function.",
        "OVER 20 HERBS INCLUDING CRANBERRY EXTRACT: Our powerful kidney support formula provides your kidneys with an impressive array of herbs including Cranberry Extract, Java Tea, Uva Ursi Leaf, Astragalus, Juniper Berry, Nettle Leaf, Birch Leaf, Gravel Root, Horesetail Powder, Buchu Leaf, Goldenrod, Red Rasberry Fruit, Ginger Root, Rosemary Leaf and MORE!",
        "POWERFUL KIDNEY CLEANSE SUPPLEMENT: Your kidneys are important organs that require key nutrients to operate optimally and stay healthy. Our Kidney Supplement has ingredients that have shown to help support kidney health and urinary tract health. Give your kidneys the support they need with our kidney formula.",
        "ADVANCED KIDNEY & URINARY TRACT SUPPORT: We combine powerful herbs that have shown to help support kidney health. Our kidney health formula with Cranberry Extract, Astragalus root, Uva Ursi herb and Stinging Nettle have ingredients that have shown to help maintain a healthy kidney cleansing function.",
        "OVER 20 HERBS INCLUDING CRANBERRY EXTRACT: Our powerful kidney support formula provides your kidneys with an impressive array of herbs including Cranberry Extract, Java Tea, Uva Ursi Leaf, Astragalus, Juniper Berry, Nettle Leaf, Birch Leaf, Gravel Root, Horesetail Powder, Buchu Leaf, Goldenrod, Red Rasberry Fruit, Ginger Root, Rosemary Leaf and MORE!",
        "GMP CERTIFIED FACILITY: Our Kidney Cleanse Supplement is manufactured in an FDA registered facility that adheres to Good Manufacturing Practices (GMP). We are committed to maintaining high quality supplements.",
        "SATISFACTION GUARANTEED: We are so sure that you will love our Kidney Support supplement that we protect you with an unconditional 365 day money back guarantee at anytime. We believe 100% in our kidney health supplement which is why we can offer such a strong satisfaction guarantee on all of our supplements."
    ],
    "description": "Our mission: We strive to utilize the most current scientific research studies and information available to find the most effective solutions for anti-aging and improved health. We believe in using hi ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 200.0,
        "width": 200.0,
        "height": 409.99999999999994
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B0006IIE4U",
        "B01FVQHUDC",
        "B0776FL541",
        "info.html",
        "B072NGDNDG",
        "B00ISAPPLI",
        "B01BKUAS4Q",
        "B000N3BZIA"
    ],
    "rating": null
}