{
    "asin": "B01BMY4VN4",
    "title": null,
    "brand": "Dr. Frederick's Original",
    "feature": [
        "INCLUDES 2 FOREFOOT GELS - You've got two feet so we give you two gels to cover them both. Made of super stretchy gel material for superior cushioning.",
        "ELIMINATE PRESSURE POINTS - Each step you take concentrates your entire weight on a few pressure points on the bottom of your foot. Our gels help spread that pressure out and ease your pain.",
        "INSTANT SOOTHING - As if by magic, each step you take will make you wonder why you suffered with painful feet for so long. Stop suffering in silence!",
        "INCLUDES 2 FOREFOOT GELS - You've got two feet so we give you two gels to cover them both. Made of super stretchy gel material for superior cushioning.",
        "ELIMINATE PRESSURE POINTS - Each step you take concentrates your entire weight on a few pressure points on the bottom of your foot. Our gels help spread that pressure out and ease your pain.",
        "INSTANT SOOTHING - As if by magic, each step you take will make you wonder why you suffered with painful feet for so long. Stop suffering in silence!",
        "NOTE FROM HAPPY CUSTOMERS - If your gel cushions slip and bunch, try wearing snug fitting socks to help keep them in place. Our gels spread and stretch to cover even the widest of feet. No need to worry about your shoe size.",
        "GET BACK TO IT GUARANTEE: Your results are our top priority. It's part of who we are as physicians. So if your purchase doesn't help you get back to doing what you love, we'll find something that will or we'll give you your money back. That's our promise to help you Get Back to the Original You."
    ],
    "description": null,
    "price": 1399.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": 500.0,
        "width": 700.0,
        "height": 100.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B019VRBQTQ",
        "B074RLX2RF",
        "B077TDYVRL",
        "info.html",
        "B0716J6G8X",
        "B01NGU5BW9",
        "B07DGQHM86",
        "B01MRV5U4H",
        "B01K8QDNEK"
    ],
    "rating": null
}