{
    "asin": "B01BB8PZQI",
    "title": "Stuhrling Original Watches Mens “Specialty Grand Regatta” Stainless Steel Professional Swiss Quartz Dive Watch",
    "brand": "Stuhrling Original",
    "feature": [
        "watches Mens stainless steel watch with polished stainless steel round case & stainless steel screw down case back",
        "Matte finish deep sea blue dial watch and stainless steel unidirectional bezel with coin edge detailing",
        "Stainless steel watch bracelet with polished center links and brushed outer links and stainless steel push button deployant clasp with safety cover",
        "Protective and scratch resistant Krysterna Crystal, Stuhrling Original specialty Ronda 515 Swiss quartz movement",
        "Professional diver watch with screw down crown andwater resistant to 20 ATM 200 Meters/660 Feet suitable for professional marine activity and serious surface water sports."
    ],
    "description": "Classic styling and high performance add up to an outstanding mens stainless steel diver watches for your land or sea adventures. This mens stainless steel watch, from Stuhrling Original’s Specialty Grand Regatta series, places a large round stainless case on a robust brushed stainless steel watch bracelet with polished center links. The deep sea blue dial is designed for quick and easy read-off, even in low light conditions. It offers three-hand function and date display at the four o'clock position. The detailed hands add a note of distinction. The dial is capped with a resilient Krysterna Crystal and framed by a blue unidirectional rotating bezel with coin edge detailing. This watch is driven by a “Stuhrling Original Specialty” Ronda 515 Swiss quartz movement and is rated water resistant to a full 200 meters/660 feet. The Stuhrling Original Specialty Grand Regatta’s stylishly classic, internal workings are with forged variations of specialty Swiss chronograph or 21-jewel automatic movements and willingly navigate in depths up to 500 meters. Built with confident prowess, the fortitude with which these timepieces function makes the Specialty Grand Regatta’s diver watch the quintessential in performance. With dedication to the heritage of watchmaking, Stührling Original timepieces appeal to the most discriminating taste at reasonable prices. Through meticulous labor and rigorous testing, the vision of the Stührling Original timepiece is brought to life inside our workshops, where “Quality is never an accident; it is always the result of intelligent effort.”",
    "price": 6995.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 95.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51CD5rtlA6L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ukx33NNIL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51P83OppPKL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Uma8rCBeL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41t2Kplf4aL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tZuvBoG0L._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B00N0IO83O",
        "B01N6KIO7Z",
        "B007Z0BUY8",
        "B00YW0Q15C",
        "B06XS9NQPF",
        "B001E96DHA",
        "B06Y394PX5",
        "B06Y3L2SYX",
        "B000FVE3A2",
        "B01IW4SS7C",
        "B00N34WPBW",
        "B01KH6SPYY",
        "B01JO761KW",
        "B00P114M5W",
        "B0096IQZ9C",
        "B01FLLJ6IE",
        "B07C6CTST1",
        "B01NAMTZSZ",
        "B07657P1FN",
        "B071K779C5",
        "B007Z0BV2O",
        "B01GQTWL5U",
        "B072QXWKVZ",
        "B0096IQZ8S",
        "B072MZYZZK",
        "B002PAPT22",
        "B013R5MUD4",
        "B01J3NGFC6",
        "B002PJSYP2",
        "B0728525JG",
        "B01DPXDTMY"
    ],
    "rating": "4.1"
}