{
    "asin": "B01B5KB44O",
    "title": null,
    "brand": "Mozeat Lens",
    "feature": [
        "Universal 3 in 1 tiny clip-on detachable Camera Lens Kit for mobile phones. Portable Design with premium microfiber cleaning cloths & carrying bag. Multi Use. Suitable for Self-timer&Group photo,Sports,Travel,Party,Close-Up and Macro Photography.",
        "Professionally Engineered. The radius and depth of the lens was specially designed for Photography. Professional HD glass reduces glare and reflection. Clear Edge to Edge,No Distortion by the Macro and Wide Angle Lens,Minimal Dhromatic Aberration,No Dark Circle by the Fish eye Lens(4 element 3 group glass).",
        "Full Screen Fish-Eye for wide hemispherical image,without dark corners, but still enjoys a strong effect. Macro Lens for taking extreme close-up pictures of small objects. Wide-Angle Lens projects a substantially larger image circle than a standard lens of the same focal length.",
        "Universal 3 in 1 tiny clip-on detachable Camera Lens Kit for mobile phones. Portable Design with premium microfiber cleaning cloths & carrying bag. Multi Use. Suitable for Self-timer&Group photo,Sports,Travel,Party,Close-Up and Macro Photography.",
        "Professionally Engineered. The radius and depth of the lens was specially designed for Photography. Professional HD glass reduces glare and reflection. Clear Edge to Edge,No Distortion by the Macro and Wide Angle Lens,Minimal Dhromatic Aberration,No Dark Circle by the Fish eye Lens(4 element 3 group glass).",
        "Full Screen Fish-Eye for wide hemispherical image,without dark corners, but still enjoys a strong effect. Macro Lens for taking extreme close-up pictures of small objects. Wide-Angle Lens projects a substantially larger image circle than a standard lens of the same focal length.",
        "Soft Rubber detachable clamp design, work on most types of mobile phone that their camera lenses are not bigger than 13mm diameter. Suitable for most mobile phones, easy and convenient to operate. It can apply to iPhone, HTC, Samsung, smart phone, iPad, Tablet PC and Laptops or anywhere you can imagine.",
        "18-month Warranty Note:1.The optimal distance of taking pictures with the Macro lens is 0.4-1 inch. 2.The Macro lens and the Wide-angle lens are attached together upon receival. When you use the Macro lens, please detach the Wide-angle lens from the Macro lens.The Flash Light might be blocked when the lens is in use."
    ],
    "description": "Mozeat Lens, Professional HD Camera Lens Kit Let's start from here & Discover the beauty around. Turn your mobile into DSLR Camera easily. Fish-eye lens: look cool or silly with a fish-eye effect. Wid ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 310.0,
        "width": 110.00000000000001,
        "height": 370.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00HE04YJM",
        "B017K1IR7O",
        "B07BNNJZDN",
        "B01MATLO6Y",
        "B01A6D2JVI",
        "B0179JX8GC"
    ],
    "rating": null
}