{
    "asin": "B01B182976",
    "title": "USB Car Charger RAVPower 24W 4.8A Metal Dual Car Adapter, Compatible with iPhone iPhone X 8 7 6 Plus, Galaxy S9 S8 S7 S6 Edge Note 8, Nexus, LG, HTC and More (Black)",
    "brand": "RAVPower",
    "feature": [
        "Ultra Slim & Small: This compact aluminum alloy coated car charger (2.32 x 0.98 x 0.98 inches) packs a powerful punch with a combined 4.8A output",
        "Own a tablet and smartphone? Charge both at the same time with two 2.4A charging ports (Don't support Quick Charge Function)",
        "iSmart technology automatically adapts suitable input current for your devices and maximizes the charging speed",
        "Automatically adjusts the voltage received from the vehicle so your device always charges at a constant rate",
        "Extreme power requires protection: Sophisticated circuit design ensures devices are safe from over-heating, over-current and over-charging; Also You can get Lifetime Warranty (if register) and friendly customer service from us"
    ],
    "description": "Ideal for almost any vehicle, once connected to the cigarette lighter port, you can simultaneously power two devices - including two tablets - thanks to the combined 4.8A output. Featuring scratch-resistant coating, it will always look as new as the day you bought it. iSmart technology automatically detects and delivers the optimal charge; making it the fastest, most effective way to power any connected device. With two 2.4A iSmart ports, fast charging has never been easier. The battery input of 12-24V is standard across all cars; however there are times when it can exceed this standard. When you hit the ignition switch or when the car accelerates, the input can be anywhere from 8V to as high as 30V. No matter the voltage, the USB charger will automatically adjust to protect your device and charge at a steady rate. The car charger comes with a number of built-in protection methods to keep your device safe. The built-in over & under voltage, over-current, and over-temperature protections ensure your mobile phone and other device's safety needs are guaranteed. At RAVPower, we believe in our products. That's why we back them all with[Lifetime Warranty] if you register at our offical website and provide friendly, easy-to-reach support.",
    "price": 899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 229.99999999999997,
        "width": 70.0,
        "height": 70.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412bmAGBVBL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51JXy9gvPzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51iAoYmTZ3L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xUm33wc6L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41xLGjBdgoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51MsO6dR%2BYL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ZTtu1x0WL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407761011",
            "title": "Chargers & Power Adapters"
        },
        {
            "node": "2407770011",
            "title": "Car Chargers"
        }
    ],
    "similar": [
        "B01MTXZ3U8",
        "B07FQKBGBH",
        "B07GNHJN9H",
        "B07BRD8568",
        "B00ISGCAJM",
        "B01HH52Q5W",
        "B07CTHQBJQ",
        "B07BZFPZ3J",
        "B00VH84L5E",
        "B01N8W1EAE",
        "B073R68TSH",
        "B076BCHB82",
        "B01MD20Q1X",
        "B07B7GPTSP",
        "B075YHSVJW",
        "B076C4VLGR",
        "B01MCQWDQ8",
        "B00M6QODH2",
        "B075KJ57Q1",
        "B071FHZRQN",
        "B071SKHZX4",
        "B018E0I01I",
        "B013JMBAMC",
        "B07DXKXSNB",
        "B01MSL9XL0",
        "B00MH3USBE",
        "B01MY9ZGHH",
        "B07BKQPNHS",
        "B01LXJAR7I",
        "B00ZZFT6EQ",
        "B07477JMMY",
        "B0757LJ6X2",
        "B00OQ19QYA",
        "B017SARA9I",
        "B071WYF9HP",
        "B076Q8F57P",
        "B077PZF6VK",
        "B01LCFEQM4"
    ],
    "rating": "4.6"
}