{
    "asin": "B01CIZRZ7A",
    "title": "HTC One M10 Screen Protector (One 10,M10), Skinomi TechSkin Full Coverage Screen Protector for HTC One M10 Clear HD Anti-Bubble Film",
    "brand": "Skinomi",
    "feature": [
        "The Skinomi® TechSkin HTC One M10 Screen Protector is specifically designed to provide complete screen coverage; Material flexibility allows total coverage even on curved devices",
        "Self-Healing, flexible, tough, military-grade thermoplastic urethane, designed to absorb impact; The TechSkin is resistant against scratches, punctures, UV light and will not yellow",
        "Easy, error-proof, and anti-bubble installation; Liquid solution allows adjustments during installation; Significantly reduces dust, oil and fingerprint smudges",
        "Clear screen protector for HTC One M10 with smooth surface; A great alternative to a typical \"static cling\" protectors",
        "Made in the USA and comes with the Skinomi Lifetime Replacement Warranty from Manufacturer"
    ],
    "description": "Daily use of your mobile device can cause unsightly scratches, dents, and other unwanted damage. Within a few months, the screen will be difficult to read; the device will decrease in resale value and be embarrassing to show other people. Lower-quality disposable screen protectors seem like a temporary solution for keeping your device looking brand new; though they need constant replacements.With this problem in mind the founders of Skinomi® set out to create a screen protector that's tough, reliable, and long-lasting. Their solution was the Skinomi® TechSkin.Made of a thermoplastic urethane film that is designed to resist abrasion, the TechSkin HTC One M10 Screen Protector provides impact absorbing military-grade protection for your device. The screen protector is UV resistant, HD Clear, and goes on invisible. A smooth texture and feel makes it easy to navigate your device as if there was nothing applied. The flexible high-grade film is formulated to be which makes it able to stretch, absorb, and even repair scratches and impact damage.We're so confident that you'll love the TechSkin that every Screen Protector comes with a . If the Skinomi® TechSkin wears off, we will replace it. The installation process is easy, error-proof, and bubble-free. Protect your possessions and never worry about having to replace that old screen protector again.",
    "price": 785.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 710.0,
        "width": 430.0,
        "height": 110.00000000000001
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51WoMBsGLwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51evPSP4PVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51uIeXAr9KL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2BaoVKZFaL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51orlm6vAoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/510NQsLnr5L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407781011",
            "title": "Screen Protectors"
        }
    ],
    "similar": [
        "B01DCR1ZR4",
        "B0777K25JM",
        "B01IQGWHGE",
        "B01CSDAB0K",
        "B00LBK7OSY",
        "B0759SK8ND",
        "B01HBT2LUY",
        "B073X5CQJH",
        "B0713WH1Y9",
        "B01FL4AYUK",
        "B07BKXKT1M",
        "B01CIZOI3E",
        "B073WWVN77",
        "B019S6X6VQ",
        "B01DB6SR8Q",
        "B06XH5VZXF",
        "B077BVXNNK",
        "B01DAN1T4E",
        "B01ILZH8RI",
        "B01EKM7VUK",
        "B00CRBA9D8",
        "B01ILZH96I",
        "B01BG2B8I8",
        "B07DBT8MW1",
        "B01DCTC0M6"
    ],
    "rating": "3.4"
}