{
    "asin": "B01CW4BG4K",
    "title": "YI Dome Camera Pan/Tilt/Zoom Wireless IP Indoor Security Surveillance System 720p HD Night Vision, Motion Tracker, Auto-Cruise, Remote Monitor with iOS",
    "brand": "YI",
    "feature": [
        "720p High-definition, 112° wide-angle advanced glass lens combined with 345° horizontal & 115° vertical rotation range create a complete 360° coverage. Advanced night vision with 8 built-in 940nm infrared LED beads extend the viewing distance to 3 meters in pitch dark with no light pollution, so your baby or pet will not be disturbed by LED glare.",
        "Responsive and advanced microphone with a built-in anti-noise filter for a clear 2-way Audio experience. Intercom Mode: one party to talk and listen at a time or Hands-free Mode: both parties talk and listen freely for maximum flexibility.",
        "Receive real-time Activity Alerts while you're out. 10-sec motion tracking records and centers the moving object. Bookmark your favorite positions (up to 8) and return to them at the tap of a button. Select Auto-Cruise to survey the area 360° horizontally or cruise your bookmarks, suitable for large areas that need a quick scan (and tracks moving objects).",
        "YI Dome integrates with your YI Home family in one simple interface. User-friendly and intuitive app to customize your settings: activity alerts, auto-cruise, bookmarks, camera sharing, customize schedules, and more. Supports connectivity to a large number of devices with the same app/account for maximum convenience. Available for iOS and Android.",
        "Supports YI Cloud to avoid the risk of losing footage from an SD card, ensure all your videos are safe, secure and protected. We provide the most efficient compression and the highest protection of data, so you can be sure that your footage is safe and secure. Reliable Wi-Fi connectivity to access your camera with YI Home App on mobile device, and YI Home App on PC at anytime, anywhere. Built-in support for 802.11b/g/n 2.4Ghz (5Ghz currently not supported) Wi-Fi band.",
        "Note: the firmware version must match your camera version. You can flash a Chinese version camera with any other version of firmware and power-on it, but it can never be paired."
    ],
    "description": "YI Dome Camera is your 360° complete coverage smart home system. With YI you are in touch with your home wherever you are. Bidirectional rotation supports a 345° horizontal rotation range, and 115° vertical rotation range. With a 112° wide-angle lens, YI Dome Cam captures the full scene with practically zero blindspots. Automatically returns to “Auto-masking” mode for extra sense of security ensuring no recording without your permission. Store up to 8 positions as bookmarks and easily return to them at a touch of a button. Choose to auto-cruise horizontally 360° or make pit stops at your selected bookmarks. YI Dome Camera keeps you connected with your family always. Check-in with your family through 2-way audio by connecting to live video. Take quick snapshots and easily record videos. With a 360° viewing angle, every spot is covered. Enhanced night vision stays awake while you sleep: With 8 Built-In 940nm (non-invasive) infrared LEDs, YI Dome Cam Night Vision can shoot in the dark for a range up to 3 meters Monitor your home with YI Home App. View YI Dome Camera along with your other YI Home Camera family in one integrated app. Our Motion Detection Algorithm is YI Dome Cam's safety hallmark. Movements can be accurately picked up and activity alerts are immediately sent to the App. 10 seconds smart motion tracking keeps up with everything, so you don’t have to. Quick and versatile installation. Place YI where it suits you best: Vertical, Wall Mount or Ceiling. Simple and Flexible Storage Options: Local and Cloud (to be available soon) 1 x YI Dome Camera 1 x Adaptor 1 x USB Cable 1 x Base Tray 2 x Screw 1 x Manual",
    "price": 3799.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 95.0,
        "length": 250.0,
        "width": 430.0,
        "height": 370.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41YBQG2PpQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ZqzTEXVnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Bu7%2BlcrBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ZjYvK0m2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51J3uTUBQFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517aK%2BKqCWL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "7161091011",
            "title": "Video Surveillance"
        },
        {
            "node": "898400",
            "title": "Surveillance Cameras"
        },
        {
            "node": "14241151",
            "title": "Dome Cameras"
        }
    ],
    "similar": [
        "B071KDMT6T",
        "B01MG9EL4A",
        "B01M4FOTEC",
        "B076LKFSVX",
        "B0758L64L9",
        "B076H3SRXG",
        "B06XWN9Q99",
        "B076BNBRKR",
        "B075K89NTR",
        "B075P84FH2",
        "B0799SQB2K",
        "B071KD4FZ2",
        "B0722TLLP4",
        "B016F3M7OM",
        "B078J2MH5X",
        "B0743G1Q44",
        "B016LJMRCW",
        "B07C86CT4S",
        "B01MDIYVI9",
        "B07F65PTCH",
        "B078NRNGGP",
        "B01CW4BN5M",
        "B076BL7JVS",
        "B0787QH8GZ",
        "B01CW4AR9K",
        "B0776ZCMMR",
        "B0727XJQLD",
        "B076LJRM88",
        "B01M7MYCQ1",
        "B07BVSXZ8F",
        "B01MF6A7EO",
        "B01CXDPQ64",
        "B075P84FH9",
        "B01CW4CEMS",
        "B071YPNMN1",
        "B01C4UY0JK",
        "B01CW49AGG",
        "B078J389LZ",
        "B01CW4BLG8"
    ],
    "rating": "4.0"
}