{
    "asin": "B01CX26IHQ",
    "title": "3D Fitness Tracker & Real Time Audio Coach, Moov Now:Swimming Running Water Resistant Activity Calories Tracker with Sleep Monitor, Bluetooth Smart Wristband for Android and iOS, Blizzard White",
    "brand": "Moov",
    "feature": [
        "MOOV NOW provides real-time audio coaching for running, cycling, cardio boxing, body weight (Moov 7 Minute+)",
        "Most advanced swim tracker - stroke type, stroke count, lap analysis, recommends ways to improve",
        "Tracks Active Minutes and Sleep",
        "A wearable fitness coach that speaks to you - actively monitors your motion, tracks your progress, and motivates you to achieve your fitness goals",
        "Up to 6 months battery life and waterproof. Band is lightweight and breathable.Wear it on your wrist for swimming, on your ankle for running and cycling, or wear two for cardio boxing",
        "Moov's Omni Motion sensor uses 3 times the sensors used in basic fitness trackers and provides real-time accuracy",
        "Colorful and Insightful Data in your Moov App"
    ],
    "description": "The New 2016 Edition features a new more durable and secure band! Imagine you're running when you hear a voice chime in your ear, “You’re 10 meters behind your target. Push a little harder, you can still beat your goal.” Only MOOV NOW measures your exact movement and analyzes it in order to coach your form and efficiency. With MOOV's real-time audio coaching pushing you to improve throughout each workout, bringing your fitness and workout experience to a whole new level. With the free MOOV app, we offer free guided programs in sports including running, cycling, swimming, body weight training, and cardio boxing. MOOV NOW for swimming offers the most advanced swim tracking and stroke detection available so you can focus on your swim, not counting laps.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 110.00000000000001,
        "width": 30.0,
        "height": 890.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41URjFRaswL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FknN96ZKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51V9xVqc1iL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2BO7rqartL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61Y7%2B3%2BOH%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51wzcuqwjNL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Blizzard White"
        }
    ],
    "categories": [],
    "similar": [
        "B01CX26IEO",
        "B06XSXVGSV",
        "B01NBWACSC",
        "B071SF8DPP",
        "B074DSTVVX",
        "B00MH4QM1S",
        "B01N5AJPTG",
        "B07CFWLJQ8",
        "B01H74WHCK",
        "B071JGZ835",
        "B01N0M5MTX",
        "B071WZ4C32",
        "B01CX26I4Y",
        "B00K62Y2O2",
        "B01CX26IP8",
        "B01G8JO5F2",
        "B076HQ133W",
        "B0714DM3RD",
        "B072FJMTDC",
        "B01MEDGR2W",
        "B018YKTD1Y",
        "B0759KGQ5G",
        "B07CGKQZD1",
        "B00063MDD8",
        "B01N5AILYX",
        "B07C828P6M",
        "B07FVRZLY8",
        "B00PMB042G"
    ],
    "rating": "3.4"
}