{
    "asin": "B01DT327Z0",
    "title": "Solid Gold High Protein Dry Cat Food; Indigo Moon with Real Chicken & Eggs",
    "brand": "Solid Gold",
    "feature": [
        "NATURAL, GRAIN FREE: Holistic, natural, grain free, gluten dry cat food recipe specially crafted active kittens and adult cats.",
        "HIGH PROTEIN, LOW CARBOHYDRATE RECIPE: With 42% crude protein, Indigo Moon is one of the highest protein recipes on the market. Ideal for active cats or those with diabetic health concerns. Fiber-rich peas help balance the overall ash content.",
        "HIGH-QUALITY, REAL CHICKEN: Responsibly sourced, USA-raised chicken provides a highly palatable source of protein. Whole egg provides a complete source of all essential amino acids that are vital for a healthy, active metabolism.",
        "NUTRITION FOR LIFELONG HEALTH & LONGEVITY: Balanced Omega Fatty Acids for a soft & shiny coat. Superfoods provide natural vitamins, minerals & antioxidants for immune health. Prebiotics & living probiotics support gut health & nutrient absorption.",
        "FREE FROM FILLERS: Contains no corn, wheat or soy. No artificial colorings or preservatives. Made in the USA. 100% satisfaction guaranteed!",
        "Holistic grain and gluten free dry cat food ideal for cats and kittens of all life stages and all sizes",
        "Formulated with 20 nutrient rich superfoods like carrots, pumpkin, cranberries, blueberries, broccoli, almond oil, kelp and lentils"
    ],
    "description": "On the prowl for a grain free food your cat will love? This high protein formula provides a combination of nutrient dense ingredients & healthy fats, all packed in a unique kibble with the flavor your cat craves. This recipe is crafted with 20 Superfoods & packed with nutrient dense chicken & egg, nature's perfect protein. At 42% protein, this recipe is sure to please even the pickiest palate and provide the protein and energy your active cat needs to play for hours! This high protein, low carbohydrate recipe can also be beneficial for cats with diabetic health concerns when fed under veterinary supervision. As America's first holistic pet food company, Solid Gold has over 40 years of experience crafting natural, holistic recipes designed to meet your pet's unique health needs. Solid Gold's proprietary nutrition platform is tailored for your cat's lifelong health and longevity. Balanced Omega-6 and -3 Fatty Acids from natural sources like salmon oil and ocean fish support a soft and shiny coat and provide immune system support. Prebiotics and living probiotics ensure your cat has balanced levels of beneficial bacteria to support optimal gut health, healthy digestion and proper nutrient absorption. Finally, we pair responsibly sourced real meat, poultry or fish with our carefully curated blend of 20 superfoods that help support a strong and healthy immune system.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 310.0,
        "length": 440.00000000000006,
        "width": 320.0,
        "height": 1580.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51B8KUG4-JL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51i3FZPh4wL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/518bnqY0SoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51r34sGx0RL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/511YlpbXYgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CwYH-KOBL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "3 lb."
        }
    ],
    "categories": [
        {
            "node": "2619533011",
            "title": "Pet Supplies"
        },
        {
            "node": "2975241011",
            "title": "Cats"
        },
        {
            "node": "2975265011",
            "title": "Food"
        },
        {
            "node": "2975266011",
            "title": "Dry"
        }
    ],
    "similar": [
        "B01DT32AIE",
        "B074Q649V5",
        "B0009YUI6I",
        "B00X8XD382",
        "B01BKECCO6",
        "B07822J5CK",
        "B07CVS4NLR",
        "B01DT32AWK",
        "B00NW1LIKU",
        "B07864NZMV",
        "B01DT328CC",
        "B01DT327LE",
        "B07C7P84NS",
        "B00LAQXFUK",
        "B00HPZENCE",
        "B00PAV2F9S",
        "B00PAV2DQI",
        "B01DUJMCSU",
        "B00ZQYGSTM",
        "B00KX6OB06",
        "B001VIY9B6",
        "B07CW3T8ZV",
        "B01DUJMCPI",
        "B01DT3286S",
        "B00REJU4V0",
        "B003M5WNGY",
        "B005HH6MPS",
        "B01DT32854",
        "B001VIY9CA"
    ],
    "rating": "4.5"
}