{
    "asin": "B01D9UDIK6",
    "title": "Frank S.Burton 6mm 8mm White Carbon Fiber Inlay His and Hers Tungsten Carbide Wedding Band Set",
    "brand": "Frank S.Burton",
    "feature": [
        "Silver tungsten carbide wedding ring, comfort fit for men and women",
        "Workmanship: white grey carbon fiber inlay with beveled edge, 6mm and 8mm wide for couples who desire a matching set",
        "Best value: unisex tungsten wedding band, accurate size & anti-allergic to your finger, best gift for engagement, wedding, promise, Christmas, valentine's day",
        "Durable & Heavy: tungsten ring would never bend, it is strong and tough",
        "Service and Insurance: friendly customer service and life-time quality guarantee including 30 days money back and exchange"
    ],
    "description": "About Frank S. Burton Frank is proud to present our tungsten carbide ring line. Most of our rings have more colors and width for your choice, you may choose two rings for couple ring set. Tungsten Carbide is the newest and strongest metal to be used in jewelry, ideal for men and women who are tired of rings that scratch easily. Its luster and whiteness can last for decades. Our tungsten carbide ring will never cause allergy to user and it is perfect as a wedding band, engagement ring or just for everyday wear. Tungsten Carbide Ring and Jewelry are: ?Virtually scratch free ?The most wear resistant ring on the planet ?10 times harder than 18k gold ?5 times harder than stainless steel ?4 times harder than titanium >br>?Tungsten measures between 8.5 and 9 on the Mohs hardness scale (Diamonds are 10 which is the highest) ?The ring will hold its shape and shine longer than any other ring, it has been refered to as \"permanently polished ring\" ?The ring and jewelry will NEVER bend nor tarnish Product Warranty We are committed to worthiness shopping experience, so that we provide LIFE TIME WARRATY. Friendly customer service, if you have any question, feel free to contact with us and we would reply you as soon as possible. Any quality and ring size problem, you will get 30 days money back guarantee or exchange. About ring size measure Measure your finger size before purchase, the paper measurement is intended for reference only, We would like to suggest you have your finger sized at a jewelry store.",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": null,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51y3ydaTkhL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41svDWgrsyL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/419afTwtidL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pIjyMeOML._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/518o91CH25L._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41thIRi28%2BL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BJFEGBL5L._US40_.jpg"
    ],
    "attributes": [
        {
            "name": "Metal Type:",
            "value": "6mm"
        },
        {
            "name": "Ring Size:",
            "value": "5.5"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "3887881",
            "title": "Jewelry"
        },
        {
            "node": "9539904011",
            "title": "Wedding Rings"
        }
    ],
    "similar": [
        "B07BRJDJ6M",
        "B07CB83N8H",
        "B007V715EA",
        "B01IQY9G4C",
        "B01CG0GD9S",
        "B06XRXDZ43",
        "B07C2ZLJ5J",
        "B075JCQBKJ",
        "B017E9WTLC",
        "B00JRJZGW2",
        "B01D9UCJO2",
        "B07D6H2YQJ",
        "B07CS9JQ6M",
        "B005DC2UDA",
        "B075JDKWRR",
        "B01IVMAC06",
        "B07CT8RC9P",
        "B076CKCKJ7",
        "B014Y9RY1A",
        "B00KKVY3SE",
        "B00OH6WPMO",
        "B00W65R58M",
        "B011DI5VGK",
        "B07316SGZJ",
        "B076Q5KP44",
        "B07CB9F6S8",
        "B07C1S4SHX",
        "B00W65SL3A",
        "B006YH3DS4",
        "B07FJV384H",
        "B004C4GBIK",
        "B00JIY3T52"
    ],
    "rating": "5.0"
}