{
    "asin": "B01DCDN18O",
    "title": "GSTAR 2\" 4-Stage Tobacco & Herb Grinder - Gun Metal",
    "brand": "GSTAR GRINDER",
    "feature": [
        "Package Includes: 1 - Gun Metal GSTAR Grinder",
        "Ensure consistently even grinds with the heavy-duty premium GSTAR Grinder: finely grind your herb or tobacco with the grinder's solid metal teeth, which are then filtered by the 500-micron pollen screen. Magnets keep your grinder's lid securely in place to ensure smooth grinds and to prevent spills while you are grinding.",
        "Contemporary design and a product that simply works – fast and easy grinding with a simple turn of the wrist. Requires no batteries and set up is minimal. Clean up is easy and your grinder comes with a pollen scraper.",
        "Our grinders are designed for use with herbs, tobacco, and spices. Compact and sleek design keeps your grinds safe and secure, and makes storage easy.",
        "Affordable grinder with quality assurance you can trust – durable zinc alloy construction and backed by a lifetime warranty."
    ],
    "description": "Welcome to GSTARHere at GSTAR, we love modern production applied to old traditions, and by combining that with affordable pricing, we aim to be your go-to shop for hookah and lighting solutions.For consistently even grinds for your herbs and tobacco, GSTAR is proud to introduce the GSTAR Grinder. The GSTAR Grinder gives you perfectly fine grinds quickly and easily, and with the control you can only get from doing it by hand.How does it work? Our grinders feature three compartments: the first compartment's sharp metal teeth thoroughly grind your herbs or tobacco, then any pollen or undesired residue is filtered by the second compartment's 500-micron screen, and then separated and deposited into the third compartment. Clean up is fast and easy because our grinders feature magnets to keep the grinder's lid securely in place even as you grind, and we also include a complimentary pollen scraper. The grinder is sleek and compact, making it easy to store or if you need it on the go.Why choose GSTAR? We work with our manufacturers to produce only high quality, safe grinders made from durable zinc alloy that we back up with a lifetime warranty. Don't compromise on your grinds and instead get the quality, affordability, and assurance you can trust with the GSTAR Grinder.*Must be 18 years of age or older to purchase.",
    "price": 899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51tjDw%2Bhn7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51E523%2BEqdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41VN7MRRhUL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "284507",
            "title": "Kitchen & Dining"
        },
        {
            "node": "289754",
            "title": "Kitchen Utensils & Gadgets"
        },
        {
            "node": "289779",
            "title": "Seasoning & Spice Tools"
        },
        {
            "node": "289781",
            "title": "Herb & Spice Mills"
        }
    ],
    "similar": [
        "B00GXSFB1Q",
        "B074KMRNR7",
        "B019BMDXII",
        "B06XHXY6PR",
        "B06XW7YHZV",
        "B008EZKN4G",
        "B01JEBGP90",
        "B072MMNSVM",
        "B07C1YK4XP",
        "B014GNGTBK",
        "B00UIVIXVO",
        "B079GQWK1N",
        "B01N3PKP5A",
        "B07BTQJKVQ",
        "B0761WW51R",
        "B01DCDN13Y",
        "B07D2ZS6P6",
        "B07D4N7SPH",
        "B07BQSSWVX",
        "B07DNF4HX1",
        "B072FJRSF9",
        "B072FNGC2J",
        "B01DCDN2G0",
        "B002CNE9H8",
        "B07D2NDGRB",
        "B0711BDNWF",
        "B077YVNSQB",
        "B07622BRBV",
        "B01DCDN1R0",
        "B01DCDN0DA",
        "B01MSH511C",
        "B002MZ1BU4"
    ],
    "rating": "4.3"
}