{
    "asin": "B01DF7JH1W",
    "title": "New iPad 9.7 2018/2017 Kids Case, ANTS TECH 9.7 inch iPad Air 2/iPad Air Cover Shockproof Childproof Lightweight Handle Friendly Convertible Stand for Apple iPad 6th/5th Generat (New iPad 9.7, Black)",
    "brand": "Ants tech",
    "feature": [
        "[COMPATIBILITY] - This case only fits for Apple 2017 New iPad 9.7(A1822, A1823), Apple iPad Air 2(A1566, A1567), iPad Air(A1474, A1475, A1476), It will not work for any other iPad model tablets.",
        "[EVA MATERIAL & KIDS FRIENDLY] - iPad case 9.7 made of safe EVA material is non-toxic and tasteless, have no harm on the health. Ideal for Boys, Girls, toddlers use at home/School. Colorful and lightweight iPad case for kids will be the favorite gift of your children.",
        "[SHOCKPROOF & SCREEN PROTECTION] - iPad air case constructed from impact-resistant polycarbonate with a shock absorbing silicone inner-sleeve. Corners featured double-thick silicone for outstanding protection against drops and other impacts. The design of 3mm higher than screen and 5mm higher than camera effectively prevent the screen and the camera from being scratched.",
        "[MULTI-FUNCTIONAL CARRYING CASE] - Large handle designed for comfortable one handed grip (suitable for smaller children's hands) for easy carry and travel. Handle folds into upright kickstand for watching movies or improved typing angle. Perfect Fit with precisely cut openings, it is easily access to all the buttons(including the microphone,ports, speaker,and camera).",
        "[NOT CHEMICALLY TREATED] - Be worry free while the case is in the hands of your child, after all hand washing is the best defense against germs. No need to be concerned about the effects of unknown anti-bacterial chemicals causing rashes or reactions while your child is playing on their tablet.n their tablet."
    ],
    "description": "Designed to form-fit the only. Will not be compatible with any other model tablet. ♥ Made entirely of durable EVA foam rubber ♥ Soft, squishy material is fun and safe for children ♥ Cutouts for clear access to all buttons, ports, speakers and rear-camera ♥ Handle doubles as a tablet stand support for viewing in landscape format ♥ Raised screen bezel for extra protection ♥ Foldable stand can stand upright for tabletop tablet viewing ♥ Easy to install, multiple colour single body case ♥ Reinforced squishy protection on all corners and sides (ideal case for kids) guards tablets from impact & falls ♥ Easy to wash and clean (water resistant) material made from child friendly, non-toxic EVA foam (similar to silicon & rubber, but stronger) ♥ Great kids case and for toddlers of all ages ♥ Suitable for Homes, Hospitals, Schools, Kindergardens, Gyms ♥ Cute handle makes it easy for smaller, childrens hands to carry / walk around with case ♥ Handle doubles as dual angle stand for watching movies / cartoons and drawing / typing",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 66.25,
        "length": 819.9999999999999,
        "width": 520.0,
        "height": 70.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51OzIfU9MSL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513JqQbjloL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41HrnnklUtL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41XncqvApZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41f9Ur9ipBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pJbWFv61L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vedWLBdBL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "New iPad 9.7"
        },
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "2348628011",
            "title": "Tablet Accessories"
        },
        {
            "node": "2348629011",
            "title": "Bags, Cases & Sleeves"
        },
        {
            "node": "3012929011",
            "title": "Cases"
        }
    ],
    "similar": [
        "B07F1BLYJG",
        "B06Y19L37Z",
        "B072Y3W6C5",
        "B0748LBTZN",
        "B07CWTTT37",
        "B072XZCV5M",
        "B078X4K2MZ",
        "B072QYRFQH",
        "B07F1KFVSM",
        "B072Y1SS5L",
        "B01DF7JH0I",
        "B0774LYDZC",
        "B00PUOK150",
        "B06XS26SQK",
        "B076B7S6YZ",
        "B07F1JQG4B",
        "B07F1B7L23",
        "B01DF7JIF2",
        "B01DF7JINY",
        "B071W957BF",
        "B06Y1PBF6B",
        "B01LC56L7W",
        "B07DNPCQQV",
        "B07F1B3TH1"
    ],
    "rating": "4.3"
}