{
    "asin": "B01DLY3IW8",
    "title": "Creative Sound BlasterX G1 7.1 Portable HD Gaming USB DAC and Sound Card (70SB171000000)",
    "brand": "Creative",
    "feature": [
        "Supports true 7.1 channel audio input signals for realistic virtualization of gaming effects and audio cues with perfect accuracy and positioning",
        "Enhance your gaming experience through the headphone amplifier, capable of driving a wide range of gaming to studio-grade headphones.",
        "Powerful and fully customizable BlasterX Acoustic Engine, powers the Sound BlasterX G1 to deliver various audio enhancements for optimized gameplay",
        "X-Plus Mode when paired with the Sound BlasterX H5 - X-Plus mode accentuates the audio for things that really do matter in a competitive game while playing down emphasis on things that do not",
        "Instantly upgrade any headset or speakers - simply plug into a PC, Mac or PS4 and connect any headset or speakers to instantly boost your listening and gaming experience"
    ],
    "description": "Sporting a small form factor, the plug-and-play Sound BlasterX G1 delivers crystal clear high-resolution audio with 7.1 HD positional surround sound, offering instant audio performance boost for an immersive gaming experience on PC, Mac, PS4 and mobile devices. The Sound BlasterX G1 is a portable 24-bit/96kHz HD gaming USB DAC and sound card. Featuring 7.1 HD virtualization, BlasterX Acoustic Engine audio enhancement, Crystal Voice and Scout Mode Technology, the Sound BlasterX G1 delivers the best-in-class audio upgrade for superior gaming performance.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 13.0,
        "length": 540.0,
        "width": 90.0,
        "height": 40.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31o4Ceu3LmL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31UdOw5NJxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41fRob%2BCT7L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "193870011",
            "title": "Computer Components"
        },
        {
            "node": "3012292011",
            "title": "External Components"
        },
        {
            "node": "3015427011",
            "title": "External Sound Cards"
        }
    ],
    "similar": [
        "B00IM36VU0",
        "B00MI8IDRE",
        "B072BMG9TB",
        "B0719PKWNT",
        "B014I8UEGY",
        "B018YV3ALM",
        "B00IRVQ0F8",
        "B004ZI5E1S",
        "B01M9B2YSV",
        "B00EZT7RE4",
        "B0044DEDC0",
        "B06XKC2DNQ",
        "B00OJ5AV8I",
        "B06XP5R449",
        "B014DNVUG2",
        "B01HPMHOY0",
        "B00KK8ZLEC",
        "B00BJ17WKK",
        "B01I3A47I4",
        "B06XBZ38ZJ",
        "B01N905VOY",
        "B01H2XL524",
        "B06XNJLHXS",
        "B006IPH5H2",
        "B07FY45F2S",
        "B00ENMK1DW",
        "B01L1JXI0M",
        "B078KFZXV2",
        "B076V4H8BR",
        "B0044DEDCA"
    ],
    "rating": "4.2"
}