{
    "asin": "B01DWHPJ94",
    "title": "Skullcandy Ink'd Bluetooth Wireless Earbuds with Microphone, Noise Isolating Supreme Sound, 8-Hour Rechargeable Battery, Lightweight with Flexible Collar, Black",
    "brand": "Skullcandy",
    "feature": [
        "Lightweight, low profile, and flexible: The low-profile design weights only 24 grams, offering all-day listening that won't compromise your style. For quickly and conveniently storing in a pocket or bag, the flex collar packs up to one-third its size.",
        "Supreme sound: A noise-isolating fit enhances the rich, clear audio of Supreme Sound across all types of music, producing attacking, powerful bass, warm, natural vocals and precision highs.",
        "Built-in mic and remote: Manage your calls and music on these Bluetooth buds with the built-in mic and remote featuring call, track and volume control. Thirty feet of cord-free Bluetooth means you can do it all without reaching for your phone.",
        "Long lasting battery: Listen longer and louder with 8-hours of rechargeable battery life. Battery fully recharges in just 2.5 hours."
    ],
    "description": "The low-profile and feather light design of Ink'd Wireless won't cramp your style and are comfortable enough to wear all day. Supreme Sound and a noise-isolating fit deliver rich, clear audio for any type of music. The flexible collar packs up to ⅓ its original size for easy storage in a pocket or bag. An 8-hour rechargeable battery lets you listen longer, and the built-in mic and remote let you take calls and control your music without ever having to reach for your phone. And thanks to 30-feet of Bluetooth range, you're free to roam.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": 430.0,
        "width": 120.0,
        "height": 740.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412tdNF8-mL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418sHxate6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31%2B4rG14YyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Gh%2BrSGfnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vFYeBN8dL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B07GP49F47",
        "B07GVXYBVX",
        "B07FXRKH16",
        "B013UFYCDC",
        "B06XPK9N8L",
        "B01DWHPRAU",
        "B07DGQ2QZ2",
        "B07GS5NM66",
        "B007136EDG",
        "B00S2P0M1C",
        "B01DWHPK5C",
        "B07DGJX1FQ",
        "B0792QJQT1",
        "B07CGLKT2S",
        "B07CGN8V28",
        "B07DDHBDYZ",
        "B0756TJL65",
        "B07C75CNBQ",
        "B06ZZSQQTD",
        "B077MCLSGR",
        "B06XVSLZL8",
        "B075NRNZWD",
        "B07DHCZ1TR",
        "B01DWHPMEG",
        "B01DWHPON0",
        "B01N79G14B",
        "B078WP9M4F",
        "B071WZ4C32",
        "B07CB7Y44K",
        "B06XX123SH",
        "B004MWL1TQ",
        "B013UFETBW",
        "B07C4PNW7W",
        "B00YZSXGQS",
        "B01DWHPL7O",
        "B00NCSIN4W",
        "B01L160DLW",
        "B01KVD1NYM",
        "B07DGJRVL2"
    ],
    "rating": "3.5"
}