{
    "asin": "B01E66QAZC",
    "title": "Zizo Military Grade Drop Tested Bolt Series iPhone SE Case for iPhone 5s / SE / 5c with iPhone SE Screen Protector, Kickstand, and Holster Belt Clip",
    "brand": "Zizo",
    "feature": [
        "Protection. The Zizo Bolt Series meets Military Grade 810.1-G Compliancy. Certified to protect your phone.",
        "Versatility. With up to 10 color variations to choose from, the Zizo Bolt Cover provides the perfect platform to express your style.",
        "Endless possibilities. Equipped with a built-in kickstand, you can now enjoy your phone hands free.",
        "iPhone SE Screen Protector. A Zizo Lightning Shield 0.33mm 9H hardness and 100% clarity tempered glass screen protector is included with every purchase.",
        "iPhone SE Case: The Zizo Bolt Series is compatible with iPhone SE, iPhone 5s, iPhone 5c, iPhone 5, iPhone 5G"
    ],
    "description": "Protective, attractive, and exclusive. The perfect 3 words to describe the Zizo Bolt Series. When it comes to finding a reliable iPhone SE case, the Zizo Bolt Cover is definitely your first choice. This product features a dual-layer case that is engineered to disperse impact force when dropped. A soft Shock Absorbing Tetra Polyurethane with an Impact Resistant Polycarbonate Shell is the secret behind Zizo Bolt Cover's protection. This bundle also includes a heavy duty 360 degree rotatable holster belt clip and a built-in kickstand to provide additional versatility and functionality while using your device. Aesthetically crafted with over 10 color variations to choose from to convey the perfect platform to express your style. The Zizo Bolt Series meets Military Grade 810.1-G Certification. We know how important your phone's protection is to you, so we also included a Zizo Lightning Shield iPhone SE screen protector with every purchase. We also made this iPhone SE case compatible with iPhone 5s, iPhone 5, iPhone 5c and iPhone 5G to give you endless versatility. Our goal is simple: to provide the best value in products available. Zizo is a second-generation family company based out of Southern California. We're a New school company with Old school traditions. Become a part of the ZizoFamily today!",
    "price": 1798.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 520.0,
        "width": 130.0,
        "height": 720.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51kb6hbE8UL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-6U3AqgsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41y4uM3NWVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ub%2BKqtrPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41hDW5aoCzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pGTHN18GL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51QKFb-uPLL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B01N0GJWMV",
        "B01HP3HTHG",
        "B07CL3LC6T",
        "B07FZVKCDJ",
        "B00MVLTFBG",
        "B01CKCKEMO",
        "B0768YKXSN",
        "B017XHGP4C",
        "B01CV6Z2IU",
        "B0757GCBC5",
        "B00KOGTYFM",
        "B01KWWLLXK",
        "B009E87SD6",
        "B01CKCKELA",
        "B019GZSCQ8",
        "B07BBMDNRF",
        "B01FXBZ85C",
        "B01E66QAE8",
        "B07G9SPZQZ",
        "B01KWWLDVK",
        "B06X3SH91J",
        "B01JSZMN5M",
        "B01DJ18TC2",
        "B07G5B2HH3",
        "B01CKE327G",
        "B01E66QBN8",
        "B00HT6GFX4",
        "B01KX0K4PM",
        "B01F9RGJJO"
    ],
    "rating": "3.9"
}