{
    "asin": "B01E060CUC",
    "title": "Cellessentials Card Holder Back Phone - Silicone Stick on Cell Phone Wallet Pocket Credit Card, ID, Business Card - iPhone, Android Most Smartphones - 3 Pack(Black,White,Grey)",
    "brand": "Cellessentials",
    "feature": [
        "STRONGER ADHESIVE - Cellessentials wallet stickers have been redesigned with the strongest adhesive available that will not leave residue on your phone. Our new CellTek Bond adhesive will stick to glass backed phones much better than the 3M versions on the market. Attaches to any cell phone and sticks to most cases.",
        "CARRY LESS - Each cellphone wallet case has a pouch making it easy to carry your most important cards without needing a bulky wallet. Keep the most important cards with you at all times such as your debit card, credit card, driver's license, bus pass, train pass, business cards and more.",
        "SECURE FIT - The sleeves can hold up to 3 cards securely while feeling confident your cards will not fall out. These silicone wallets are designed to be slim while adding grip to your phone without being too bulky. The thickness of your cards will determine how many you can fit.",
        "3 PACK - Each order comes with 3 high quality durable stick on wallets. Choose from the variety of color combinations that we offer. Give your phone a new look and stand out with these 3 pack cell phone wallets.",
        "MONEY BACK GUARANTEE- We are so sure that you will love our product that it comes with a 30-day Risk-Free 100% money-back-guarantee. If you are not fully satisfied with our product, let us know and receive a full refund."
    ],
    "description": "With the rise of phones made with glass backs, we quickly learned that the 3M adhesive available on the market was not strong enough to stick to glass. It also does not stick well to silicone cases. We set out to find a better adhesive and tested dozens of versions to find one that would stick better to the new glass backed phones. We are excited to announce that our wallets now contain CellTek Bond adhesive that will stick more securely to glass backed phones than any others on the market!- For customers with glass backed phones please follow the installation card included in the package very carefully. You must clean the glass with alcohol and then stick the wallet on firmly and leave it overnight for 8 hours with the phone resting on the wallet. This will give the wallet the best chance of sticking to the glass. Please also do the same for silicone cases although it is not recommended to stick on silicone cases. There are currently no adhesives that stick well to silicone.☛ CellTek Bond - Strongest non residue adhesive☛Anti-slip silicone☛Elastic pouch for securing multiple cardsCompatible with all phones with a 4-inch display or larger such as the iPhone 4 / 4s / 5 / 5s / 5c / 6 / 6 plus / 6s / 6s plus / SE / 7 / 7 plus / 8 / 8 plus / x | Samsung Galaxy S2 / S3 / S4 / S5 / S6 / S7 / S8 / S8 Plus / S9 / S9 Plus / edge / J3 | Galaxy Note 1 / 2 / 3 / 4 / 5 / 6 / 7 / 8 / 9, LG G2 / G3 / G4 / G5 / V20 / V30 G6 / K20 plus / Stylo 2 / Stylo 3 | HTC Desire 530 / Bolt / M8, | Sony Xperia | all iPod Touch and iPads including iPad Air, Galaxy, Surface Pro | Moto e4 / G4 / Moto z droid | Android | Nokia",
    "price": 679.0,
    "listPrice": 949.0,
    "prime": true,
    "dimensions": {
        "weight": 1.0,
        "length": 350.0,
        "width": 210.0,
        "height": 10.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41D3a9ZLuNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tMiMDNiHL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-PTfSinjL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41yuHlIlLzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31iU32L5NuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tTGl0pUCL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51rP73H9hsL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "9414313011",
            "title": "Sleeves"
        }
    ],
    "similar": [
        "B07CCGNGW9",
        "B01C2DC15O",
        "B00HY3HSZQ",
        "B07CWWQ8C7",
        "B07DRQGQSF",
        "B014KMAFLM",
        "B079QYYT8F",
        "B009ZVL7N4",
        "B07766951L",
        "B01JRXNRGO",
        "B076PTN4KH",
        "B07BK9SJ8T",
        "B001GBLMIG",
        "B06XCXPCTH",
        "B01E0563AQ",
        "B07DTLC3CD",
        "B01BE3WE5U",
        "B0086B2GCK",
        "B01E0563CO",
        "B014D7YX62",
        "B07CKKQ8TZ",
        "B06XZ59Z5Z",
        "B01BE412X4",
        "B07DVSKG2F",
        "B019KVZDVU",
        "B01BE495LA",
        "B01E05639W",
        "B01415QHYW",
        "B06WWPKB9K",
        "B07HD4YCZQ",
        "B07D7RFKXN",
        "B07GCHBB9J"
    ],
    "rating": "4.4"
}