{
    "asin": "B01E6C4FVM",
    "title": "NatureWise Max Probiotics for Men and Women | Time-Release, 30 Strains, Comparable to 450 Billion CFU with WiseBiotics Technology, Shelf Stable, Acid Resistant | 40 Caplets",
    "brand": "NatureWise",
    "feature": null,
    "description": "With roughly 80% of the body’s immune system located in the gut, maintaining a healthy balance of friendly gut bacteria is critical to overall health. Research increasingly shows just how intricately our immune system and brain are linked to our gut. While science has yet to fully understand all the connections between gut flora and health, some of the known relationships include: Improved Immune Health, Energy Levels, Mood & Mental Health, Healthy Weight, and Longer Life.*Common hazards of modern life such as poor diet, environmental toxins, medications, and chronic stress can wreak havoc on the delicate balance of gut flora. When this occurs, pathogenic bacteria and other opportunistic organisms can overpopulate the gut, seriously disrupting your body’s normal function. Strong clinical evidence suggests that supplementation with probiotics can help repopulate beneficial strains of gut flora and crowd out harmful bacteria.NatureWise Maximum Care Probiotics has been carefully formulated with clinically proven bacterial strains and select prebiotics to help replenish critically depleted gut microbiota for optimum digestion, immune support & overall health.* Our high potency, high diversity formula contains 30 targeted strains and 30 billion CFU—twice the amount per capsule as other leading probiotics on the market.Stomach acids can destroy up to 96% of probiotics before they ever reach the lower GI tract. Our WiseBiotics delivery system ensures that at least 60% of your probiotics will survive transit through corrosive gastric acids to reach their targeted destination—15 times more than the standard probiotic. Our unique time-release technology then distributes these live, active cultures throughout the small and large intestines over a period of 8-10 hours—a benefit that no other standard probiotic can match.*Many probiotics on store shelves fail to meet label potency claims, and may have no viability at all by the time they are actually consumed. NatureWise Daily Care Probiotics is guaranteed viable with live, active cultures up to expiration, and we ensure exceptional shelf-life stability—even at room temperature.NatureWise is certified by NSF, one of the most stringent and respected GMP certification organizations in the world. Our products are carefully tested by third party laboratories for purity and potency, as well as physical, chemical, and microbial contamination, guaranteeing the highest standards of quality and safety.At NatureWise, we are passionate about helping people live healthier, happier lives. Achieving a healthy you involves a balanced diet, regular exercise, and finding a source of support to help you reach your personal goals. With every NatureWise purchase, our customers gain access to a team of world-class customer service professionals available to help answer questions and offer personalized support. It’s part of what makes NatureWise a different kind of company.*These statements have not been evaluated by the Food and Drug Administration. This product is not intended to diagnose, treat, or cure any disease.",
    "price": 3479.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 229.99999999999997,
        "width": 229.99999999999997,
        "height": 440.00000000000006
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/516vTth%2BHyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VIqiTUdQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41YDGme7T1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/414bHKhinKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51LE6W2nBiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ADCGKL0jL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "6939426011",
            "title": "Supplements"
        },
        {
            "node": "6942464011",
            "title": "Digestive Supplements"
        },
        {
            "node": "3774071",
            "title": "Probiotics"
        }
    ],
    "similar": [
        "B01BMDAVIY",
        "B01EY4MRIU",
        "B009PGZX52",
        "B076VYCZQZ",
        "B01E6C4H6U",
        "B07CPVHQ7F",
        "B00KNX8LVY",
        "B00CAZAU62",
        "B01KSSP828",
        "B01E6C4G52",
        "B01FNEV7IQ",
        "B01MTJZNQF",
        "B01IBMOGEE",
        "B01BMF1J0G",
        "B00WL25F0U",
        "B076W94H97",
        "B000CMKC5Y",
        "B0055OV0MI",
        "B00099QQIM",
        "B071DZQLPQ",
        "B00OMT6U4U",
        "B00WZ4VQ52",
        "B07CMLVYDL",
        "B00OTTLBHE",
        "B01BKUD2SK",
        "B004H6PIRS",
        "B01BKSUPN2",
        "B01NB0G1V8",
        "B00Q8BAXSY",
        "B00GB85MZI",
        "B01EY4X8WO"
    ],
    "rating": "4.7"
}