{
    "asin": "B01FSS6BHY",
    "title": "Watch Band with Colorful Nylon Material Strap and Heavy Duty Brushed Buckle",
    "brand": "ArtStyle",
    "feature": [
        "ArtStyle watch strap is a stylish, soft and breathable watch accessory which can be used either in wet or hot weather. It is of good quality and reliable, and with its durable, dirt & wet resistant features, you can enjoy yourself with no concern while doing fitness, swimming, diving, or climbing. It can even hold your watch when one of the spring bars break",
        "This strap is also Non-Allergenic and will fit wrists from 6 1/4\"(160mm) to 9 1/2\"(245mm), which means men, boys, and Hercules. Choose ArtStyle strap for 3 simple reasons:",
        "#1: AWESOME MATERIAL: Premium Ballistic nylon webbing makes it comfortable to wear. Also it is WATERPROOF and DURABLE, so it can be washed repeatedly and easy dry",
        "ArtStyle watch strap is a stylish, soft and breathable watch accessory which can be used either in wet or hot weather. It is of good quality and reliable, and with its durable, dirt & wet resistant features, you can enjoy yourself with no concern while doing fitness, swimming, diving, or climbing. It can even hold your watch when one of the spring bars break",
        "This strap is also Non-Allergenic and will fit wrists from 6 1/4\"(160mm) to 9 1/2\"(245mm), which means men, boys, and Hercules. Choose ArtStyle strap for 3 simple reasons:",
        "#1: AWESOME MATERIAL: Premium Ballistic nylon webbing makes it comfortable to wear. Also it is WATERPROOF and DURABLE, so it can be washed repeatedly and easy dry",
        "#2: ADVANCED TECHNICAL – Each holes and ends are Laser Heat Sealed to prevent fraying. The hand feeling is smooth and it will not scratch skin. The Heavy Duty Brushed Buckle is the latest fashion style but also is solid and sturdy at the same time",
        "#3: THE EXACTLY RIGHT THICKNESS – 1.2mm Thickness strap makes the band Durable at any harsh environment, but also Breathable in the wet and hot day"
    ],
    "description": "ArtStyle watch straps are manufactured under stringent quality control, using laser of heat sealing ballistic nylon with premium solid matte-brushed stainless steel hardware. A good quality nylon stra ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B07C13MJWD",
        "B079KDNTZP",
        "B019CXDYCQ",
        "B073QG4KK7",
        "B01BU44WE4",
        "B07D926L1B",
        "B07657P1FN",
        "B078CQ23G7"
    ],
    "rating": null
}