{
    "asin": "B01FXF9P52",
    "title": "FM Transmitter UPPEL Wireless Transmitter in-Car Kit Hands-Free Talking Radio Adapter & USB Car Charger for All Smartphones Audio Players",
    "brand": "UPPEL",
    "feature": [
        "Hands-Free car kit designed for answering and receiving calls and streaming music with any Bluetooth Android smartphone - Apple iPhone 6 Plus, Google Nexus, Blackberry, Samsung Galaxy, Tablets, other media players, and more!",
        "USB Charging: With a handy built-in USB power port(2.4A) design, you can charge your cell phones, GPS and other digital devices while you are driving. Never run out of power for music, great enjoy for long journey",
        "Hands-free Calling: Simply paired your phone with the Bluetooth and its hands-free system can set free your hands during answer the calls and let you safely drive",
        "Hands-Free car kit designed for answering and receiving calls and streaming music with any Bluetooth Android smartphone - Apple iPhone 6 Plus, Google Nexus, Blackberry, Samsung Galaxy, Tablets, other media players, and more!",
        "USB Charging: With a handy built-in USB power port(2.4A) design, you can charge your cell phones, GPS and other digital devices while you are driving. Never run out of power for music, great enjoy for long journey",
        "Hands-free Calling: Simply paired your phone with the Bluetooth and its hands-free system can set free your hands during answer the calls and let you safely drive",
        "Easy to Set Up: Just plug the car charger into the cigarette socket and wireless bluetooth connect to your phone. Turn the car FM radio frequency to an unused FM frequency and the FM transmitter into the same channel. Now enjoy your music through the car stereo.",
        "Amazing Performace - FM Radio, it offers you more stable signals, better anti-interference performance for clear sound quality"
    ],
    "description": "Car FM Transmitter Feature: 1. Bluetooth FM transmitter 2. Digital Display 3. Multi-function button 4. Bluetooth indicator light 5. Answer/hang up/reject via Bluetooth 6. Bluetooth stereo music play 7 ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01LGKSBFI",
        "B00VH84L5E",
        "B01NAGHM5G",
        "B01E764DXM",
        "B07333SG4C",
        "B06Y6GCHSB",
        "B01LW97V4H",
        "B074XHKGGP"
    ],
    "rating": null
}