{
    "asin": "B01FS8C5MY",
    "title": "Fintie Slim Shell Case for Amazon Fire (Previous 5th Generation, 2015 7 inch) - Super Slim Lightweight Standing Cover, Navy",
    "brand": "Fintie",
    "feature": [
        "Specifically designed for Amazon Fire (Previous Generation - 5th, 2015 release) with precise cut-outs and openings for easy access to all tablet features. Please kindly note that this Amazon Fire Tablet does not support auto wake/sleep feature",
        "Easy clip-on application. This is a one piece case, the front and back does not separate",
        "Cover has flip capability to transform the case into a viewing stand and keyboard stand",
        "Slim lightweight durable protective hardback with premium quality PU leather. Soft scratch-free microfiber interior adds comfort and an additional layer of protection",
        "Available in a variety of bright and fun colors"
    ],
    "description": "Protect your Amazon Fire (Previous Generation - 5th, 2015 release) with this Fintie Slim Shell Case at all times! The Slim Shell Case sports a simple and classy design. The back shell is made from durable polycarbonate material so you do not need to worry about any damages. It offers an easy clip-on application. Because the cover is uniquely designed to flip back and transform the case into a comfortable viewing stand that offers two different viewing angles, this capability allows the viewer to use the Amazon Fire (5th Generation) hands-free whatever your position may be without strain whether it is being used for viewing or for a keypad. All features of the Amazon Fire (5th Generation) are accessible even with the case on. It even includes a camera hole so you can take pictures and videos without removing it. Watch movies and listen to music clearly with speaker holes! This one piece case will fit your Amazon Fire (5th Generation) like a glove. The Fintie Slim Shell Case comes in a variety of bright, fun colors, the widest selections to suite your taste. It offers an ideal way to protect your tablet wherever go.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 760.0,
        "width": 459.99999999999994,
        "height": 40.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/418LKfH-wrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61uzez5zU%2BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41F6zE5ukGL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51hu-6yITrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51oMvoN%2BnvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5168mupKjtL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Navy"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "2348628011",
            "title": "Tablet Accessories"
        },
        {
            "node": "2348629011",
            "title": "Bags, Cases & Sleeves"
        },
        {
            "node": "3012929011",
            "title": "Cases"
        }
    ],
    "similar": [
        "B078VL35PD",
        "B01GEW27DA",
        "B07CPSFKDN",
        "B01MXVJGF0",
        "B071HXTMWV",
        "B072FLH7LZ",
        "B07H3GDMK3",
        "B06XXDX33P",
        "B0748BRSQP",
        "B015JGFLE4",
        "B0711V14RK",
        "B076LNYKSK",
        "B016ZNMY90",
        "B014KP94IE",
        "B014KP76G6",
        "B07CZBDNJ8",
        "B0788KN452",
        "B015MEB1G0",
        "B016ZNN4OE",
        "B014KP9H54",
        "B072WJH2DQ",
        "B076FBKLBC",
        "B074C5DKND",
        "B071ZBZXZ2",
        "B01HXOEVNW",
        "B015IK5URY",
        "B016CXDSCK",
        "B073CHKCKH",
        "B011LRWWQA",
        "B01B24EBIE",
        "B0160KTTD2",
        "B07C1MSLK5",
        "B01MTXZNUD",
        "B072PSP8BV",
        "B013TMNNDQ",
        "B015IK68I4",
        "B07GGS24S3",
        "B00ZGUYN1Q",
        "B013TMNKAW",
        "B01MTXZPAN",
        "B016ZNN8DG",
        "B07F6YLNLW"
    ],
    "rating": "4.2"
}