{
    "asin": "B01FLC69FG",
    "title": "Power Bank 15000mAh, iXCC Portable Charger Ultra High Capacity External Battery Pack with ChargeWise Tech 2.4 Max Maximum Dual Ports Speed Charging for iPhone, iPad, Samsung Galaxy - Black",
    "brand": "iXCC",
    "feature": [
        "❤Compact Design: Same size like iPhone 7 make it easy to be carried with Just one hand. The Size and Weight is 20% Smaller than normal power bank yet with 20% More Capacity. Pocket Friendly.",
        "❤High Capacity: 15k mAh rechareges 5 times iPhone 7, 3.5 times Galaxy S7, 2 times iPad mini 4. Perfect for travel, Business trip, Mobile Gamer, Pokeman go with 2000+ Recharge Cycle.One Cost Twice the Fun.",
        "❤Multi-SafeGuard: Surge Short Circuit Detection and Prevention to guarantee you and your device's safety. Anodized Aluminum Case Enhances grip and prevents smudges and fingerprints.Impact Vibration Extreme Temp Tested.",
        "❤Compact Design: Same size like iPhone 7 make it easy to be carried with Just one hand. The Size and Weight is 20% Smaller than normal power bank yet with 20% More Capacity. Pocket Friendly.",
        "❤High Capacity: 15k mAh rechareges 5 times iPhone 7, 3.5 times Galaxy S7, 2 times iPad mini 4. Perfect for travel, Business trip, Mobile Gamer, Pokeman go with 2000+ Recharge Cycle.One Cost Twice the Fun.",
        "❤Multi-SafeGuard: Surge Short Circuit Detection and Prevention to guarantee you and your device's safety. Anodized Aluminum Case Enhances grip and prevents smudges and fingerprints.Impact Vibration Extreme Temp Tested.",
        "❤ChargeWise Tech: Up to 2.4 Amperages Per Port with Our Unique Patented Interegrated Circuit can perfectly communicate with Phones Inner Circuit to Reaching Maximum Charging Efficiency determined by your phone. Therefore Shorten Charging time and prolong your Phone battery life span.Most Phone Inner Circuit can only accept 2.4 A Maximum, There is absolutely no point using 3A output Power Bank, it will not only take more time to be fully charged and Highly likely Damage your phones Battery.",
        "❤What You Get: 1 x Portable Charger, 1 x Micro USB Cable.This portable charger comes with a 2-year limited manufacturer's warranty.To acheive maximum efficiency Please Use the included cable, your original cable or a third-party certified one like MFi."
    ],
    "description": "iXCC IXC-150 15000mAh portable charger Ultra-High Capacity --- Adds 5 charges to an iPhone 7, 3.5 charges to a samsung galaxy S7, or even 2 charges to a iPad mini 4. Perfect for camping, travel, busin ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 100.0,
        "length": 610.0,
        "width": 290.0,
        "height": 60.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B06XRVHDLM",
        "B0194WDVHI",
        "B01N6Q8GO9",
        "B00JP8MZGK",
        "B077MZXZ8P",
        "B07C81NKK7",
        "B00VWV8LD4",
        "B00MQSMDYU"
    ],
    "rating": null
}