{
    "asin": "B01FLPPGBQ",
    "title": "PURA D'OR Hair Thinning Therapy Conditioner for Added Moisture, Infused with Organic Argan Oil, Biotin & Natural Ingredients, for All Hair Types, Men and Women, 16 Fl Oz (Packaging may vary)",
    "brand": "PURA D'OR",
    "feature": null,
    "description": "PURA D’OR Hair Thinning Therapy Conditioner is the original top selling formula we created to target hair thinning, now clinically shown to help with so much more! This multi-tasking Premium Plant-Based formula helps increase luster, moisture, manageability and strength while it helps reduce frizz, dryness, breakage and dullness. This power ful blend utilizes the bene ts of premium organic ingredients to keep hair looking healthy and is free of all harmful chemicals in our newly expanded “No No” List. DECOLORIZED ALOE BARBADENSIS (ALOE VERA) LEAF JUICE*, CETEARYL ALCOHOL, STEARAMIDOPROPYL DIMETHYLAMINE, LIMNANTHES ALBA (MEADOWFOAM) SEED OIL, HYDROGENATED ETHYLHEXYL OLIVATE, HYDROGENATED OLIVE OIL UNSAPONIFIABLES, POLYQUATERNIUM-81 (DERIVED FROM PLANT), GUAR HYDROXYPROPYLTRIMONIUM CHLORIDE, HYDROXYETHYLCELLULOSE, GLYCERIN, ORYZA SATIVA (RICE) BRAN EXTRACT, HELIANTHUS ANNUUS (SUNFLOWER) EXTRACT, ARGANIA SPINOSA (ARGAN) KERNEL OIL*, EMBLICA OFFICINALIS (INDIAN GOOSEBERRY) FRUIT EXTRACT, NIGELLA SATIVA (BLACK CUMIN) SEED OIL, CEDRUS DEODARA (CEDARWOOD) BARK OIL, HIBISCUS SABDARIFFA (ROSELLE) FLOWER EXTRACT, CAMELLIA SINENSIS (GREEN TEA) LEAF EXTRACT, URTICA DIOICA (NETTLE) LEAF EXTRACT, PRUNUS AFRICANA (PYGEUM) BARK EXTRACT, BETA-SITOSTEROL, ROSMARINUS OFFICINALIS (ROSEMARY) LEAF OIL*, POLYGONUM MULTIFLORUM (HE SHOU WU) ROOT EXTRACT, SERENOA SERRULATA (SAW PALMETTO) FRUIT EXTRACT, SOY ISOFLAVONE (NON-GMO), GLYCINE SOJA (SOYBEAN) STEROLS, LECITHIN, CUCURBITA PEPO (PUMPKIN) SEED OIL, NICOTINIC ACID (NIACIN), BIOTIN (VITAMIN H), CAPSICUM FRUTESCENS (CAYENNE) FRUIT EXTRACT, PYRUS MALUS (APPLE) FRUIT EXTRACT, MALUS DOMESTICA (APPLE) FRUIT STEM CELL, COPPER TRIPEPTIDE-1, CATALASE ENZYME, CAFFEINE, CAPRYLIC/CAPRIC TRIGLYCERIDE, LINOLEIC ACID, STEARYL GLYCYRRHETINATE, MEADOWFOAM ESTOLIDE, MICROCOCCUS LYSATE, GANODERMA LUCIDUM (MUSHROOM) STEM EXTRACT, POTASSIUM SORBATE AND SODIUM BENZOATE (FOOD GRADE PRESERVATIVES), PHOSPHOLIPIDS, PLANKTON EXTRACT, RETINOL (VITAMIN A), PANTHENOL, TOCOPHEROL (VITAMIN E), JASMINE GRANDIFLORUM (JASMINE) FLOWER OIL, VANILLA PLANIFOLIA (VANILLA) FRUIT OIL, CITRIC ACID (DERIVED FROM CITRUS FRUITS).",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 120.0,
        "length": 280.0,
        "width": 280.0,
        "height": 740.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Vpl%2B7fS7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Cjmq3dTiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HEiyfEYDL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51cgBP8R4VL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RxNletnmL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51oHP9QBBHL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41n64LaOHUL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11057241",
            "title": "Hair Care"
        },
        {
            "node": "10666241011",
            "title": "Hair & Scalp Care"
        },
        {
            "node": "11057431",
            "title": "Hair & Scalp Treatments"
        }
    ],
    "similar": [
        "B012P630DA",
        "B07BN4WS8L",
        "B01E7TQUF8",
        "B072Y3VZBW",
        "B007TC0HIC",
        "B00KU8FYN0",
        "B01DQ09EYS",
        "B074WZJDLZ",
        "B079DKWC7S",
        "B076YPNBBR",
        "B013X3IAU2",
        "B075YMZDGT",
        "B00FH692PQ",
        "B00GMAWI66",
        "B01DPZP4ES",
        "B01GW3R9NY",
        "B013CV31VS",
        "B01GGQR2DO",
        "B01ENCBOA0",
        "B07CHNQH5V",
        "B01J7VVQ3W",
        "B0793L5922",
        "B0079R6BD2",
        "B01DPZ71NA"
    ],
    "rating": null
}