{
    "asin": "B01G2UU3DK",
    "title": "PeakPlus Best Car Air Purifier Ionizer Freshener Removes Dust, Pollen, Smoke, Odor, Cigarette Smell, Bacteria, Virus – Helps Allergies Ideal for Your Automobile, RV or Truck. Grey",
    "brand": "PeakPlus",
    "feature": [
        "✔ Latest Air Purification Technology - Most powerful car air purifier ionizer releases 4.8 million negative oxygen ions per cm³ to charge the air to keep it clean, fresh and pure.",
        "✔ More Features – Eliminates smoke, odor, pet and cigarette smell - Kills bacteria, viruses and mold -Freshens air - Dissolves smoke, dust, harmful gas particles and PM2.5 air pollutants - Ideal for passengers with allergies and breathing problems.",
        "✔ No Filter Needed - Unlike vacuum HEPA air purifier freshener, this automobile ionic air purifier doesn’t require filter and destroys odor-causing particles and improves air quality instead of masking odors like normal perfumed air fresheners.",
        "✔ Easy to Use, Fashionable Design – Just plug directly into the 12V cigarette outlet and leave it there. It looks perfect as a cool and stylish car accessory with blue LED light.",
        "✔ Quality Assurance, Perfect Gift: Product certifications such as FCC, CE and RoHS certified and approved. Full kit comes with a metal case box. (FCC – Federal Communications Commission; CE – European conformity marking indicates compliance with relevant European health safety and environmental protection legislation requirements; RoHS – Restriction of Hazardous Substances)"
    ],
    "description": "Our employs the latest air purification technology to release 4.8 million negative ions per cm³, a huge capacity to remove odor, smoke, dust, pollutants and freshen up the air. The car air purifier ionizer releases negative ions that will charge the small and microscopic particles such as dust, dander, bacteria, virus, pollen, mold, smoke, chemical vapors and allergens and remove them including PM2.5 particles from the air. It kills bacteria, virus and eliminates odor left behind by perspiration, pets, food, exhaust, benzene, formaldehyde, leather smell, harmful and poisonous gases and cigarette smoke. Fresh air is lacking around us and most people experience dizziness, chest tightness and fatigue easily in places with poor air quality. Negative ions promote and boost metabolism, relieve fatigue and offers refreshing air to us. The car air purifier and ionizer is effective in relieving car sickness, nausea and sleepiness. Simply plug the device into the car cigarette lighter. The blue LED indication light will be on when the device is working. The device will work continuously until it is unplugged. Usage: Perfect for car, truck or RV; also suitable indoors within a house and office Effective Radius: Effective in enclosure or a room up to max 15 m³ (150 sqft) Anion Density: 4,800,000 pcs/ cm³ Working Temperature: -10℃ - 40℃ (10℉ - 104℉) Storage Temperature: -20℃ - 60℃ (10℉ - 140℉) Product Dimensions: 3.93” x 1.22” x 1.22” Net Weight: 40gGive us a try! We are confident you will love it!",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 390.0,
        "width": 120.0,
        "height": 120.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51QC5LcPTAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kxNL8NT7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61tgiH1OfqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41z-Imgo6cL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ef%2BhsuoML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/417ok8yqcwL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "3206324011",
            "title": "Heating, Cooling & Air Quality"
        },
        {
            "node": "267554011",
            "title": "Air Purifiers"
        },
        {
            "node": "3737451",
            "title": "Travel-Size Air Purifiers"
        }
    ],
    "similar": [
        "B078HN3Y4J",
        "B004BOH6BM",
        "B07644QXBB",
        "B07GNBJVZG",
        "B01N6SKSMF",
        "B07B24J9BG",
        "B0772QH6F9",
        "B01BPQPW96",
        "B01IJNJAZ0",
        "B07C182PC8",
        "B075QDW44D",
        "B0057IKJPQ",
        "B0784TYRZY",
        "B079ZL2GHP",
        "B074MZ6S13",
        "B0099K6OVQ",
        "B012CDEMFG",
        "B076X2FJ5X",
        "B06XWG7H3S",
        "B00OXLVZHY",
        "B0785X2TPX",
        "B00NHR6VTC",
        "B008XNZZ7O",
        "B074R8FW7D",
        "B01D3TQHUQ"
    ],
    "rating": "3.6"
}