{
    "asin": "B01G9A4LAE",
    "title": "AuraGlow Teeth Whitening Gel Syringe Refill Pack, 44% Carbamide Peroxide, (3x) 5ml Syringes",
    "brand": "AuraGlow",
    "feature": null,
    "description": "If you're reading this, you most likely have stained or yellow teeth, whether it be from the consumption of coffee, soda, wine, smoking or something else. Did you know whiter teeth can can make you look 10 years younger, and also more attractive? That’s right, whiter teeth can lead to a better personal and social life, as well as advance you in other aspects of your career and relationships. Finally, you can achieve that whiter smile with this whitening gel pack that safely removes years of stains from your teeth, in just 30 minutes per day — without the high dentist price tag. Gel refill pack contains 3x 5mL syringes with a total of 30 treatments (10 per syringe). The gel can be used with a mouth tray (not included) or painted onto the teeth and worn for 30 minutes per day. Recommended use is for 7-10 days or until your desired whitening results are achieved. Our whitening gel is made in the USA in compliant facilities with safety and high-quality standards in mind. Our gels are trusted by dental professionals, and used in various practices throughout the country for at-home and chairside whitening. Remove the cap from the gel syringe and fill a mouth tray (not included) on the top and bottom with a total of 0.5mL of gel. Alternatively, you may dispense the gel into a small dish and paint it onto each tooth. Wear for 30 minutes per day for best results. Shorter whitening sessions may also be conducted for maintenance and touch ups. Recap the syringe until your next treatment and use until empty. Store in a cool, dry place.",
    "price": 2199.0,
    "listPrice": 3699.0,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51ICDwW0u9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31zTU407YrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51T0CAHwWWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31H3houutqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512IU8cgcIL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "10079992011",
            "title": "Oral Care"
        },
        {
            "node": "3778441",
            "title": "Teeth Whitening"
        }
    ],
    "similar": [
        "B01FMXGEOA",
        "B078PRS3T4",
        "B07G5VF15Y",
        "B004HLSK8W",
        "B001OOLLVS",
        "B00AHAWWO0",
        "B071KXMD18",
        "B01B1X3I1W",
        "B01N7Y5P9D",
        "B015RLZ14G",
        "B00MAS0384",
        "B004VEZ1LY",
        "B07D4G7LX4",
        "B00YI5VJW6",
        "B072M239FB",
        "B01LWQDM4I",
        "B00NENWQF2",
        "B00JOW50I2",
        "B077YCC84H",
        "B06Y63G78C",
        "B0051B5IV4",
        "B078SBSP25",
        "B01FMXGJKE",
        "B004BLXG5U",
        "B015TJ56EG",
        "B0756MBL5Y",
        "B071CDW6DH",
        "B01MQ2BHL6",
        "B00GYKRV0W",
        "B011WDCLAU"
    ],
    "rating": "4.2"
}