{
    "asin": "B01G0X56YU",
    "title": "Magnetic Mount, WizGear [2 Pack] Universal Air Vent Magnetic Car Mount Phone Holder, for Cell Phones and Mini Tablets with Fast Swift-Snap Technology, with 4 Metal Plates",
    "brand": "WizGear",
    "feature": [
        "2 PACK AIR VENT MOUNTS: This Air vent universal smartphone magnetic car mount holder is 10 times easier to use than any other magnetic car mount holder due to its simple and complementary design. It has a sturdy rubber base and a powerful magnetic head for holding smartphones. Car Mount iPhone 6, Car mount iphone 6 plus, Car mount holder",
        "STURDY WIZGEAR AIR VENT: This high quality rubber construction of the base of the mount is unique and very functional as well. It guarantees that the base of the mount will solidly hold the magnetic head of the mount, to help keep your smartphone in place, regardless of road vibrations or impacts.",
        "SWIVELS YOUR DISPLAY: Rotate your smartphone and swivel your display as you please. The base of the mount remains fixed into the air vent of your car and does not move, no matter how much swiveling or rotation you do. This guarantees that your smartphone will always remain in your preferred position.",
        "WIZGEAR COMPLEMENTARY DESIGN: The complementary WizGear design of the magnetic mount is one that fits in to the back of any smartphone. The magnetic mount is has a smooth surface that is perfectly suitable for mounting and holding any smartphone in place.",
        "POWERFUL WIZGEAR MAGNETIC PHONE MOUNT: The reinforced magnetic phone car holder of this mount is what sets it apart from other mounts. This Universal magnetic holder produces an intensive force of attraction that will hold any smartphone. phone holder for car, car phone mount, cell phone holder for car, phone holder, car phone holder, phone car mount."
    ],
    "description": "WizGear Universal Air Vent Magnetic Phone Car Mount Holder Phone Holder For Cars Setting your cell phone in a car mount in your car has never been easier! WizGear Air Vent Car Mount for smartphones saves you the hassle of placing your smartphone securely to make sure it doesn’t fall just push it into the air vent ! The WizGear Magnetic Air Vent Mount features a magnetic technology, which means your smartphone will be secure and have no chance of falling. When a phone is secure in place, it becomes easier to use for GPS navigation too. Features1) This phone magnetic car mount holder for cell phones is not bulky or space consuming at all. You no longer need to suffice for keeping your phone in the cup holder or dashboard, because a normal car mount gets in the way. This magnetic car mount inserts into the Air Vent, thereby not blocking your windshield. 2) Navigation is extremely easy with this magnetic car mount. It can easily rotate, fix, or tilt to any angle that best assists the viewer of the phone. 3) The magnetic technology is safe to use, and will not harm any smartphone. The carbon steel plates inside the magnetic car mount are ultra thin and designed in a way that it provides powerful holding power as well as absorbing magnetic instability. Along with being safe, it is also powerful, it attracts any phone to it quickly – this is the auto-mount feature. The user can just bring the phone near the mount and it will take it easily, so the user no longer has to fuss about with safekeeping their phone Instructions how to set up the Car Mount1)Insert the mount in the Air Vent Mount in your car. 2) Place the magnet metal plate in your case between the cover and the phone, Or stick on the round magnet metal on your phone or GPS 3) And your phone is good to go!",
    "price": 899.0,
    "listPrice": 1998.9999999999998,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 409.99999999999994,
        "width": 330.0,
        "height": 150.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51n4Oqp0EwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41kmwdrA0YL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41FPttfMbLL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41RccGg-D0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41bljVbYCuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41nDkSo84IL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41St5gokf7L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407759011",
            "title": "Car Accessories"
        },
        {
            "node": "7072562011",
            "title": "Car Cradles & Mounts"
        }
    ],
    "similar": [
        "B07FCW45L3",
        "B07GXHSW7C",
        "B0158H6CTM",
        "B0798TKC7T",
        "B07DJ6DRYG",
        "B012EI4J3O",
        "B06XPFKZTX",
        "B07FDV8V8D",
        "B01B6K2GDQ",
        "B01F7KNJDM",
        "B074DCZ39S",
        "B077MTNV41",
        "B00O2HYV7K",
        "B07FPHX5QX",
        "B00PGJWYJ0",
        "B074VYPHHV",
        "B06XRNB5HF",
        "B07CWCVNNH",
        "B0773F8S74",
        "B019RSSPZC",
        "B00ISGCAJM",
        "B00I608BJ8",
        "B07D5S8NTM",
        "B07G824TK9",
        "B071CJS4SW",
        "B01M0DUVZV",
        "B01DBAVFI6",
        "B07F1XBS5W",
        "B01M8PQ4PB"
    ],
    "rating": "4.3"
}