{
    "asin": "B01GSTR6Z8",
    "title": null,
    "brand": "Boldify",
    "feature": [
        "INSTANTLY THICK, VOLUMINOUS HAIR - IN 60 SECONDS! - Just spray through damp hair then dry for incredible thickness and hair volume - Gives you a layered textured finish with a light hold that looks great and lasts the entire day - The ultimate hair volumizer for fine hair",
        "UNIQUE NON-STICKY FORMULA - Our super light weight formula wont leave a sticky buildup in your hair and wont weigh it down like other products can - A hair texture spray + volume spray without gunky residue - This thickening tonic + hair texturizer washes out easily with water or shampoo",
        "MAKES HAIR EASIER TO STYLE - Perfect for use as a pre-styler as it gives a light hold, natural definition and effortless finish - A volumizing spray + hair thickener versatile enough to suit all hair types and styles, it's the professional stylist's secret weapon for achieving great looking styles that are easy to manage",
        "INSTANTLY THICK, VOLUMINOUS HAIR - IN 60 SECONDS! - Just spray through damp hair then dry for incredible thickness and hair volume - Gives you a layered textured finish with a light hold that looks great and lasts the entire day - The ultimate hair volumizer for fine hair",
        "UNIQUE NON-STICKY FORMULA - Our super light weight formula wont leave a sticky buildup in your hair and wont weigh it down like other products can - A hair texture spray + volume spray without gunky residue - This thickening tonic + hair texturizer washes out easily with water or shampoo",
        "MAKES HAIR EASIER TO STYLE - Perfect for use as a pre-styler as it gives a light hold, natural definition and effortless finish - A volumizing spray + hair thickener versatile enough to suit all hair types and styles, it's the professional stylist's secret weapon for achieving great looking styles that are easy to manage",
        "GREAT FOR YOUR HAIR - Packed with minerals and nutrients to promote healthy hair - Absorbs excess oil and moisture to keep your scalp clean and healthy - One of the best volumizing hair products for hair health",
        "RESULTS GUARANTEED – 100% USA MADE - NO HARMFUL CHEMICALS: We craft every volumizing hairspray formulation in our USA, GMP, FDA approved lab - without Parabens, Alcohol or Sulfates – and we never test on animals. Rest assured you’ll see thicker hair from this PURE, POTENT, SAFE hair thickener spray for women and men or we’ll refund you every penny – no questions asked."
    ],
    "description": null,
    "price": null,
    "listPrice": 2495.0,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01DPZ7F9U",
        "B01DPZ8XNW",
        "B01DQ0AM94",
        "B06XCB3SHZ",
        "B06XZWKSY3",
        "B01DQ035EI",
        "B075GFDK5X",
        "B01DQ0APNC",
        "B00T6FNWLY",
        "B072B9YP3R",
        "B01DPZ7752",
        "B01G4NMIZG",
        "B01GMR2FO8",
        "B01FNMH4TY"
    ],
    "rating": null
}