{
    "asin": "B01GEW27DA",
    "title": "Fire 7 Tablet with Alexa, 7\" Display, 8 GB, Black - with Special Offers",
    "brand": "Amazon",
    "feature": [
        "The next generation of our best-selling Fire tablet ever - now thinner, lighter, and with longer battery life and an improved display. More durable than the latest iPad",
        "Beautiful 7\" IPS display with higher contrast and sharper text, a 1.3 GHz quad-core processor, and up to 8 hours of battery life. 8 or 16 GB of internal storage and a microSD slot for up to 256 GB of expandable storage.",
        "Just ask Alexa for quick access to the information and entertainment you want. Ask questions, play music, check your calendar, get the news, weather, and more.",
        "The next generation of our best-selling Fire tablet ever - now thinner, lighter, and with longer battery life and an improved display. More durable than the latest iPad",
        "Beautiful 7\" IPS display with higher contrast and sharper text, a 1.3 GHz quad-core processor, and up to 8 hours of battery life. 8 or 16 GB of internal storage and a microSD slot for up to 256 GB of expandable storage.",
        "Just ask Alexa for quick access to the information and entertainment you want. Ask questions, play music, check your calendar, get the news, weather, and more.",
        "Ask Alexa to call or message almost anyone, or make video calls to family and friends with a Fire tablet, Echo Spot, Echo Show, or the Alexa App. Instantly connect to enabled Echo devices.",
        "Enjoy millions of movies, TV shows, songs, Kindle eBooks, apps and games - including Netflix, Facebook, HBO, Spotify, and more.",
        "Prime members get unlimited access to over a thousand books and magazines, millions of songs, and thousands of movies and TV episodes - at no additional cost.",
        "Watch downloaded videos anywhere with a Prime membership, Netflix plan, or Showtime subscription."
    ],
    "description": "The all-new Fire 7 tablet is the next generation of our best-selling Fire tablet ever - now thinner, lighter, with longer battery life and an improved 7\" IPS display. Tiny price. Big fun. Fast and res ...",
    "price": 4999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 90.0,
        "length": 760.0,
        "width": 450.0,
        "height": 40.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01IQD8T0K",
        "B01IQD8PIG",
        "B013TMNKAW",
        "B01J90MSDS",
        "B01N0HGPJR",
        "B01J6RPGKG",
        "B01IQD8R7U",
        "B0725SCRZL",
        "B01J94TEAE",
        "B01IO618J8"
    ],
    "rating": null
}