{
    "asin": "B01GGNWZ1G",
    "title": null,
    "brand": "Bitly",
    "feature": [
        "✅#1 RATED ANKLE COMPRESSION SOCKS; is foot pain from plantar fasciitis limiting your athletic or daily performance? The Bitly Socks for Plantar Fasciitis offer premium support with all the benefits of an ankle sleeve for fast healing!",
        "✅IMPORTANT: Refer to sizing chart included in the image section to get your right size socks. RANGE OF SIZES and COLORS; Easily locate the perfect size & color, our ankle support for men and women are available in small medium and large, allowing you to find the perfect support sock that won't slip or slide to offer the best foot and ankle support!",
        "✅SUPER PREMIUM QUALITY; forget buying a cheap copper ankle sleeve, our Plantar Fasciitis Sock offer the best support for plantar fasciitis and can help with swelling feet for the best Plantar Fasciitis Sock on the market!",
        "✅#1 RATED ANKLE COMPRESSION SOCKS; is foot pain from plantar fasciitis limiting your athletic or daily performance? The Bitly Socks for Plantar Fasciitis offer premium support with all the benefits of an ankle sleeve for fast healing!",
        "✅IMPORTANT: Refer to sizing chart included in the image section to get your right size socks. RANGE OF SIZES and COLORS; Easily locate the perfect size & color, our ankle support for men and women are available in small medium and large, allowing you to find the perfect support sock that won't slip or slide to offer the best foot and ankle support!",
        "✅SUPER PREMIUM QUALITY; forget buying a cheap copper ankle sleeve, our Plantar Fasciitis Sock offer the best support for plantar fasciitis and can help with swelling feet for the best Plantar Fasciitis Sock on the market!",
        "✅SUPER COMFORTABLE HYGENIC FABRIC; Comfortable to wear all day! Made from moisture wicking breathable fabric that won't trap odours, to provide all day relief from plantar fasciitis, foot pain and swelling! Click the orange button to order now!",
        "✅INNOVATIVE DESIGN AIDS RECOVERY; the braces for plantar fasciitis are made with the best compression and sport technology! The Bitly ankle support offer targeted compression for premium foot and ankle support to stimulate healing blood flow to speed recovery!"
    ],
    "description": "✅IMPORTANT: Refer to sizing chart included in the image section to get your right size socks. Measure your foot circumference or shoe size and choose the corresponding size. Again, refer to the sizing ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 2.0,
        "length": 600.0,
        "width": 400.0,
        "height": 100.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01MFEBO3V",
        "B01F1L6YDO",
        "B01LYJ706O",
        "B007S8XYAA",
        "B01M99IVNY",
        "B00IK032Q6",
        "B07BBKRGCD",
        "B07FMCBY8Y",
        "B07DCCPTS3",
        "B01MQ2KA8N"
    ],
    "rating": null
}