{
    "asin": "B01G8JO5F2",
    "title": null,
    "brand": "Senso",
    "feature": [
        "TRUE HD HIGH FIDELITY SOUND Featuring latest Bluetooth 4.1 CSR technology and state of the art acoustic components that produce incredible sound quality with deep bass and crystal clear treble.",
        "COMFORTABLE AND SECURE FIT WITH IPX-7 WATERPROOF RATING - ActivBuds feature Ergonomically designed flexible ear hooks with gel flex silicone earbuds to ensure your headphones stay comfortably firm in place to guarantee fatigue free ears and tangle free comfort.",
        "LONGEST BATTERY LIFE - The new and improved lithium polymer battery allows seamless enjoyment of music for up to 8 hours and 240 hours stand-by with a quick charge of only 1.5 hours.",
        "TRUE HD HIGH FIDELITY SOUND Featuring latest Bluetooth 4.1 CSR technology and state of the art acoustic components that produce incredible sound quality with deep bass and crystal clear treble.",
        "COMFORTABLE AND SECURE FIT WITH IPX-7 WATERPROOF RATING - ActivBuds feature Ergonomically designed flexible ear hooks with gel flex silicone earbuds to ensure your headphones stay comfortably firm in place to guarantee fatigue free ears and tangle free comfort.",
        "LONGEST BATTERY LIFE - The new and improved lithium polymer battery allows seamless enjoyment of music for up to 8 hours and 240 hours stand-by with a quick charge of only 1.5 hours.",
        "BLUETOOTH V4.1 WIRELESS TECHNOLOGY WITH CVC 6.0 NOISE SUPPRESSION TECHNOLOGY - Connect seamlessly with all Bluetooth enabled devices up to 30 feet away. With Noise Suppression technology focus on your favorite music and answer calls without skips or missed words.",
        "1 YEAR WARRANTY AND BONUS ITEMS - Bonus Accessories with 1-Year Manufacturer's Warranty and 30 days no-questions-asked return policy. Value for money guaranteed, Buy the Senso ActiveBuds worry free today."
    ],
    "description": "Brand: Senso Model: ActivBuds S-250 Color: Black WHY THE SENSO ACTIVBUDS S-250 IS THE BETTER CHOICE IN BLUETOOTH HEADPHONES? - TRUE HIGH DEFINITION SOUND Enjoy Stereo Sound with High Definition and un ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 490.00000000000006,
        "width": 470.0,
        "height": 130.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B06XGBGRLC",
        "B010OYASRG",
        "B073DR5ZWS",
        "B01L160DLW",
        "B0792QJQT1",
        "B06XHBD8Y8",
        "B074WQ33Y3",
        "B076WW24G3",
        "B00SXRXUFE",
        "B077P2KSF2",
        "B077GT6NG9",
        "B076Q3QW92",
        "B018XI3ASO",
        "B07D3NS9TQ",
        "B075NRNZWD",
        "B0753GRNQZ",
        "B07GH2KX7Y"
    ],
    "rating": null
}