{
    "asin": "B01GQTWL5U",
    "title": "Henry Jay Mens 23K Gold Plated Two Tone Stainless Steel \"Specialty Aquamaster\" Professional Dive Watch with Date (Amazing Christmas Gift)",
    "brand": "Henry Jay",
    "feature": [
        "Mens stainless steel watch with polished silver tone round case & stainless steel screw down case back",
        "Matte finish electric blue dial watch with magnifying date window, stainless steel unidirectional bezel with gold tone markings and coin edge detailing",
        "Solid stainless steel links with 23k gold-plated center links and stainless steel push button deployant clasp with safety clasp",
        "Polished stainless steel unidirectional ratcheting gold tone coin-edge bezel with gold center fill, protective and scratch resistant mineral crystal, Henry Jay specialty miyota quartz movement",
        "Professional diver watch water resistant to 10 ATM 100 Meters/330 Feet with stainless steel screw down crown"
    ],
    "description": "Classic styling and high performance add up to an outstanding sport watch for your land or sea adventures. This two-tone luxury watch, from Henry Jay’s Aquamaster series, places a large round steel case on a robust stainless steel bracelet with 23K gold-plated center links. The electric blue dial is designed for quick and easy read-off, even in low light conditions. It offers three-hand function with luminous hands and markers and a magnified date display at the three o'clock position. The detailed hands and logo shapes, add a note of distinction. The dial is capped with a resilient protective & scratch resistant mineral crystal and framed by a blue unidirectional rotating steel bezel with gold tone markings and coin edge detailing. This watch is driven by a Henry Jay Specialty Japanese movement. It is rated water resistant to a full 100 meters/330 Feet. Henry Jay is an extraordinary company which has revolutionized watchmaking since its creation. But what really sets Henry Jay apart is the exceptional quality of its aquamaster dive watches, of which we as a company are immensely proud. Reliable and robust, these objects are a joy to own and wear, and they form part of our everyday lives. Our company has created a name for itself by producing irresistible timepieces that convey a sensation of power while remaining affordable. Attracting consumers is a challenge that I am delighted to be taking up together with a team who is passionate about what they do and highly committed to their company. Our aim is to show that true quality lasts forever and that that's what differentiates Henry Jay timepieces from other objects which inevitably become obsolete over the years. The world of Henry Jay is closely connected to extreme water sports, but its appeal extends much further: its masculine styling speaks to intrepid women; its collections that are waterproof to 100+ meters perfectly meet the demands of yachting and surfing alike.",
    "price": 7998.999999999999,
    "listPrice": 19900.0,
    "prime": true,
    "dimensions": {
        "weight": 80.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51nBUAOYi9L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51efFfx1zdL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51aZDnxNq3L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CGreJN37L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-nqF9OUOL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HXMWDN3YL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41EyOF64MqL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B01CRE4GRO",
        "B000GX3IKK",
        "B00J4JKTZY",
        "B077ZDL22J",
        "B00KJ30800",
        "B0756Q5WQL",
        "B01CRDYZ26",
        "B072N661WP",
        "B000JQJS6W",
        "B07665RCL5",
        "B00K6KAKQI",
        "B01N6KIO7Z",
        "B01NAMTZSZ",
        "B001E96DHA",
        "B06Y3L2SYX",
        "B01N6I7VKI",
        "B005FN11HS",
        "B007HN96KI",
        "B0786TVWCT",
        "B01N7QIT9N",
        "B01FLLJ6IE",
        "B00IJTG8UA",
        "B00MOTT0RO",
        "B000AYTYLW",
        "B019XM8KGG",
        "B01CLLAURS",
        "B000JQJS6M",
        "B07657P1FN",
        "B01DPXDTMY"
    ],
    "rating": "4.1"
}