{
    "asin": "B01HGM33HG",
    "title": "AKASO EK7000 4K WiFi Sports Action Camera Ultra HD Waterproof DV Camcorder 12MP 170 Degree Wide Angle",
    "brand": "AKASO",
    "feature": [
        "4K Ultra HD Action Camera. Professional 4K 25fps & 2.7K 30fps video with 12MP photos at up to 30 frames per second for incredible photos, which is 4 times the resolution of traditional HD cameras.",
        "Wireless Wrist Remote Control Sports Camera. With a wrist 2.4G remote, you can capture the world in an all-new way. Controlling the camera, framing shots or recording video is convenient.",
        "Longer Battery Life. AKASO EK7000 action camera comes with 2 rechargeable 1050mAh batteries. Each battery can record up to 90 minutes. No more worry about the recording time for this action camera.",
        "Built-In WIFI & HDMI, edit & share your action in minutes. Just download App(iSmart DV) on your phone or tablet and connect with this action camera. Wi-Fi signal ranges up to 10 meters.",
        "100 feet waterproof camera. AKASO EK7000 is designed to withstand extreme environments, together with durable waterproof case. With the accessories, transform it for indoor and outdoor activities."
    ],
    "description": "Professional Video QualityAKASO EK7000 features ultra HD 4K video recording. You can capture stunning 4K 25fps/2.7K 30fps/1080P 60fps videowhich is sharper and more lifelike than ever. High-resolution, high frame rate 4K 25fps and 2.7K 30fps video deliversdistinctly smooth video.Fast, Powerful Photo CaptureWith 12MP Burst photos at a blistering 30 frames per second, AKASO EK7000 Camera helps you capture the momentsyou don't want to miss. Capture single photos, Burst photo or choose Time Lapse mode to shoot photos automaticallyat set time intervals from 0.5 to 60 seconds.Control, View and Instantly Share with Built-in WiFiBe able to captures the 170 degree wide angle perspective, AKASO EK7000 features built-in Wi-Fi, allowing you to connectto the smart phone, tablet, computer and more to sharing via text, email, Facebook, Twitter, and more to your friends,family or followers . The built-in Wi-Fi can control cameras from distances of up to 50-feet (15-meters).Shift Your Action As You LikeUse the remote control of the camera to choose the mode you prefer as you recording. You can shift from video to photo, burst phototo time lapse with just press the button of the remote for super convenience.Note: Micro SD Card of Class 10 is Highly Recommended for 4K Action Camera. AKASO EK7000 Action Camera Can add up to 64GB Micro SD Card. If The camcorder suddenly switches off. The possible causes are: The Auto Power Off function is activated. The battery in the camcorder is empty. Solution: Switch the device on again. Change the battery.What's in the Box:1x AKASO EK7000 Camera1x 2.4G Remote Control2x 1050mAh Battery1x Waterproof Case1x Bicycle Stand7x Mount2x Clip1x Helmet Mounts1x Bandages5x Tethers1 x Protective Backdoor1x USB Cable1x AC Charger1x Lens Cloth1x Manual",
    "price": null,
    "listPrice": 5999.0,
    "prime": true,
    "dimensions": {
        "weight": 140.0,
        "length": 90.0,
        "width": 200.0,
        "height": 150.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51CozYtotxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ddY4%2BgPgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61y48FUTS7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51L7hNQ45yL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51d%2B%2BVve3GL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61QnS7o3z-L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "7161073011",
            "title": "Video"
        },
        {
            "node": "7161074011",
            "title": "Sports & Action Video Cameras"
        }
    ],
    "similar": [
        "B072R4SXTT",
        "B010Q588D4",
        "B06XD5RJ84",
        "B07CXYQMDL",
        "B077YWFCM2",
        "B07467ZX97",
        "B07CKV9FRX",
        "B07B7YPKQX",
        "B06XWLWH6Y",
        "B06XKXFLXW",
        "B00PQ9YNI0",
        "B07F2BDJ5S",
        "B07FL3Z9FG",
        "B01MXXP4EC",
        "B01171X0UW",
        "B06ZZVWT2G",
        "B074319MZZ",
        "B0746P8DT9",
        "B07CN14HCD",
        "B074V28C19",
        "B072LKD859",
        "B01LMVITSA",
        "B00N79YYB2",
        "B07B2W96JH",
        "B0789784SH",
        "B074TQG2SD",
        "B078ZCWPWQ",
        "B076DD5JNS",
        "B01M14ATO0",
        "B016L285HU",
        "B00M3ZW3MI",
        "B079CQPM3J",
        "B07DL7HNPG",
        "B00MB5Z8QS",
        "B01LMVIS18",
        "B06XGCPWQ3",
        "B07856CGVQ"
    ],
    "rating": "4.2"
}