{
    "asin": "B01H2YOB6U",
    "title": "2017 New Updated SADES Spirit Wolf 7.1 Surround Stereo Sound USB Computer Gaming Headset with Microphone,Over-the-Ear Noise Isolating,Breathing LED Light For PC Gamers (Black Red)",
    "brand": "SADES",
    "feature": [
        "LATEST HIGH MAGNETIC NDFEB DRIVER:More clear sound gaming headset, with the strong brass, acoustic positioning precision, you can feel the full force of an explosion, a grenade blast, or a brostep drop.Glaring and breathing LED lights are designed on the earcups and microphone, highlighting the atmosphere of the game.",
        "COMFORTABLE FIT AND CONVENIENCE: In this gaming headphones all contact points are finished in soft but durable materials, and the updated memory foam around each earcup keeps you comfortable for long periods.Line is equipped with a rotary volume controller, one key Mic mute, more convenient to use.",
        "HIGH QUALITY SENSITIVE MICROPHONE: The gaming mic in our SADES headphone is high sensitive and durable. It's crystal clear and well-grounded so it doesn't crackle as you adjust it.",
        "COMPATABILITY: Headset works with PC, Laptop, computer. Notice: Please kindly know that all the products would be checked or tested before shipping out to ensure a good shopping experience.",
        "NOISE CANCELING: Updated closed earcups design in Sades SPIRITWOLF USB version PC Gaming Headset,PLUGS AND PLAY covers your entire ear and cuts out external sound very effectively, and with none of the irritating 'seashell effect' many headsets suffer.Environmental Protection Materials."
    ],
    "description": "Clear sound Perfect for Gaming, MSN, Skype Soft leather ear pads Microphone and Volume control and Mute Switch Perfect for voice recognition USB power direct supply Ear Pads Size: 10*21*20 Color available: Blue Black,Red Black,White Black Model: Spirit Wolf Plug diameter: USB Headset Plug type: straight type Headphone output audio source: PC computer Cable length: 2.0m Wearing styles: wearing ear Headphone type: Wired Whether the microphone: with wheat Sensitivity: 115dB / mW Impedance: 32Ω Frequency Range: 20-20000Hz Compatible Platform: ANDROID Windows Phone iOS Hidden Headsets - deClick - skin-friendly ear - line 2 meters long -3D SurroundSADES Spirit Wolf Gaming gaming headset, speaker displacement by 3D virtual 7.1 sound decoder chip to achieve 7.1-channel effects audio output stable, sound and accurate positioning, can capture faint sound change and achieve the voices tell the position. This USB gaming headset doesn't support PS3 , PS4 or XBOX 360/ONE games. This USB gaming headset is compatible with mac but the driver for 7.1 sound is not compatible with. 1 x Gaming Headset in colorful gift-box 1 x User manual （English and Chinese） 1 x CD driver1.One month return and one year warranty service in Smart@Purchase Shop.2.Your most satisfaction,our all goal.Just contact us if you have any problem,we will be here with you in any time.",
    "price": 2599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 110.00000000000001,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51aRUHKpW%2BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RPC1gp7DL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41GZzGHcA9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sVVMhnhrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Ds7pAvTqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41iaFcO1SLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51MrAxhoRCL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "468642",
            "title": "Video Games"
        },
        {
            "node": "229575",
            "title": "PC"
        },
        {
            "node": "318813011",
            "title": "Accessories"
        },
        {
            "node": "402053011",
            "title": "Headsets"
        }
    ],
    "similar": [
        "B07DXLH9DJ",
        "B01H2YOA3O",
        "B012MET1ZQ",
        "B07B3QJBM3",
        "B073J22WYV",
        "B016MAK38U",
        "B01N4G6CM6",
        "B01E8RSWFU",
        "B01LYNEIEI",
        "B078P11DJK",
        "B0795DH7GP",
        "B00HTK1NCS",
        "B074W8GXVC",
        "B07DL1R2TC",
        "B07DNTTC24",
        "B07FT72M3X",
        "B07DMXPCYD",
        "B01E8RSFF2",
        "B06WGVJ9GY",
        "B07FZZKLBQ",
        "B07C4V1LWB",
        "B01A73ZIL0",
        "B073VJYCCY",
        "B01E8RS598",
        "B01A0VQOCQ",
        "B01M16Y46E"
    ],
    "rating": null
}