{
    "asin": "B01HHNN8ZG",
    "title": "Tatara Sharpening Stone 3000 & 8000 Grit - Double Sided Japanese Whetstone Set For Knives - Axe Sword & Chisel Sharpener with Non-Slip Bamboo Base and Free Honing Angle Guide",
    "brand": "Tatara",
    "feature": [
        "Knife sharpening stone set helps you slice through anything with ease when you have a truly razor-sharp tool using your knife chisel sword and axe sharpener.",
        "Made from professional grade Aluminum Oxide, so expensive oil is NOT required; just use some water and you're good to go. Works better than a diamond sharpening stone for knives.",
        "Non-slip bamboo holder keeps honing stone secure so you never have to worry about the Japanese whetstone slipping off the counter.",
        "Whetstone knife sharpener makes all your blades last longer - use the coarse 3000 grit to prep and smoothen the blade then finish honing and polishing with the 8000 side.",
        "Enjoy our 100% Satisfaction Guarantee: sharper blades or your money back. Also get a FREE sharpening guide when you order today so Click Add to Cart and Buy Now!"
    ],
    "description": "Slice through anything with ease and achieve the real precision of a pro when you have a truly razor-sharp knife, chisel, or axe.Knife sharpening stone made from professional grade Aluminum Oxide, so expensive oil is NOT required; just use some water and you're good to go!The non-slip bamboo holder keeps everything secure so you never have to worry about it slipping off the counter. Japanese sharpening stone set makes all your blades last longer - use the coarse 3000 grit to prep and smoothen the blade then finish honing and polishing with the 8000 side. When you order our Japanese sharpening stones set today, you'll also receive a free angle guide to help you effortlessly maintain a consistent angle while honing. Perfect for the kitchen and outdoors: both professional chefs and outdoors experts will appreciate these whetstones! Also great for survival, outdoor tasks, chisels, and axes. See product images for details. \"Everything is so much easier when you use properly sharpened implements\"",
    "price": 3499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 190.0,
        "length": 710.0,
        "width": 120.0,
        "height": 240.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/4198YV0df4L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51w12JUJZWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xkp2F7H%2BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HPCIbvCPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61lkLnjxdfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dddSv3a9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/516dcItMBOL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "328182011",
            "title": "Power & Hand Tools"
        },
        {
            "node": "551238",
            "title": "Hand Tools"
        },
        {
            "node": "553346",
            "title": "Sharpening Stones"
        }
    ],
    "similar": [
        "B003IT5F14",
        "B01LVZ2OZU",
        "B07BRLS6DK",
        "B07GYZKPKR",
        "B00ULPD5E2",
        "B07GZ3LHMK",
        "B01CMY2HA2",
        "B07GZZT6TS",
        "B01FCPNKX6",
        "B07C9X3F98",
        "B01HHNIB6W",
        "B076DV25F3",
        "B01FPSUSQ2",
        "B001DT1X9O",
        "B01FZZUL30",
        "B00X9KU3GO",
        "B07BQXSBY5",
        "B07214VMGB",
        "B01FKJTLY6",
        "B01KT9US30",
        "B075L3MV2D"
    ],
    "rating": "4.3"
}