{
    "asin": "B01H3Z4QM2",
    "title": "OnePlus 3 / OnePlus 3T Case - Orzly Grip-Pro Case for OnePlus 3 SmartPhone (Original 2016 Model & OnePlus 3T Version) - Durable & Light-Weight Twin Layer Case for Added Grip & Protection - RED",
    "brand": "Orzly",
    "feature": [
        "The Orzly Grip-Pro case is designed to offer increased protection for your device",
        "The hard outer shell features a textured rubberised finish for added grip, while the inner shock absorbing silicone skin creates a durable and more secure barrier around your device",
        "The combination of both layers results in a slim-profile case that offers robust protection for everyday use of your handset without adding excess bulk to your device",
        "Cut-outs and access to all ports, buttons, cameras, microphones, speakers, sensors, cameras and other features without having to remove the case.",
        "COMPATIBLE WITH: Original 2016 Oneplus 3 & New OnePlus 3T. For the full range of Orzly Oneplus 3 accessories, search 'Orzly oneplus'"
    ],
    "description": "ULTIMATE GRIP AND PROTECTION:This case consists of two layers. The coloured textured outer layer does much much more than providing its excellent looks and beauty. This tough outer solid layer is strong and robust enough to protect the back and sides of your phone from much more impact than other cases. The texturing is specially designed to provide superior grip, to stop it slipping out of your hands, whilst also being extremely comfortable to hold. The inner rubberized layer adds extra impact absorption protection. Not only does this case fully protect the back and the sides of your device, but the case has a non-intrusive impact protecting lip at the front, so that your screen stays raised off the ground if ever it were either dropped or placed face down.PORTS AND FEATURE ACCESS:This case provides specially placed cut-outs designed specificaly for this model of phone, so that it provides access to all ports, buttons, microphones, speakers, sensors, cameras and other features without having to remove the case.INSTALLATION INSTRUCTIONS:Installing the Orzly Grip-Pro has never been easier. As the rubberized section is truly flexible, it allows you to easily place the rubberized section on first, so that your phone can be comfortably placed within this inner layer without effort, and without risk of scratching or damaging your phone's buttons. Next, simply clip the solid outer layer around the inner rubberized layer, and it will clip securely and snugly into place, and installation is now complete.WARRANTY INCLUDED:For added peace of mind, this case comes complete with a manufacturer's 2 year warranty against any manufacturing defects on the case.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 26.25,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61nPjpISz1L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ld27aZC3L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418288y728L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61-3OuXP1tL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41oyQbnd0cL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51IPKuvHqfL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "RED for OnePlus 3 / 3T"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B01H7BTSM0",
        "B06XGB4DMC",
        "B00Z7T4ATQ",
        "B01H3Z4PMS",
        "B01H3PEWDK",
        "B01H5LP0WO",
        "B01HFTJJ0A",
        "B01HBLS84A",
        "B01LWOYYYZ",
        "B00Z7T4122",
        "B01H3Z4O2E",
        "B01H0EA1WU",
        "B07BY2394H",
        "B01H3V07EW",
        "B079Z3KDBT",
        "B074TX52PH",
        "B075FKVJV3",
        "B01LZFR11K",
        "B07B4KPFKM",
        "B00WYBFT90",
        "B01LMSP8GY",
        "B01HBLS85Y",
        "B01HFTJJ28",
        "B00NQB7SBO",
        "B01HBQBNCY",
        "B0727V74B9",
        "B00PGJWYJ0"
    ],
    "rating": "3.9"
}