{
    "asin": "B01HN6HPZG",
    "title": "Vitamin B3 & Vitamin C Serum - Gift Set of Two Facial Serums Niacinamide 5% & Vitamin C 20% All Natural Skin Hydrating Pore Minimizer Anti Aging Dark Spot Acne Scar Remover Powerhouse Duo for Face",
    "brand": "Premium Nature",
    "feature": [
        "VITAMIN C & VITAMIN B3: Nourish your skin with these vitamin rich topical supplements that reduce discoloration, brighten skin, produce collagen, repair UV ray damage & contain natural ingredients that are safe for your skin.",
        "ANTI-AGING BENEFITS: Our Vitamin c serum for face and Vitamin B3 face serum will improve skin elasticity and boost circulation and fatty acid levels which plump skin and helps to reduce lines and wrinkles to promote a radiant & youthful glow.",
        "IMPROVES SKIN TEXTURE: This facial serum includes hyaluronic acid, which naturally exists in the skin, and is great for repairing skin damage due to environmental factors, improving moisture & strengthening the skin’s outer layer.",
        "VITAMIN C & VITAMIN B3: Nourish your skin with these vitamin rich topical supplements that reduce discoloration, brighten skin, produce collagen, repair UV ray damage & contain natural ingredients that are safe for your skin.",
        "ANTI-AGING BENEFITS: Our Vitamin c serum for face and Vitamin B3 face serum will improve skin elasticity and boost circulation and fatty acid levels which plump skin and helps to reduce lines and wrinkles to promote a radiant & youthful glow.",
        "IMPROVES SKIN TEXTURE: This facial serum includes hyaluronic acid, which naturally exists in the skin, and is great for repairing skin damage due to environmental factors, improving moisture & strengthening the skin’s outer layer.",
        "FIGHTS FREE RADICAL DAMAGE: These powerful supplements will strengthen skin cells & accelerate healing to help to repair skin that has been exposed to the sun & air pollution, which causes free radical damage. Our Vitamin B 3 and Vitamin C serum with hyaluronic acid are great as a anti aging serum, dark spot remover for face, skin lightening cream, wrinkle cream, acne cream, hyperpigmentation treatment, spot treatment, skin brightening spot corrector, dark spot corrector, acne scar removal.",
        "ALL NATURAL INGREDIENTS: Premium Nature’s skin care products are 100% Natural, Paraben Free, Cruelty Free, and GMO Free! You can use our products completely worry free and reap all the benefits of a sustainable lifestyle."
    ],
    "description": null,
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 43.75,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01BT02Q88",
        "B01GOINCUQ",
        "B01FB8E1HS",
        "B0147PDMYY",
        "B00I80TBHM",
        "B019CNOJTI"
    ],
    "rating": null
}