{
    "asin": "B01HEX7ZOY",
    "title": "Skomet Multi-angle adjustable Phone stand, iPhone stand, cradle, dock, holder iPhone 7 6 6s plus 5 5s 5c charging and Android smartphone devices - Silver",
    "brand": "Skomet",
    "feature": [
        "★ ADJUSTABLE MULTI ANGLE: Features a 270 degree adjustable angle ideal for recording or watching videos and reading at a comfortable angle. The adjustable stand is smooth but firm so your phone will stay at the angle you choose.",
        "★ ANTI SLIP SILICONE: Added protection for your smartphone with the help of an anti slip silicone padding.",
        "★ UNIVERSAL STAND: Compatible with most smartphones. Works with Apple iPhone 7, iPhone 6s, iPhone 6s plus, Samsung Galaxy S5 S6 S7, Sony, LG etc.",
        "★ DURABLE: Quality craftsmanship with a sturdy aluminum body that will last a lifetime.",
        "★ RISK FREE PURCHASE: Buy with Confidence. We've got you covered with our no risk MONEY BACK GUARANTEE. If for any reason you are not satisfied, contact us for a full refund or replacement."
    ],
    "description": "The Skomet phone stand is exactly what you have been looking for! An amazing accessory to your device. ►Adjustable viewing angles for your viewing pleasure ►When you put iPhone 7/ 7 Plus (without case) on this stand, the viewing angle could be adjusted from 40 to 45 degrees, which is suitable for your multiple demand of viewing. ►Compatible with all Mobile Phones, E-Readers and most Tablets (up to 10.1 inch), even with the heavy duty case on. ►You may need 3 stands to meet different demands: One on your desk on check emails, one on your bedside table to enjoy movies and one in the kitchen to enjoy the personal life. ►The generous and simple design makes it fit for totally different occasions. ►Very stable for iPad mini, iPad Air and iPad Pro 9.7 inch Ideal for FaceTime or Skype video calls ►Follow the recipes in your kitchen without worrying about spills damaging your device. ►Adjustable cell phone stands ►Desktop Cell Phone Stand Tablet Stand ►Thickness Aluminum Stand Holder for Mobile Phone ►Risk free purchase ►Colors: Black, Gold, Red, Silver, Clay Purple and Rose Gold",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 310.0,
        "width": 300.0,
        "height": 390.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41c8JpVeorL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418gJAGp3vL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41HIZOCEAOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41HPlzHGkNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/411wbxwCCOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41mu91377GL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "7072563011",
            "title": "Mounts & Stands"
        },
        {
            "node": "7073961011",
            "title": "Stands"
        }
    ],
    "similar": [
        "B076XR2S9Q",
        "B01HEX7ZP8",
        "B07F8S18D5",
        "B074VYPHHV",
        "B07B8C8J3W",
        "B0744DM3Y3",
        "B01MQXYB9T",
        "B07GGN43P8",
        "B07H3TMLM4",
        "B06Y4K2W3B",
        "B01N415JU1",
        "B0183G92S8",
        "B0792FTFZP",
        "B01A80LX9I",
        "B07GNKCNHV",
        "B01KV2Y1X8",
        "B07G94X4S3",
        "B01M4NOUMB",
        "B071CTBNND",
        "B01E8B4V38",
        "B07FYYL2HJ",
        "B077BTJW4C",
        "B01LXK5P86",
        "B06XWKTT4T",
        "B07BHCCQJW",
        "B06XW88HJS",
        "B072JCY5XY",
        "B07BBNSGR6",
        "B01HPI5AM2",
        "B0744GJQS3",
        "B07FKZ8DZX"
    ],
    "rating": "4.6"
}