{
    "asin": "B01I2ISCOW",
    "title": "PowerBear LG G3 Battery (3000 mAh) Li-Ion Battery for The G3 [D852, D855, at&T D850, T-Mobile D851, Verizon VS985, Spring LS990] | LGG3 Spare Battery [24 Month Warranty]",
    "brand": "PowerBear",
    "feature": [
        "HIGH QUALITY GRADE A BATTERY CELLS: This PowerBear LG G3 Battery is manufactured and tested under strict quality control standards. This battery LG G3 will provide you with up to 500 Lifetime Charge Cycles with a high-speed and efficient charge. The best LG G3 battery replacement on the market!",
        "COMPATIBLE WITH ALL WIRELESS CARRIERS: Our battery for LG G3 is compatible all major wireless Carriers for the LG G3 (AT&T, T-Mobile) including the following models: LG G3, D850, D851, D852, D855",
        "REPLACEMENT / SPARE BATTERY G3: Swap out your old G3 battery with a brand New PowerBear battery for G3. With a built in chip to prevent over-charging and over-heating, this LG G3 replacement battery will keep your LG G3 powered.",
        "SPECIFICATIONS: This G3 replacement battery has a capacity of 3000mAh. The Battery type is Lithium Ion, the Voltage is 3.85V.",
        "24 MONTH WARRANTY: This G3 battery replacement if backed by PowerBear's 24 Month Warranty. If you are not 100% satisfied with your LG G3 batteries, just let us know. Customer satisfaction is our #1 priority."
    ],
    "description": "The is not compatible with either NFC or Google Wallet. - This PowerBear spare battery for the is designed to deliver up to 400 hours of charge. - Created from certified Grade A+ battery cells that provides a capacity of 3,000 mAh. - Quality connecters provide optimal connection to your phone. - Quality assurance with state of the art testing. Can withstand drops and impacts in your phone. Safety Guaranteed. - Failproof built-in IC that monitors temperature and input to protect you and your phone. - Built to last with up to 500 cycles. - Compatible Models: LG G3, D850, D851, D855, VS985, LS990 - Battery: 3,000 mAh Li-Ion - Input: 5V == 1A - Output: 3.8V == 1A - Battery Dimensions: 2.9 x 2 x 0.2 inches - Battery Weight: 1.6 ounces- 1 PowerBear Spare Battery for the - 1 User ManualPowerBear aims to reach the highest limits of customer service excellence! If there is ANY REASON why you are unhappy or unsatisfied with ANY of our products, we guarantee you a replacement within 2 years!Keep yourself powered with PowerBear Phone Accessories! We offer top quality products to reliably ensure that you and your phone are always energized. Products include battery cases, extended batteries, spare batteries, cables, and all your power needs. We're dedicated to making your life easier by taking the responsibility of keeping your phone charge away from you. Using PowerBear products will change your life!",
    "price": 1995.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 9.0,
        "length": 290.0,
        "width": 20.0,
        "height": 200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41-fkXDa8sL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41YD-JlCOsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/510Ue4UOwML._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41n3sCXBO4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41LB2XL0OGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BCKV105pL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407758011",
            "title": "Batteries & Battery Packs"
        },
        {
            "node": "7073959011",
            "title": "Replacement Batteries"
        }
    ],
    "similar": [
        "B077ZGRVRX",
        "B00RC9O5ZS",
        "B07F8WVL7N",
        "B0186RR46Q",
        "B01MXGUJYN",
        "B01HQWR8CM",
        "B078NNQ4Q9",
        "B01GFGU6V0",
        "B01EZ2UVGG",
        "B00NWMON56",
        "B00JW7APWU",
        "B07DHDPK2G",
        "B00KGSW734",
        "B07DRGRVML",
        "B072WH19N5",
        "B0755D2K67",
        "B01GFGU3RC",
        "B07F8V93VP",
        "B074W1CGSV",
        "B07GDRKFJT",
        "B00KOIGYS0",
        "B07F8R1DWL",
        "B0783NGLRP",
        "B06Y1QV8NM",
        "B076PTVQ2S",
        "B077YWK1VF",
        "B01LYL0U1W",
        "B01GN0GNWY"
    ],
    "rating": "3.8"
}