{
    "asin": "B01IIF4L9Y",
    "title": "Scratch Off World Map Poster - Travel Map with US States and Country Flags, Tracks Your Adventures. Scratcher Included, Perfect Gift for Travelers, By Earthabitats",
    "brand": "Earthabitats",
    "feature": [
        "SCRATCH OFF MAP OF THE WORLD. The most detailed and beautiful scratch off map on the market, our map features vibrant colors on a classy matte black design, accurate cartographic details of the terrain, country flags and landmarks. Printed on thick 220GSM paper and protected with laminated finishing, our map arrives without scratches and ensures quality.",
        "PERFECT GIFT FOR TRAVELERS. Our map comes in gift ready packaging to delight the travel enthusiasts in your life. A perfect conversation starter, give them a special moment scratching the map with loved ones while sharing stories and dreaming new adventures together!",
        "US STATES OUTLINED. US state lines are clearly outlined for you to track your adventures with precision. State lines in Canada and Australia are marked too!",
        "SCRATCH OFF MAP OF THE WORLD. The most detailed and beautiful scratch off map on the market, our map features vibrant colors on a classy matte black design, accurate cartographic details of the terrain, country flags and landmarks. Printed on thick 220GSM paper and protected with laminated finishing, our map arrives without scratches and ensures quality.",
        "PERFECT GIFT FOR TRAVELERS. Our map comes in gift ready packaging to delight the travel enthusiasts in your life. A perfect conversation starter, give them a special moment scratching the map with loved ones while sharing stories and dreaming new adventures together!",
        "US STATES OUTLINED. US state lines are clearly outlined for you to track your adventures with precision. State lines in Canada and Australia are marked too!",
        "SCRATCH OFF MAP. We bundled in companion accessories to complete your scratching experience! A comfortable scratching tool, memory stickers to mark your travel memories, eraser to clean scratch smudges and magnifying strip for the visually challenged. Frame the map and impress your guest with this striking piece!",
        "LIFETIME MONEY BACK GUARANTEE. If you haven’t had a 5-star experience with us or your product, we will do whatever we can to fix that! All our products are tested and loved by us, we love our customers and your 100% satisfaction is our top priority."
    ],
    "description": null,
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 70.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "0528012770",
        "B06XRXDNDL",
        "0789332698",
        "B07BMYTBDC",
        "1426215649",
        "0761156860",
        "B00O8PNW6M",
        "B075K3G8XF",
        "B077HH7PSC",
        "B074MSD9YB",
        "B075MSZPY5"
    ],
    "rating": null
}