{
    "asin": "B01I51IBQU",
    "title": "HDMI Switch Box - 4 in 1 out 4k HDMI Switch with Remote, HDMI Multi Port Switch with PIP and IR Wireless Remote Control, Support Full HD 1080P 3D",
    "brand": "fitTek",
    "feature": [
        "PROVIDE ADDITIONAL HDMI CONNECTIONS TO YOUR HDTV: Take your HDTV to the next level with the ability to expand your HDMI devices in a more organized and functional setup. This HDMI Splitter with Remote enables you to connect multiple HDMI source devices to your HDTV, while only using a single HDMI cable to your HDTV for a streamlined professional arrangement.",
        "MORE PORTS & LESS CLUTTER: The HDMI Auto Switch expands the number of available ports on your TV, monitor or projector. HDMI Cable Splitter has 4 HDMI input sources to project to one display. It also has a source select button on the switch and a remote control to provide flexibility for you to manually switch between five sources.",
        "EASY SWITCHING BETWEEN MEDIA SOURCES: Select and view the desired HDMI source device just by a switch of the remote or a push of the front-panel push button. They also automatically switch between inputs as you switch between devices. The switch will give you stable performance. No distortion of audio and video.",
        "PROVIDE USER-FRIENDLY CONVENIENCE: No need to mess around with the TV's AV input selections. The switch eliminates the hassle of figuring out the correct HDMI input for the desired device. The included infrared blaster and remote control allows the switch to be controlled from a distance. Easily switch between HD devices without having to get up from your seat.",
        "SUPER COMPATIBILITY: This Multi HDMI Port Splitter offers multiple features which include 4K Ultra HD, 3D, and Full HD support. It works with HDTVs, Blu-ray players, PlayStation, WiiU, Xbox, Amazon Fire TV and Stick, AppleTV, Chromecast, Roku, smartphones and tablets, and other HDMI capable devices."
    ],
    "description": "fitTek HDMI Switch is a 4 Port 4 x 1 Automative HDMI switcher selector with IR Wireless Remote for your gaming or home theater setup. You can switch up to 4 HDMI inputs into one output and supports 4K x 2K. You will enjoy multiple displays of your devices on your TV screen with the PIP feature. This feature will allow you to watch your football game and, at the same time, check your emails on your laptop display all on the same TV screen! The HDMI input port easily connects to at most 4 HDMI input sources, and the output port easily connect with the TV or projector.Select and view the desired HDMI source device just by a switch of the remote or a push of the front-panel pushbutton.fitTek HDMI Switch will automatcially play the current input source if there is just one HDMI input source connected, if there are multiple HDMI input sources connected, then you can select the input HDMI source by using the IR remote controller or using the selected button on the switch as you like. 1x HDMI Switch 4x11x DC Power adaptor 5V1A1x Remote Controll1x User manual",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 51.24999999999999,
        "length": 540.0,
        "width": 390.0,
        "height": 370.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51Z7wNJhXOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51g5oKSm4HL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51f%2BDenTKfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41AF%2BApB2LL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ViJCKpgaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51PhN74kvNL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2BNjWbd3vL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "468642",
            "title": "Video Games"
        },
        {
            "node": "6427814011",
            "title": "PlayStation 4"
        },
        {
            "node": "6427815011",
            "title": "Accessories"
        }
    ],
    "similar": [
        "B01BV1XBIY",
        "B00MWRZFP4",
        "B079JQ9XXV",
        "B07FDYPG6R",
        "B0785ZJPQY",
        "B078MWB3J9",
        "B01MPZAUBE",
        "B07BGGFF3L",
        "B07C9XWS93",
        "B078NMFMLN",
        "B01L8LLP2G",
        "B07DMH9XLZ",
        "B01HHZ75XK",
        "B077XP6TL5",
        "B076XWNQP9",
        "B07CKPT1LC",
        "B06WV5YJ6H",
        "B071DN62GW",
        "B00RF8HXZK",
        "B07G36469J"
    ],
    "rating": "3.1"
}