{
    "asin": "B01JX4QUDY",
    "title": "LENA Sensitive Menstrual Cup – Small for Regular Flow - Soft Beginner Cup - Made in USA – First-time User - Reusable Organic Tampon and Pad Alternative – Sensitive Bladders & Period Cramps",
    "brand": "Lena",
    "feature": [
        "•A BETTER PERIOD. LENA is a reusable menstrual cup that collects your monthly blood flow. Inserted like a tampon, LENA offers a complete protection and an odorless and sensation-free period. Join thousands of first-time menstruation cup users who say they will never go back to using pads and tampons",
        "STAY ACTIVE AND COMFORTABLE. Dance, run, swim and sleep with your LENA Cup – think of all the times your period held you back! Easy to insert and remove, LENA is ideal for menstruating users of all ages – wear your cup for up to 12 consecutive hours",
        "MADE IN USA and FDA-REGISTERED. LENA is the most affordable USA-made and FDA-registered feminine hygiene cup on the market. LENA uses US medical grade silicone and dyes to ensure complete safety so you can trust your body is getting the best",
        "•A BETTER PERIOD. LENA is a reusable menstrual cup that collects your monthly blood flow. Inserted like a tampon, LENA offers a complete protection and an odorless and sensation-free period. Join thousands of first-time menstruation cup users who say they will never go back to using pads and tampons",
        "STAY ACTIVE AND COMFORTABLE. Dance, run, swim and sleep with your LENA Cup – think of all the times your period held you back! Easy to insert and remove, LENA is ideal for menstruating users of all ages – wear your cup for up to 12 consecutive hours",
        "MADE IN USA and FDA-REGISTERED. LENA is the most affordable USA-made and FDA-registered feminine hygiene cup on the market. LENA uses US medical grade silicone and dyes to ensure complete safety so you can trust your body is getting the best",
        "AS NATURE INTENDED. Abnormal pap smears, rashes and yeast infections have been linked to the use of pads and tampons. Choose a healthier period – LENA Menstrual Cup only collects your blood without drying out your vagina",
        "•ECO-CONSCIOUS. Reduce the environmental impact of your period by switching to a reusable cup. With proper care, the same LENA Cup can be reused for many years. Our 100% recycled packaging is chlorine-free and printed using vegetable-based inks"
    ],
    "description": null,
    "price": null,
    "listPrice": 4995.0,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 400.0,
        "width": 270.0,
        "height": 180.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01N6IYHXA",
        "B06Y3L71RT",
        "B01NCO730D",
        "B01JWMWSMY",
        "B00YNYH8EK",
        "B01FV0N9BK",
        "B07DCBTY1H",
        "B01JX4QUL6",
        "B074PBX6ZY",
        "B00YNYH8F4",
        "B0782HRY9G",
        "B01JXA3JNW",
        "B07DGQHM86",
        "B01MU2R55Y"
    ],
    "rating": null
}