{
    "asin": "B01JRAR5FQ",
    "title": "Leadpo l180 Upgraded Version Leadpo Selfie Ring Light 3-Level Brightness 36 LED for IPhone Samsung Galaxy Sony, Motorola and Other Smart Phones, Clips On Night Ring Fill Light, White",
    "brand": "GIM",
    "feature": [
        "Leadpo upgraded 3 brightness levels: take selfies anywhere, dark night clubs, parties, camping etc.",
        "Compatible with all smartphones - iPhone 6 plus, 6s, 6, 5s, 5, 4s, 4; Samsung galaxy s6 edge, s6, s5, s4, s3 and note 5, 4, 3, Sony, Motorola",
        "It also helps you to get higher quality pictures and videos when natural light is not available",
        "Press the power button again to switch the lighting setting",
        "Can be easily carried in your pocket or bag"
    ],
    "description": "Are you still worry about these problems? The photo is not bright enough when you are taking photos in back-lighting. Your friends can not see you clearly when you put your interesting photos took in daily life into your friend circles. It is useless when your smart phone is without selfie light even though you make up yourself very charming. With this selfie ring light, you will be able to take great selfies in dark areas or whenever natural light is not available. Brightness levels and 36 long lasting led bulbs just press the power button, you will be able to switch to another lighting level. 36 Led bulbs will be able to provide enough lighting for you to take great selfies. Selfie ring light for iPhone 6s / 6s plus / 6 /6 plus / 5s / 5c / 5 / 4s / 4, Samsung galaxy series like galaxys7 /s7 edge s6, s6 edge plus, note 5, lg phones, moto, Huawei, HTC, Sony and other phones, iPad & even MacBook works well too. Light weight and easy to use press power button to switch the lighting levels. It takes 2 aaa batteries that are not included in the package box. You could clips on front camera and back camera of the device, easy to use with the power button to select between three different brightness levels of your choice. It serves as a great emergency light for dark circumstances, or could be a fun side supplemental light for creative photography or video. Specifications: color: white material: premium plastic light level: 3 brightness levels led blubs: 36 long lasting led bulbs simple operation: clip on the phone and turn on, then start your fun ring fill light: provide lenses fill light effect for creative photography and videography in dark environment package included: 1 x upgraded version 3-level selfie ring light.",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": 490.00000000000006,
        "width": 400.0,
        "height": 130.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/511lw459UGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41IQ45QSBuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51jfUXHNYXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fu%2BXD2RTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BD32yjsmL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51C8BbhQaqL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61XA8xLTxNL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "18007875011",
            "title": "Mobile Flashes & Selfie Lights"
        }
    ],
    "similar": [
        "B00EY2Q1AS",
        "B07GWL3GSR",
        "B076MGLLMD",
        "B01NCW7FVU",
        "B07H76TDJS",
        "B01N4IZF32",
        "B071YDVS43",
        "B06XHFH8C6",
        "B01MCZ2WY8",
        "B01KLNIT0S",
        "B01487BWH0",
        "B00BP7SW0C",
        "B07B5YNLM1",
        "B01LEL3WG2",
        "B074Q6TFJC",
        "B07FYKY97N",
        "B079GQR4JV",
        "B078K3RCTR",
        "B07C9VHBN7",
        "B01HXTHPXU",
        "B01A6KC2XQ",
        "B0149N4PD6",
        "B073FDKWDY"
    ],
    "rating": "3.8"
}