{
    "asin": "B01JLCNHKM",
    "title": "Fossil Women's Perfect Boyfriend Quartz Stainless Steel Chronograph Watch, Color: Blue (Model: ES4093)",
    "brand": null,
    "feature": [
        "Case size: 39mm; Band size: 20mm; quartz movement with 3-hand analog display; date window, and 3 chronograph subdials; mineral crystal face; imported",
        "Blue plated stainless steel case; blue dial with rose gold-tone hands, hour markers, and Arabic numerals at 12 and 6 o'clock",
        "Blue plated stainless steel bracelet with deployment-clasp closure",
        "Water resistant to 165 feet (50 M): suitable for short periods of recreational swimming and showering, but not diving or snorkeling",
        "This product is authentic and sold directly from the brand manufacturer to Amazon"
    ],
    "description": "Stainless steel case. Blue-tone stainless steel bracelet with fold-over, double push-button release. Round face. Three-hand analog display with quartz movement. Navy dial features rose gold-tone hands and hour markers, three subdials, date display window, minute track, and Fossil detailing. Water resistant 5 ATM. Display case included. Founded in 1984 when timepieces were created more for function than fashion, Fossil began to transform this notion with its unique combination of vintage 1950s Americana design and affordably accessible cool style. Adding to their collectability were the one-of-a-kind, trademark tins that came with the watches that mixed a creative spirit with a sense of humor. These iconic boxes are nearly as popular as the watches they hold and are regularly collected and traded throughout the world at flea markets, antique shops, and on eBay. Today, Fossil produces over 300 different styles of watches in a continuously changing lineup. While the majority of designs are created by in-house designers, Fossil has reached out to such contemporary artisans as product designer Philip Starck and famed architect Frank Gehry (designer of the Guggenheim Museum in Bilbao, Spain) to create uniquely modern timepieces. In addition to style innovations, Fossil has also helped introduce innovative technologies into watches, such as the Wrist PDA that ran the Palm operating system. Fossil also offers complementary lines of small leather goods, belts, handbags, sunglasses, jewelry and apparel.",
    "price": 10771.0,
    "listPrice": 16500.0,
    "prime": true,
    "dimensions": {
        "weight": 55.00000000000001,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51zliM9%2B1RL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51y059M6ffL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31R4sC2E0kL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qIwONt0jL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        }
    ],
    "similar": [
        "B01JLCNIGU",
        "B01H1V6JMS",
        "B00AJS4L3U",
        "B000GX3ILO",
        "B077MWWD6Y",
        "B077N1R2F3",
        "B07CPYRCVX",
        "B00LBMKIS0",
        "B009DFSVJU",
        "B074CJXWYL",
        "product-description",
        "B077NHLDWZ",
        "B01NAXEZVU",
        "B0783S7V93",
        "B06Y5ZHT7R",
        "B00G3LPMEO",
        "B07657P1FN",
        "B071L9DSFT",
        "B075QF2YYN",
        "B000GX3IL4",
        "B00I0EBHB4",
        "B077MX35DZ",
        "B004D4S7AY",
        "B00KGTUKFU",
        "B00074L2U6",
        "B00DUCIMCI",
        "B01M03TXML",
        "B074N4ZR3S"
    ],
    "rating": "4.3"
}