{
    "asin": "B01J3JZSJG",
    "title": "Mens Watch, Unique Quartz Analog Dress Business Casual Watches Stainless Steel Band Wrist Roman Numeral Waterproof Watch, Classic Calendar Date Window - Black",
    "brand": "cofuo",
    "feature": [
        "PRECISE TIME KEEPING: Excellent analog quartz movement which can keep the men black dress watch in high accurate time keeping, and precise analog shows the time clear and accurate to make sure your time is always correct.",
        "DURABLE: High hardness glass, not easy to wear, key scratch resistant watch face, stainless steel water proof business watch case cover make it super durable.",
        "Convenient and comfortable: Stainless steel clasp, free buckle, easy to put on or take off, use more convenient, more difficult to fall off, Luminescent hands, the night easier to use watches.",
        "PRECISE TIME KEEPING: Excellent analog quartz movement which can keep the men black dress watch in high accurate time keeping, and precise analog shows the time clear and accurate to make sure your time is always correct.",
        "DURABLE: High hardness glass, not easy to wear, key scratch resistant watch face, stainless steel water proof business watch case cover make it super durable.",
        "Convenient and comfortable: Stainless steel clasp, free buckle, easy to put on or take off, use more convenient, more difficult to fall off, Luminescent hands, the night easier to use watches.",
        "CLASSIC BUSINESS CASUAL DESIGN: Affordable men business casual dress wristwatch with Roman Numeral Time Mark, metal strips nailed scale, Calender Window, Stainless Steel Band Strap / Case, Double Locking Fold Over Clasp, use more fashionable appearance.",
        "Waterproof For Daily Use: Perfect for all kind of business, casual, indoor activities or daily use. NOTE:In general, withstands splashes or brief immersion in water, but not suitable for swimming."
    ],
    "description": "Highlights: • High Quality Quartz Movement:: provide precise and accurate time keeping •Waterproof For Daily Use: Perfect for all kind of business, casual, indoor activities or daily use. • Classic Bu ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 940.0,
        "width": 60.0,
        "height": 160.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01LXMDHWR",
        "B01H4VJPUS",
        "B01DPXDTMY",
        "B01J3NGFC6",
        "B01M8HJFMG",
        "B0132NANCG",
        "B0798J4RWB",
        "B000GAWSDG",
        "B01FLLJ6IE",
        "B07657P1FN",
        "B01AU5P64E"
    ],
    "rating": null
}