{
    "asin": "B01KVT6MPQ",
    "title": "The Revenant Super Bright LED Headlamp Headlight 4 Modes 5000 Lumens Waterproof Lightweight, Rechargeable Batteries, Charger, Bicycle Holder, Black",
    "brand": "The Revenant",
    "feature": [
        "Super bright waterproof CREE 1 T6 2 XPE LED beam. Lifespan reach up to 100,000 hours. Brightness up to 5000 lumens, you’ll be able to see up to 150 yards away even when it’s pitch dark.",
        "New deign: 2 small LED light can adjust 360°. Center light can adjust 90 degrees. Durable aluminum alloy crust, waterproof and heatproof, hands-free, Comfortable, it is easy to adjust the head strap for your usage",
        "4 Modes: 1 light/2 light/3 light/Strobe, you can use according you need.",
        "Power by:1 or 2 rechargeable batteries. It can be used about 2-8 hours under full charge (according to you use), help any senior navigate in the dark.",
        "Elastic head strap and soft back cover, comfortable to wear. Great for outdoor sport, full enough for night fishing, hunting, camping, hiking, cycling, riding, running etc."
    ],
    "description": "-The ON/OFF button which is black is on the center. -Press one time, it is at one light; press two times, it is at two small light; press three times, t is at 3 light; press four times,it is rapidly flashing. -Super Bright Headlamp, waterproof, Hand-free. It is the best choice for people who likes fishing, hunting, riding, hiking during the night. -You also can be a great gift to your friends or families. Own it, just like own a night-mate. Model of LED: 1 CREE XML-T6 LED and 2 CREE Q5 LED Lifespan: 100,000 hours Max Lumens: 5000 lumens Material: aluminum alloy casing + elasticated adjustable headband Single button control switch, 4 switch Mode: 1 light/2 light/3 light/Strobe Power Source: 2 x 4.2V rechargeable lithium batteries (Included), one battery also can work. It can be used about2- 4 hours (according to the brightness) Color: as picture -1*LED headlamp -4*Rechargeable batteries -1*Charger -1*Instructions 30 DAYS MONEY BACK WARRANTY 12 months for the Headlamp and 3 months for the charger and the battery after you bought it. If you are not 100% satisfied with the purchase, please contact us to resolve the issue or ask for a refund. The Revenant is the exclusive brand owner and only seller of all The Revenant products. If you purchase your product from other sellers, they are not identical to ours and we will not offer any warranty.",
    "price": 2099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 88.125,
        "length": 490.00000000000006,
        "width": 470.0,
        "height": 430.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51pKjQPVUsL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RJxjdZRzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fSn5BJHJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Y1sAkZuPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51MkHsJC60L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Gbc0IullL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nrWNTbyXL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "3180231",
            "title": "Safety & Security"
        },
        {
            "node": "3180261",
            "title": "Flashlights"
        },
        {
            "node": "17384526011",
            "title": "Hands Free Flashlights & Headlamps"
        },
        {
            "node": "3180291",
            "title": "Headlamps"
        }
    ],
    "similar": [
        "B077GQ2NZB",
        "B00UOS03QO",
        "B00VFT71KM",
        "B0786LF5HM",
        "B07BTS322S",
        "B01693C6TE",
        "B078JCJPC5",
        "B07C8GJ8TV",
        "B071J7CKTP",
        "B079GTYNV9",
        "B06XRF146C",
        "B074SH2KH7",
        "B00SR20JLS",
        "B00NIOCZIK",
        "B078XS3131",
        "B074C9D8FK",
        "B06WV8KNT4",
        "B01KX0QGRC",
        "B07CTG31JY",
        "B07BVNVBL1",
        "B076THG659",
        "B07FDKFG1Z",
        "B01KVSMBK2",
        "B06WV8GS4C"
    ],
    "rating": "3.9"
}