{
    "asin": "B01K8AVVD6",
    "title": "Maple Cherry Wood Sunglasses for Men & Women - Polarized handmade wooden wayfarer style shades that float!",
    "brand": "Vintage Star",
    "feature": [
        "HANDMADE WOOD FRAME SUNGLASSES - You won't go unnoticed! These shades are handmade from 100% natural maple cherry Wood, so every pair is uniquely different. Feel great for saving the environment, cause for every purchase we will give back to our earth and plant 2 TREES!",
        "POLARIZED LENSES - Protect your eyes from the harmful sunrays with anti-glare and UV400 protection, you get crystal clear vision - Best of all ENJOY a new view from a different perspective!",
        "THESE SHADES FLOAT - For real, so you will never lose these beauties again! They are extremely lightweight while wearing them and durable. Thanks to the stainless steel-flex-spring hinges, provides the perfect universal fit - Great for any ACTIVITY or OCCASION!",
        "FREE BAMBOO CASE, MICROFIBER POUCH AND CLOTH - ALL of this included FREE for your safe keeping! Every pair of VINTAGE STAR sunglasses comes equipped in our Bamboo case, including a microfiber protective pouch and cleaning cloth, so you can clean your polarized lenses when needed without scratching them!",
        "100% MONEY BACK GUARANTEE - Order your VINTAGE STAR sunglasses TODAY and if you don't like them, just send them back for a FULL REFUND - So what are you waiting for? CLICK Add to Cart now while stocks last!"
    ],
    "description": "- All our sunglasses are by a crafted with an attention to suited to For every purchase, we will to our earth and plant Our polarized sunglasses are from . They are , extremely while wearing them and . These are and they can even in water. Get your eyes from the harmful sunrays thanks to our with and - Best of Thanks to the provides a perfect fit, great for any or - Every pair comes equipped in our . We've , so you can clean your polarized lenses without scratching them - Get ready to and expect many - It's just up to how you decide to 1. Vintage Star maple cherry wood polarized wayfarer sunglasses. 2. Vintage Star bamboo wood case for carrying and protecting your sunglasses. 3. Vintage Star microfiber pouch for extra protection. 4. Vintage Star cleaning cloth, so you can clean your polarized lenses.",
    "price": 4999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41onjU4Ba2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41xcKurwRYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41oTFdSOAKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ST2tGwJAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51S5YLqg2aL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X96I4NFhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gmbVZ%2BLgL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        },
        {
            "node": "2474936011",
            "title": "Accessories"
        },
        {
            "node": "7072321011",
            "title": "Sunglasses & Eyewear Accessories"
        },
        {
            "node": "2474971011",
            "title": "Sunglasses"
        }
    ],
    "similar": [
        "B06XJ7KPCJ",
        "B0723F1CHD",
        "B01ELD4OBC",
        "B01FBYBM8I",
        "B07DLNHZJW",
        "B07F84B1HZ",
        "B01KIO32D4",
        "B077JVVCH5",
        "B01KF3XLXE",
        "B076GLFJC3",
        "B01N5HJZHG",
        "B07GJ1B1WP",
        "B06XJ45J14",
        "B07FN2VBD4",
        "B0767NFXPV",
        "B076V6VWCC",
        "B01M4QXU5C",
        "B018RZNQ3M",
        "B01MZ1X6Q9"
    ],
    "rating": "5.0"
}