{
    "asin": "B01KJZXN1I",
    "title": null,
    "brand": "Inspired by Dead Sea®",
    "feature": [
        "✔️ REVOLUTIONARY INSPIRED MOISTURIZING SUNSCREEN with broad spectrum SPF 100 full protection. Non-greasy , ultra-light texture, hypoallergenic and non-comedogenic ( won't clog pores), fast absorbing formula , will leave your skin smooth and comfortable looking younger for longer, while being protected from sunburn and other sun damage",
        "✔️ BROAD SPECTRUM UVB+UVA - almost all sunscreens protect only against the sun's \"burning rays\" (known as UVB rays). However, very few sunscreens also simultaneously protect against \"aging rays\" (known as UVA rays).",
        "✔️ PROVIDES SUPERIOR SPF 100+ anti-aging sun protection and keeping skin hydrated. Safe for sensitive skin and recommended for any skin types, this sunscreen is a must have for your daily care regimen.",
        "✔️ REVOLUTIONARY INSPIRED MOISTURIZING SUNSCREEN with broad spectrum SPF 100 full protection. Non-greasy , ultra-light texture, hypoallergenic and non-comedogenic ( won't clog pores), fast absorbing formula , will leave your skin smooth and comfortable looking younger for longer, while being protected from sunburn and other sun damage",
        "✔️ BROAD SPECTRUM UVB+UVA - almost all sunscreens protect only against the sun's \"burning rays\" (known as UVB rays). However, very few sunscreens also simultaneously protect against \"aging rays\" (known as UVA rays).",
        "✔️ PROVIDES SUPERIOR SPF 100+ anti-aging sun protection and keeping skin hydrated. Safe for sensitive skin and recommended for any skin types, this sunscreen is a must have for your daily care regimen.",
        "✔️ HELPS PREVENT PREMATURE SKIN AGING - This daily oil free moisturizer contains calming Aloe Vera and nourishing ingredients that penetrate the skin, moisturize it, and help prevent aging of the skin caused by the sun. Works wonderful on your whole body as well !",
        "✔️ INSTANT SILKY SMOOTH SKIN - you won't even notice you're wearing it . It has a texture which is as luxurious as your favorite daily under make up face moisturizer . Controls shine, evens, hydrates and protects from further skin problems such as pigmentation, skin darkening, unsightly blemishes, discoloration, dark spots and premature skin aging"
    ],
    "description": "INSPIRED lightweight, non-greasy and non-comedogenic formula is designed to give you broad UVA and UVB protection, providing superior anti-aging SPF 100+ sun protection and keeping skin hydrated. Safe ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00JU796IG",
        "B01DPXX1HW",
        "B00B4YVU4G",
        "B015ORL3B8",
        "B07CJYCD1L"
    ],
    "rating": null
}