{
    "asin": "B01K76QRJE",
    "title": "Avegant Glyph AG101 VR Video Headsets, Patented Retinal Imaging Technology MOPS 3D Virtual Reality Goggles HDMI Connecting",
    "brand": "Avegant",
    "feature": [
        "Patented Technology -- Authentic Avegant Glyph VR video headsets, come with Retinal Imaging Technology, it is the most advanced viewing experience for wearable displays. +1 to -7 diopter adjustment range makes most Shortsighted and Farsighted people enjoy clear images without wearing glasses;",
        "HDMI Connecting -- This Avegant Glyph AG101 Virtual Reality Goggles built in 720p HDMI display screen, supports all HDMI output devices, such as smart TV, PS4, smart phone (need HDMI hub adapter), and you do not need to install your smart phone on;",
        "440g Lightweight -- The weight of Glyph VR headset is about 440g, it is lightweight so that you may not feel uncomfortable with such bearing on your head. Package comes with an external head strap to make it more stable on your head;",
        "Attention to Surroundings -- Unlike other VR glasses, you can pay attention to surrounding without taking this Glyph off, just move down your sight and you will see scene around you. It can also be used as headphones by connection cellphone via audio cable. If you want to have a rest, just hang the VR on your neck like a headset;",
        "2060mAh Battery -- Built in a charging and discharging battery with 2060mAh battery, working time is up to 4 hours (theoretically), supporting you finish watching one to two movies. You can also use it while charging, good private theater."
    ],
    "description": "Avegant is mediawear, a new category of personal entertainment technology designed with thego-anywhere portability of an audiophile's headset and with the amazingly precise videocapability of a movie theater. Avegent sits on your head like a pair of headphones and whenflipped down, it becomes a personal theater for viewing all types of 3D, 360° and 2D contentfrom your mobile devices. Put it on, and you get the idea in seconds. IMMERSIVE The Avegant Video Headset looks as advanced as the viewing experience it delivers. Enjoyadvanced HD audio and video in a device that's intuitive and immersive, but never isolating. ADJUSTMENT Fully adjustable optics compensate for most prescriptions, meaning you can enjoy extendedviewing without the need for glasses. COMPATIBLE A single HDMI input means you can play directly from any computer or gaming console and anytablet or smartphone with simple adapters. It's easy to watch in a whole new way. Resolution: 1280x720P (per eye, two million micro mirrors total) Aspect ratio: 16:9 Field of view: -40 degree diagonal Video and Audio Input: Micro HDMI 9 axis IMU for headtracking Frequency response: 20Hz~20kHz Dynamic range: 95db Audio only input: 3.5mm standard AUX Battery style: Li-ion, integrated Battery capacity: 2060mAh Working time (video): Up to 4 hours Charging port: Micro USB 1 x Avegant Glyph AG101 VR Headset 1 x HDMI Cable 1 x USB Cable 1 x Head Strap 3 x Interchangeable Nose Pieces 1 x Carrying Bag 1 x Lens Cover 1 x User Manual 1 x Warranty Card",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 650.0,
        "length": 750.0,
        "width": 750.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51egqcCmmJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/511fEIKZNOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51w7qaLAr9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nqVvfwMLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41nciWyRraL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41n7hkwSM-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410gvd0fxPL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "1266092011",
            "title": "Television & Video"
        },
        {
            "node": "3213034011",
            "title": "Video Glasses"
        }
    ],
    "similar": [
        "B073819RTM",
        "B01M7MS75Q",
        "B074DXWG12",
        "B00RIYSI50",
        "B07CTDQB1Y",
        "B0779Q872D",
        "B00YOFRK78",
        "B01D54376Q",
        "B076BWMTL7",
        "B00B2HORKE",
        "B06W5NT841",
        "B07BPT2JT8",
        "B078WKT1HL",
        "B074GB37V8",
        "B0776S2CZ7",
        "B075V68NVR",
        "B07CTPDVRM",
        "B079FDZJ2W",
        "B072VKPBQ2",
        "B07CZZRW74",
        "B00Z14UXFM",
        "B01MZ89QXF",
        "B01ACROXGC",
        "B000X471P0",
        "B000W9OJVA",
        "B01CJ8J81W",
        "B06XKFJ5B4",
        "B079HTDZLY",
        "B0193KKJTO",
        "B071HWSNX6"
    ],
    "rating": "3.5"
}