{
    "asin": "B01K864JM0",
    "title": "Tasmanian Leatherwood Honey from Pristine Australian Rainforests – 26.5 Oz",
    "brand": "Tasmanian Honey Company",
    "feature": null,
    "description": "Connoisseurs of fine food continue to recognize Leatherwood Honey as one of the finest and rarest honey in the world. It is known for its unusual flavor and its complex lingering palate. It has a very unique aroma, some describe it as a spicy type of smell and it would be absolute heaven on toast or in some teas. The healthy vitality contained in this truly natural food, produced as it is from the wilderness forests where no form of pollution exists. The nectar yield of Leatherwood trees is correlated to the age of the tree. Young Leatherwood trees are a poor nectar source. Research has shown that trees under 75 generally don't flower at all and the most prolific flowering trees are those that 175 to 210 years old and trees. Leatherwood honey is produced by bees from the nectar of the leatherwood Eucryphia lucida flower. The leatherwood is endemic to Tasmania and is found in the wetter forest regions throughout the western part of the state. Leatherwood is the single most important nectar plant in Tasmania, accounting for about 70 per cent of all honey produced. Other sources of nectar include clover in pasture, Eucalyptus blossoms and wild blackberry. The variety of plants available to bees in nectar foraging may be used as a supplement to the leatherwood in times of poor flowering or in parts of the season when leatherwood does not flower. This diet is preferable to feeding the bees sugar. Leatherwood honey is slightly liquid with uniform crystallization, a smooth creamy texture and an ochre-yellow color. The perfume is intense with notes of balsamic scents, which develops quickly into clean fresh notes of citrus fruits and white flowers. The flavor is clean and fresh, very balsamic, with lightly spicy notes in its long finish. Overall, the sensation of eating this honey is very pleasurable: it is creamy, buttery, low in acidity and melts in the mouth.",
    "price": 2499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 190.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61J1%2BulNa2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51m%2B8f48amL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Ku-0SEQaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FFbl%2BDzXL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61bGUGWaHmL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61v-F0ecObL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61S-aevkP7L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "16310101",
            "title": "Grocery & Gourmet Food"
        },
        {
            "node": "16310221",
            "title": "Cooking & Baking"
        },
        {
            "node": "6492319011",
            "title": "Syrups, Sugars & Sweeteners"
        },
        {
            "node": "16317891",
            "title": "Honey"
        }
    ],
    "similar": [
        "B00L737EZ8",
        "B00I542X7Q",
        "B00CMQD282",
        "B008XF7ZP2",
        "B000TIRS3K",
        "B01MS8IVB3",
        "B07BKTXK8W",
        "B0721LFDFK",
        "B079J31XYX",
        "B01MQ40K33",
        "B006YHZV20",
        "B01L90U5C2",
        "B07F1D2LPG",
        "B00NB3PAGW",
        "B006YHXTX8",
        "B075Y13QS2",
        "B07C6413JM",
        "B01N98XN7X",
        "B07982T8L4",
        "B07CK5J398",
        "B07CV3TKR1",
        "B000TIQGZG",
        "B0008IUV5I",
        "B000VNNSEG",
        "B01D564CMM"
    ],
    "rating": "4.2"
}