{
    "asin": "B01K6X0SDY",
    "title": "Nato Strap Canvas Fabric Nylon Watch Straps with Stainless Steel Buckle,Adebena Ballistic Replacement Watch Bands Width 20mm 22mm",
    "brand": "Adebena",
    "feature": [
        "AWESOME MATERIAL:2mm thickness premium ballistic nylon webbing and top quality polished stainless steel buckle makes it comfortable to wear.The nato nylon watch band is stylish,smooth,lightweight and breathable,yet it can be washed repeatedly, easy dry and worn 24 hours/365 days.",
        "SIZE AND WIDTH GUIDELINES:It's approximately 10 1/2\"inches long excluding the buckle and 2 size in width (20mm and 22mm).Our watch band length fits wrists from 5\" to 8 1/2\" in circumference,which fits men,boys,women,girl even hercules.To select width,measure exactly the width of the watch lug or width of current band at connection point and then select width close to measurement (20mm or 22mm).",
        "FREE SPRING BARS AND FREE SPRING BAR TOOL: We provide 1 high quality spring bar tool and 1 stainless steel spring bars tool 4 stainless steel spring bars for helping change your watch band, you will know how to switch between different watch bands and how to find the best way to wear our watch bands.When you feel the watch band is too long, you can adjust the length or change the way you wear it according to our watch strap manual.",
        "PACKAGED INCLUDED:2PCS Nato watch bands+1 PC spring bar tool+4 PCS spring bars.",
        "WARRANTY SERVICE:If you have any fit issue or any other problems about our nato watch straps. Please email to our after-sale team on Amazon, we will provide free replacement or full refund."
    ],
    "description": "1.Watch band color might be slightly different from the pictures because of different light condition and screen resolution. 2.Different tools and ways of measurement might cause a subtle dimension deviation from the length of watchband. 3.Although our watch bands nearly cover all of the wrist and watch size, if you still think it did not fit as expect, or you have any other dissatisfaction, please email to our after-sale team on Amazon, we will help you deal with your problems. 4.If you think the bands are a bit long,and you can cut them shorter with scissors and burned the fray.But we won't refund/replace to you if you have did it. Brand Name:Adebena Material: Ballistic nylon and matte-brushed stainless steel Band width: 20mm Thickness: 2mm Weight: approx. 0.3oz 2 x Adebena nylon watch band 1 x spring bar remover and 4 x spring bar Purchasing with our considerate customer service. All you question or e-mail will be replied within 12 hours(average 3-6 hours). Any problem, before leaving us a negative feedback, please contact us. We will do whatever it takes to make you a happy customer.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51YNg8C-p7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YqfGWSbOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Igt8YsvhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41K3X5SCEfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41mY4tvlI9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51z2zyaCt4L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "22mm"
        },
        {
            "name": "Color:",
            "value": "Black&Black/Grey"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358541011",
            "title": "Watch Bands"
        }
    ],
    "similar": [
        "B01FSWUWD4",
        "B01FSOZJ9E",
        "B0749KW5FJ",
        "B017YGFHUK",
        "B077YGBKXF",
        "B07GK1J1VK",
        "B01A6HO4WG",
        "B01FSWUV30",
        "B007A569W6",
        "B07795Z3DM",
        "B079QNJM2B",
        "B01K6X0X8Y",
        "B07D926L1B",
        "B01K6NWDFU",
        "B07CZQ9TBF",
        "B079QB51D2",
        "B0779755BC",
        "B079KDNTZP",
        "B077T8LDGM",
        "B06Y3L5L2N",
        "B01K6NWC10",
        "B077YF3SLK",
        "B07DQH5XXB",
        "B01K6NW5XA",
        "B07795DNBG",
        "B01K6X0N3E",
        "B01E4X06HA",
        "B01K3SZXFA",
        "B07657P1FN",
        "B07DHLNT4W",
        "B00BBYF13U",
        "B07CKPVLMT",
        "B0085NT7NA",
        "B01HQTOX50",
        "B07BMSMLX7",
        "B073XNV6VJ",
        "B07795ZVQQ",
        "B078NTYRQR",
        "B077T7MZML",
        "B01K6X0UQ4"
    ],
    "rating": "4.3"
}