{
    "asin": "B01K2UMMI0",
    "title": "Baebody Eye Gel for Appearance of Dark Circles, Puffiness, Wrinkles and Bags. - for Under and Around Eyes - 1.7 fl oz.",
    "brand": "Baebody",
    "feature": null,
    "description": "Everyone wants to look their best. Baebody is a beauty and lifestyle brand with a desire to promote quality skin care. We want you to look and feel fabulous!Baebody Eye Gel is a unique blend of Powerhouse Ingredients with Peptide Complex, Matrixyl 3000, Vitamin E, Jojoba Oil, Amino Acid Blend, and more!Besides being tried and true, we've found the way to achieve your desired skin. Our products are made from some of the best ingredients. Our products are manufactured in the United States and Not Tested On Animals. May temporarily cause burning sensation, stinging, or skin irritation to certain individuals or skin-types. These possible side effects vary from one person to another. Please review all ingredients for possible skin sensitivity/ allergies before use of the product. Immediately discontinue use if you experience any adverse reaction. This product contains ingredients such as Aloe Vera and Hyaluronic Acid which may cause skin irritation on certain individuals and skin-types with allergies or skin sensitivities. Please review all ingredients for possible skin sensitivity/ allergies before use of the product.When using your airless pump dispenser for the first time, you may need to \"prime\" your dispenser. To prime your dispenser, pump dispenser slowly about 5 to 10 times. This process of priming will activate the vacuum pump system. If at any time your dispenser stops working, simply repeat the priming process to reactivate the vacuum pump system.",
    "price": 2395.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 40.0,
        "length": 509.99999999999994,
        "width": 310.0,
        "height": 480.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/5147JcDULJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51WWutOR5uL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51feDvGzniL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41uCZhIxfWL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11060451",
            "title": "Skin Care"
        },
        {
            "node": "11061941",
            "title": "Eyes"
        },
        {
            "node": "7730092011",
            "title": "Gels"
        }
    ],
    "similar": [
        "B00JK2PB8U",
        "B01N37TWSS",
        "B01FLO5914",
        "B00LV6VDG2",
        "B07BPC6F3C",
        "B01MRY0TAB",
        "B01M4MCUAF",
        "B073X8KKYW",
        "B00KCFAZTE",
        "B07FXP2PW6",
        "B0765MD9H1",
        "B01ES349CY",
        "B01EKUBU5Y",
        "B07F5P9M7J",
        "B00LV5NY3I",
        "B07B27XTLH",
        "B07FKFQXBD",
        "B07D1S6PLD",
        "B01N4EL9P9",
        "B015ORL3B8",
        "B01M1HIIUT"
    ],
    "rating": "4.0"
}