{
    "asin": "B01LZN7MLE",
    "title": "Redragon K552-R KUMARA LED Rainbow Backlit Mechanical Gaming Keyboard Small Mechanical Gamers Keyboard 87 Key Metal Computer USB Gaming Keyboard for PC Quiet Cherry MX Blue Equivalent (Black)",
    "brand": "Redragon",
    "feature": [
        "MECHANICAL GAMING KEYBOARD - BLACK VERSION; 87 Keys Small Compact Mechanical Gaming Keyboard with Custom Mechanical Feeling Keyboard Switches (Cherry MX Blue equivalent). Designed for longevity with greater durability and responsiveness. The Mechanical Keyboard Quiet Keys offer medium resistance, crisp but a quieter click sound, and precise tactile feedback for ultimate typing and gaming performance. The switches are of the highest quality, tested for 50 million keystrokes",
        "RAINBOW LED BACKLIT MECHANICAL USB GAMING KEYBOARD; 8 different Game Modes, 2 user defined Game Modes, 6 colors, multiple brightness levels, adjustable breathing speed and breathing mode The Illuminated keyboard has Double-shot injection molded keycaps offering crystal clear uniform backlighting and lettering that doesn't scratch off. The perfect mechanical keyboard for office or home use. Mini mechanical keyboard WITHOUT separate number gaming keypad",
        "ERGONOMIC DESIGNED PC GAMING KEYBOARD; The steel series mechanical game keyboards features a Compact Ergonomic Design and a High Quality Durable Metal-ABS Construction with Plate-mounted mechanical keys and switches that stand up even during the most testing marathon gaming sessions like league of legends, steam, Fortnite, PUGB, Overwatch, Call of Duty and other FPS Games",
        "ANTI GHOSTING GAMING KEYBOARD FOR PC; ALL 87 mechanical keys are conflict free (n-Key Rollover) for ultimate Gaming performance. Featuring, 12 multimedia keyboard keys and a Non-Slip Ergonomic, splash-proof Design. Comes with gold-plated High-Speed corrosion free USB gaming keyboard connector for a reliable connection",
        "PC GAMING KEYBOARD COMPATIBILITY: Windows 10, Windows 8, Windows 7, Windows Vista, or Windows XP, Limited Mac OS keyboard support. Works well with all major Computers Brands and Gaming PCs MSI, Dell, Corsair, Alienware, Razor, Xbox One, Asus and others"
    ],
    "description": null,
    "price": 3349.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 234.0,
        "length": 1420.0,
        "width": 520.0,
        "height": 140.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41LlgaKiweL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41uMyUMnAaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41iyFLY0HOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/417uMUFRn2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41GRG1D8aPL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41pq-GNfefL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41MDe4AjgBL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "468642",
            "title": "Video Games"
        },
        {
            "node": "229575",
            "title": "PC"
        },
        {
            "node": "318813011",
            "title": "Accessories"
        },
        {
            "node": "402051011",
            "title": "Gaming Keyboards"
        }
    ],
    "similar": [
        "B078MNFWJ5",
        "B074536KKX",
        "B07D3FJW3S",
        "B06XFLVKB2",
        "B0741LPRP9",
        "B077XDQD2D",
        "B07D3GB4N3",
        "B011HMDZ0Q",
        "B078S51Z6G",
        "B07HC6N662",
        "B07CBTL4Q8",
        "B07D3GR1MK",
        "B019O9BLVY",
        "B079HM7D95",
        "B0723DBMS9",
        "B07173B1XL",
        "B01N7LEO6X",
        "B01IRASQA0",
        "B079FHFDJ8",
        "B01NAI2TXC",
        "B019OB663A",
        "B01M4LIKLI",
        "B072JWR7Y5",
        "B015MQH59A",
        "B01FZ3BR5S",
        "B073VFG6BZ",
        "B0794WBPHK",
        "B07CXRM9S6",
        "B07BRLQW3Z",
        "B075CFPR3F",
        "B00HTK1NCS",
        "B00GU8W5AE",
        "B01N34UOJA",
        "B0751D11BL",
        "B072R2NQBV",
        "B01MS6C7S8",
        "B073FBJ2MY",
        "B016MAK38U",
        "B00NLZUM36",
        "B01LXD7TP9"
    ],
    "rating": "4.4"
}