{
    "asin": "B01L0IH4MM",
    "title": "TRUST OPTICS Lightweight Anti Harmful Blue Light UV Glare Eyestrain Relieving Computer Reading Gaming Glasses Readers",
    "brand": "TRUST OPTICS",
    "feature": [
        "plastic frame",
        "plastic lens",
        "non-polarized",
        "Arm: 136 millimeters",
        "Package Includes: 1 – TRUST OPTICS Computer Reading Glasses with Amber Lenses / DIMENSIONS: Lens Width: 52mm, Bridge Length: 16mm, Temple Length: 140mm, Lens Height: 36mm, Frames Width: 136mm, Temple Tip Distance: 91mm.",
        "BLUE LIGHT PROTECTION WITH BLUEGUARD: Amber-tinted lens feature BlueGuard technology that reduces the amount of blue light that reaches your eyes and causes insomnia, headaches, blurred vision, dry eyes, fatigue, stress, and daytime tiredness. Your health suffers from blue light caused by web surfing, gaming, phone use, television viewing, and working under fluorescent lighting. Amber lenses also feature UV400 sunlight-blocking protection and glare reduction.",
        "DURABLE & ERGONOMIC FRAMES WITH STLISH CLASSIC DESIGN: Lightweight TR90 nylon frame material gives added durability. Impact resistant design protects lenses in case of accidents and falling. Comfortable ergonomic shape prevents tiredness during daily and nightly use. Look professional and skilled while at work, playing video games, and outside of the office. Perfect for casual users who want both eye protection and fashionable eyewear."
    ],
    "description": "Our eyes are the window to the world. Every day, we endlessly view and process information: working 9 to 5 in front of a computer screen, scrolling through our phones, catching up with our favorite show on TV, reading on a tablet, or battling it out on gaming devices. What do all of these digital devices have in common? They all emit blue light, which can be harmful to our eyes over time. > Blue light has the strongest frequency of the visible spectrum, right next to UV light. Its short wavelength and high frequency make it highly penetrative, able to reach as far back as the retina in your eyes. This can cause digital eyestrain, headaches, dry eye, fatigue, and even insomnia. TRUST OPTICS worked with ophthalmologists to create their BluGuard lens technology: a proprietary amber lens treatment that reduces high frequency blue light, UV light, and glare emitted from many digital devices. BluGuard decreases eyestrain, reduces headaches, and improves your sleep cycle, which also means increased productivity at the office and more time to relax with your favorite devices. The BluGuard lens technology is coupled with our FeatherView frames, which are only made with high quality and lightweight materials. Our glasses do not compromise on comfort or style. FeatherView frames are functional, professional, and available in a wide variety of modern and sleek designs. Safeguard your eyes, alleviate the digital eyestrain, and feel the difference today with TRUST OPTICS Computer Glasses.",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31DMoyqrZrL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31dgNbkgmXL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31rPxoFEHXL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qgw3bcj0L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41z%2Ba6jSLjL._SR38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Black Blue"
        },
        {
            "name": "Magnification Strength:",
            "value": "0.0 x"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "2474937011",
            "title": "Accessories"
        },
        {
            "node": "7072330011",
            "title": "Sunglasses & Eyewear Accessories"
        },
        {
            "node": "3478922011",
            "title": "Eyewear Frames"
        }
    ],
    "similar": [
        "B00RJ3OYWG",
        "B073S11QSK",
        "B01EY43SCY",
        "B01MF4C2P5",
        "B076CVJPYQ",
        "B072213F8M",
        "B076M266ZR",
        "B01K5Q0R56",
        "B07BDQQWPJ",
        "B06Y58ZXYJ",
        "B0728LQ1F8",
        "B071J5JP9F",
        "B073PD1G67",
        "B01EA5XPZC",
        "B073WB6YP1",
        "B00BQ7KBV4",
        "B075ZQLFLQ",
        "B00WT59ARS",
        "B076CVZXFP",
        "B06Y69B7JH",
        "B07DRHG6MY",
        "B073DCBWHD",
        "B01N329UTE",
        "B076CTVGPX",
        "B07DLKHSG7",
        "B071PBRSSQ",
        "B06Y69WMNH",
        "B071R2LJY4",
        "B07BDQKK42",
        "B07BDRRCFD",
        "B01N1KQSAP",
        "B073DD93WX",
        "B073S11MM8",
        "B01MS42CGX",
        "B07177SJHZ"
    ],
    "rating": "4.2"
}