{
    "asin": "B01LYIMCML",
    "title": "Aquafina Diversion Safe Water Bottle Stash Can w HumanFriendly Smell-Proof Bag",
    "brand": "HumanFriendly",
    "feature": [
        "AUTHENTIC - Made from a real 16 fl oz Aquafina water bottle. You could easily place this among a dozen others in the fridge, pantry or counter and there would be no difference.",
        "HIDE YOUR VALUABLES in plain sight with this cleverly constructed stash bottle. Having an unopened bottle of water lying around is very discrete. Nobody would suspect that your valuables could be hidden inside of it.",
        "STURDY - frosted plastic center insert hides your valuables behind the label where nobody could hear, see or smell it.",
        "SECURE COMPARTMENT - Unlike other versions of this stash bottle, the hidden compartment does not just slide away from the top but it actually reverse screws to keep the two bottle parts secure and together.",
        "INCLUDES 4.5” x 3” HumanFriendly smell-proof bag to keep your valuables even more safe and secure. Having a bag inside helps to keep hard items from clunking around."
    ],
    "description": "The Aquafina stash water bottle is another popular diversion safe. Indistinguishable from the real thing, the top and bottom halves twist off to reveal the storage compartment hidden in the middle, behind the bottle's label. This hidden safe is constructed from an authentic Aquafina water bottle and features an unbroken factory-sealed cap, as well as the top and bottom halves of the bottle pre-filled with water (not to be consumed). Another popular feature of this stash bottle is its secure design, a concern with many diversion safe bottles of this style. The only moving parts of this Aquafina stash diversion safe bottle are the top and body. We have made sure the top is solid and designed to click shut securely by reverse screwing instead of just sliding on and off.- measure approximately 9” high, 3” wide.- approximately 4” deep- is approximately 2” diameterFor added security we have included a tinted HumanFriendly smell-proof bag (measuring 4.5” x 3”) to help keep your valuables even more secure. Having extra padding inside of the hidden compartment helps muffle the sound of anything moving around inside.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 80.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51lF4COfzCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41X2yXn5mbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41g6qR4f4uL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5151iAeynZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VWrJRsLgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X905C71bL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/413iW9M6k1L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "3180231",
            "title": "Safety & Security"
        },
        {
            "node": "3180371",
            "title": "Safes"
        },
        {
            "node": "7459505011",
            "title": "Diversion & Can Safes"
        },
        {
            "node": "7491107011",
            "title": "Can Safes"
        }
    ],
    "similar": [
        "B00YOB164A",
        "B07BWRSJ51",
        "B074KDHMKJ",
        "B00WN95EI4",
        "B00VXXCURY",
        "B0031YH3DO",
        "B00VPE1BF8",
        "B001QOGNCS",
        "B00JXBGCA4",
        "B01N8ULVVU",
        "B01LFE2HBY",
        "B07CLDGKGF",
        "B003BQ6QXK",
        "B06XJKN21C",
        "B008RZ7F1M",
        "B001B5I57I",
        "B00H7LM0US",
        "B01BGY043Q",
        "B06XKLNN6Z",
        "B01N2HTYNJ",
        "B06XKKXSVS",
        "B06WWRDK5X",
        "B071J4MGDM",
        "B01MSKDTU3",
        "B07533RQB4",
        "B07BSNLVXZ",
        "B078SZV6ZZ",
        "B07DXDYYD4",
        "B008C3YU4E",
        "B002A615DS",
        "B002R3JWVQ"
    ],
    "rating": "3.1"
}