{
    "asin": "B01LWEBX78",
    "title": "ArmorSuit MilitaryShield Full Coverage Anti-Bubble HD Screen Protector for Fitbit Charge 2, Pack of 2",
    "brand": "ArmorSuit",
    "feature": [
        "ArmorSuit MilitaryShield Kit for Fitbit Charge 2 includes our MilitaryShield piece(s), Installation Solution, Squeegee, Lint-free cloth, and Installation Instructions.",
        "Ultra HD Clear and amazingly thin, perfectly matches the contours of your device. Easy application with flexible material is designed for maximum full coverage on curved corners and edges on your device.",
        "Created from scratch-proof, ultra-tough, optically clear, military-grade, yellow-resistant material and is custom fit for each particular gadget and device with full body and screen protection.",
        "MilitaryShield has self-healing technology, which helps eliminate minor scratches on the film all by itself. Significantly reduces dust, oil and fingerprint smudges.",
        "ArmorSuit stands behind the quality of our MilitaryShield products to ensure 100% Satisfaction to all of our customers. All ArmorSuit MilitaryShield products are backed by Lifetime Replacement Warranty. Made in USA."
    ],
    "description": "ArmorSuit MilitaryShield features exceptional clarity and UV protection to prevent yellowing. It is made from the same protective film material used to protect military aircrafts, helicopters and space shuttles. MilitaryShield is also equipped with \"self-healing\" properties to maximize the protection. The self-healing technology works to constantly eliminate minor scratches on the film. All of our MilitaryShield are uniquely designed to provide a perfect cut for a perfect fit on your device. It also features corrosion and moisture protection to prevent substances from migrating through the film to attack underlying substrates. It's designed to provide daily protection against scratches and reduce chances of damage to your screen from impact forces and drops. Best of all, it's very easy to apply. If your MilitaryShield peels off, becomes scratched or damaged, or has installation flaws, we will gladly replace the product FREE OF CHARGE no matter what the issue is. MilitaryShield for your device Flexible Squeegee Spray Bottle Solution Microfiber Cloth Installation Instructions If you ever need to the MilitaryShield, simply peel it off slowly with your bare hands. It will come off clean without any sticky residue.",
    "price": 785.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 700.0,
        "width": 450.0,
        "height": 100.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51aSply6XcL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51n7KzSYgrL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51t74FTQHdL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41HQb4nYn0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410N4QoMI4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41v6fR%2BfxuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41TTlHRrI6L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        }
    ],
    "similar": [
        "B01LWEQ8W5",
        "B01LR1WQ70",
        "B01MDN5IHN",
        "B07CMZ18L8",
        "B07D2DTJ1B",
        "B01H0YDUVY",
        "B06XGCZR78",
        "B07F17YXXX",
        "B07D476SSC",
        "B07GDJTGJ7",
        "B06XDQGW8D",
        "B01H0YDQ4U",
        "B07GDJ63SM",
        "B01H0YDH1C",
        "B01LWEQKZO",
        "B01FESW91U",
        "B01N529RP3",
        "B07DY1MKQB",
        "B071LFLN9N",
        "B01LR1QQXU",
        "B07FSJTBYD",
        "B07792MKLW",
        "B01K9S260E",
        "B00UO5LXVG",
        "B07F11QX65"
    ],
    "rating": "4.0"
}