{
    "asin": "B01MXIFH90",
    "title": "Microfiber Cleaning Cloth, MOSSLIAN (16\" x 16\" 3 Packs) Screen Cleaner kit wipes for Macbook, Camera Lens, Eyeglasses, Glasses, Screen, iPad, iPhone, Mac, Tablet,Laptop, Touch LCD TV Screens",
    "brand": "MOSSLIAN",
    "feature": [
        "LARGE SIZE 16 x 16 inches (40cm x 40cm) - Quality of the microfibre is much smoother and better to keep your Lens, Eyeglasses, Glasses, Screen, iPad, iPhone, Tablet, Cell Phone, windscreen clean and clear. Remove dust, smudges and fingerprints. Definitely a must have item if you own a car, computer, Macbook and other electronic products. Keep it clean and shiny in matter of seconds.",
        "CONVENIENT each one comes in their own individual pouch that makes it convenient to carry around anywhere. The plastic pouches are a great idea, practical, you can keep them clean if you are not using them.",
        "REUSABLE AND WASHABLE easy to use, just hold them under warm water and scrub gently, and lay them flat to dry. Then they dry really fast!! Just make sure they are dry before using them. They have hundreds of uses before you need to wash them.",
        "DURABLE AND SAFE for expensive camera lenses, MacBook, Macs and other valuables. Designed to clean without liquids and if necessary just water.",
        "SCRATCH-FREE GUARANTEE won’t scratch your device surfaces while cleaning. Buy with confidence knowing that no matter what, we've got your back! Please contact us with any question or concern - we are here to help."
    ],
    "description": "Use 100% scratch-free, lint-free , it is made a world of difference in keeping machine clean and screen scratch free, maintain beautiful displays with no streaking or degree left behind. Don't waste your money on liquid screen cleaners, just use a few drops of water on the cloth, wipe down the screen and immediately dry with a dry microfiber cloth to prevent spots. Do not want to put a screen protector on your new ipad or phone, keep one in office, workplace, home and pocket, bag, the screens get pretty clearly from daily use.",
    "price": 899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/415TUyw-1uL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51R0ECfKlML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41UrDSZqyKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dRZ9FVhyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418R%2BfzevbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/518DlQZW%2BKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ygHO3b3FL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "172435",
            "title": "Accessories"
        },
        {
            "node": "172426",
            "title": "Cleaning Equipment"
        },
        {
            "node": "3346301",
            "title": "Cloths"
        }
    ],
    "similar": [
        "B07D5CSG99",
        "B06XXHS1WN",
        "B01054S5FM",
        "B0043XZEEC",
        "B01N5KLQM8",
        "B07CGF6NVG",
        "B01CFK6L1O",
        "B002SBB0SU",
        "B06ZZZN7BN",
        "B00K6C73ES",
        "B01HYKQR8W",
        "B01MF9SGLN",
        "B079DRKDJ8",
        "B019O1RH4W",
        "B00DOPW5K6",
        "B07BSMMP1Q",
        "B074J8VSC5",
        "B01FGHV5XC",
        "B07BVZ4TN7",
        "B0050R66X8",
        "B07C7HGW87",
        "B01LWQ63NZ",
        "B0050R67U0",
        "B01KNADVNO",
        "B06XXFYGK7"
    ],
    "rating": "4.6"
}