{
    "asin": "B01M9E7O3A",
    "title": "HTC Bolt Screen Protector (HTC 10 Evo), Skinomi MatteSkin Full Coverage Screen Protector for HTC Bolt Anti-Glare and Bubble-Free Shield",
    "brand": "Skinomi",
    "feature": [
        "The Anti-Glare HTC Bolt Screen Protector (HTC 10 Evo) is specifically custom-designed to offer maximum screen coverage for complete device protection",
        "Matte/Anti-glare infused material formulated to significantly reduce glare and improve visibility in bright environments. Provides a smooth, satin texture that gives your device a high-quality look and feel",
        "Self-Healing, flexible and tough, military-grade elastic polymer material ensures that your device is protected at all times. The MatteSkin is resistant against scratches, punctures, UV light, smudges and fingerprints",
        "Easy, error-proof and bubble-free installation. Liquid solution allows adjustments during installation and bubbles will disappear as protector sets on device",
        "100% Risk-Free Lifetime Replacement Warranty from Manufacturer. Made in the USA. Includes original Skinomi® MatteSkin Anti-Glare Screen Protector HTC Bolt"
    ],
    "description": "The Skinomi® MatteSkin Screen Protector is a new line of screen protectors developed to enhance the visibility of your mobile device in bright environments. The protector features a smooth, satin anti-glare infused finish specifically engineered to disperse harsh sunlight to significantly reduce glare. Whether you're in the field or spending the day at the park, the Skinomi® MatteSkin protector will allow you to use your device without squinting or desperately looking for shade.Plastic screen protectors are a temporary solution for preventing damage to your device. However, with the Skinomi® MatteSkin HTC Bolt Screen Protector (HTC 10 Evo), you get a flexible, yet tough long-lasting protector that is resistant against scratches, UV light and fingerprints. Equipped with the same \"self-healing\" technology found in the original Skinomi® TechSkin, the protector features the latest in elastic polymerization technology that allow fine scratches, scuffs, and marks to disappear over time. The Skinomi® MatteSkin Screen Protector provides a unique layer of protective coating made to give your device a smooth, lasting finish.As with all Skinomi® products, we're so confident that you'll love the Skinomi® MatteSkin Protector that every screen protector and full body skin protector is covered with a 100% Risk-Free Lifetime Replacement Warranty. If the Skinomi® MatteSkin wears off, gets scratched, or damaged in any way, we'll replace it.",
    "price": 796.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51vW1o4S4pL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ABSNM%2BQPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51y%2B5fWuWKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ZNKIior7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gG4fO%2BJoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517JMrzC41L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407781011",
            "title": "Screen Protectors"
        }
    ],
    "similar": [
        "B075FVQN7P",
        "B07B428VVY",
        "B079K346ZL",
        "B079YM25J3",
        "B01CIZSANS",
        "B073WMCW1K",
        "B079Z1CH9B",
        "B01MXY4D67",
        "B07DFRDKWQ",
        "B01M3UARGR",
        "B074RXS6HG",
        "B073WMRJGQ",
        "B077BVXNNK",
        "B01IQGWHGE",
        "B06XCGJK2L",
        "B00WAKJSDI",
        "B07659SMNR",
        "B07CLJ6476",
        "B07115TH6B",
        "B06ZZB5BDL",
        "B01N6UGJK1",
        "B072QXYP56",
        "B0748B81CZ",
        "B01M24LF5E",
        "B07FSKKH5L",
        "B06XBSGR6B",
        "B075DJ7H27",
        "B079K1C15C",
        "B07B4KPFKM",
        "B004H8FTCU",
        "B01M97TSLO",
        "B075FLG6MV"
    ],
    "rating": null
}