{
    "asin": "B01MY8VDB2",
    "title": "AGPTEK M29 8GB MP3 Player Tempered Glass Slim Lossless Music Player with HD Headphone and Adjustable Sport Armband, Black",
    "brand": "AGPTEK",
    "feature": [
        "SIMPLE OPREATION: Independent volume keys and switch keys, 0.96 inch OLED, Bright user panel and Easy Navigation, one key to lock/unlock screen, Give you a more user-friendly experience.",
        "METAL MATERIL AND UNIQUE PROESS: High quality metal body makes it strong and beautiful:perfect touch felling,high strength/shocking and crushing resistance, Unique IMD technology can prevent the suface from scratches and abrasion, long preserving color brightness, not worry about fade.",
        "HiFi-CLASS BIG SOUND: Loss-less Sound quality.,Support Most Popular Audio format: MP3, WMA, OGG, APE(Normal/Fast),FLAC, WAV, AAC-LC, ACELP",
        "MULTI- FUNCTION &LARGE MEMORY:8GB Internal Capacity for up to 2000 songs, supports up to 64 GB Micro SD Card! (To avoid incompatibility, please use AGPTek Memory Card).JUST ONE ORDER for:music, FM radio, File browser, recording, Ebook function.",
        "AMAZING VALUE PACKAGE : also include: black HD headphone and Adjustable Sport Running Jogging Armband,you can do any exercise you want to do without any trouble."
    ],
    "description": "In order to provide a more humanized operating experience, AGPtek M29 MP3 player has designed a NEW user-friendly interface that is highly different from others MP3 players! Feel crazy to find your favorite songs! Simply creating the playlists by Media Go (for free) on your computer, and then transfer to the mp3 player. Or you can select from Artists, Albums, and Genres,etc.. Built in 8 GB memory, support up to 64 GB Micro SD Card! (Please use AGPtek or Kingston memory card to avoid incompatibility.) This will remember and continue to play music from where you left off last time! And you can enjoy reading E-books and listening to music at the same time. With the clear high sound quality, it may use as a voice memo whenever you need. Speak to it whenever any inspiration comes to your mind. Keep 30 stations as you like. Dimension(Screen):0.96\" OLED screen Item Dimension(MP3): 2.99* 1.33 * 0.29in Net weight: 1.48oz Charging time: 2 hours (for fully charge) Working time(after fully charged): 25-32 hours by earphones at medium volume, 14 hours by earphones at maximum volume Material: Full zinc alloy caseLyric format:LRCSupported Language: English, German, French, Italian, Dutch, Portuguese, Spanish, Russian, Hebrew etc. 1x MP3 Player 1x USB Cable1x HD headphone1x Sport Armband1x User Manual",
    "price": 2899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 40.0,
        "length": 300.0,
        "width": 130.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41wfFW0Q56L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DbMEG%2BQ%2BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41OX-x%2B0aKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41dz7LXCwXL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41cslIfwceL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61o%2Bp6iqHfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5121JHM6ZnL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172623",
            "title": "Portable Audio & Video"
        },
        {
            "node": "1264866011",
            "title": "MP3 & MP4 Players"
        }
    ],
    "similar": [
        "B07DFH7X8J",
        "B07DLTWGF6",
        "B07CMZSSTR",
        "B013ILR8ZC",
        "B07FFSGMGG",
        "B01N1JY5U3",
        "B01N1WG5A0",
        "B074SC8PY6",
        "B07F81T4P8",
        "B0789HM61T",
        "B07D6KWPCY",
        "B00Z9TL9K2",
        "B00HCMZ4H8",
        "B06XF8JP4T",
        "B07F6YM7TQ",
        "B06X3YHX8J",
        "B076F9HG6M",
        "B07FZ484D7",
        "B073RH4TGD",
        "B01LCRNYMU",
        "B07DLBC61S",
        "B07FJZ27D9",
        "B07CXX3WB4",
        "B07FBHSTXD",
        "B07GJ9ZQRM",
        "B0734X3V8Q",
        "B07C23WT1Z",
        "B07D3QPN3Z",
        "B072V433YX"
    ],
    "rating": "3.7"
}