{
    "asin": "B01M6YJEAH",
    "title": "Fire HD 10 Tablet with Alexa Hands-Free, 10.1\" 1080p Full HD Display, 32 GB, Marine Blue - with Special Offers",
    "brand": "Amazon",
    "feature": [
        "Brilliant 10.1\" 1080p Full HD display (1920 x 1200), up to 1.8 GHZ quad-core processor, 2 GB RAM, and up to 10 hours of battery life.",
        "Our largest display, now with over 2 million pixels, stereo speakers, Dolby Audio, and dual-band 802.11ac Wi-Fi—perfect for watching Full HD video, playing games, reading magazines, and streaming content seamlessly",
        "Use Alexa hands-free mode to pause videos, play music, open apps, show sports scores, display the weather, and more—just ask",
        "Brilliant 10.1\" 1080p Full HD display (1920 x 1200), up to 1.8 GHZ quad-core processor, 2 GB RAM, and up to 10 hours of battery life.",
        "Our largest display, now with over 2 million pixels, stereo speakers, Dolby Audio, and dual-band 802.11ac Wi-Fi—perfect for watching Full HD video, playing games, reading magazines, and streaming content seamlessly",
        "Use Alexa hands-free mode to pause videos, play music, open apps, show sports scores, display the weather, and more—just ask",
        "Call or message almost anyone hands-free, or make video calls to family and friends with a Fire tablet, Echo Spot, Echo Show, or the Alexa App. Instantly connect to enabled Echo devices.",
        "32 or 64 GB internal storage expandable by up to 256 GB (using the microSD slot). Watch downloaded videos anywhere with a Prime membership, Netflix plan, or Showtime subscription.",
        "Enjoy millions of movies, TV shows, songs, Kindle eBooks, magazines, Android apps, and games—including Netflix, Facebook, HBO, Spotify, and more",
        "Prime members get unlimited access to over a thousand books and magazines, millions of songs, and thousands of movies and TV episodes—at no additional cost"
    ],
    "description": "The all-new Fire HD 10 features our largest display, now in 1080p Full HD, 32 GB storage, 2 GB RAM, and up to 10 hours of battery. Now with Alexa hands-free. Expansive and immersive Fire HD 10 feature ...",
    "price": 14999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 175.0,
        "length": 1030.0,
        "width": 630.0,
        "height": 40.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01IQD7WVC",
        "B01IQD7UAU",
        "B01MXOV9P7",
        "B074Q2NYTG",
        "B00ZV9RDKK",
        "B01GEW27DA",
        "B01IQD7O6K",
        "B01J94T4R2",
        "B0794RHPZD"
    ],
    "rating": null
}