{
    "asin": "B01MRBELWJ",
    "title": "Casio Men's 'Twin Sensor' Quartz Resin Casual Watch, Color:Black (Model: SGW-600H-1BCF)",
    "brand": "Casio",
    "feature": [
        "100-meter water resistance, electro-luminescent backlight, digital compass, thermometer, world time, 1/100-second stopwatch, 100-meter water resistance, countdown timer, other: auto-repeat",
        "5 daily alarms, hourly time signal, full auto-calendar (to year 2099), 12/24-hour format, button operation tone on/off, regular timekeeping, approx. Battery life: 5 years on cr2025",
        "Quartz Movement",
        "Case Diameter: 50.6mm",
        "Water resistant to 100m (330ft): in general, suitable for swimming and snorkeling, but not diving"
    ],
    "description": "Casio's corporate creed is \"creativity and contribution.\" It expresses the company's commitment to contributing to society by offering the kind of original, useful products that only Casio can. Products with innovative functions assist people in their daily lives and keep society moving forward. They also bring joy to people and help to create new culture. When even a single new product is widely adopted, whole new markets develop, and this in turn fosters growth in related industries. This is the story of Casio's contribution to society-innovative products enhancing people's lives. Inspiration finally came to the engineer, who had never given up experimenting, on a day off just before the development deadline. After going out to lunch feeling low, he was watching some children playing with a rubber ball in the park next to the research and development center when the idea of the module floating in the space inside the ball suddenly came to him. In order to realize this concept, he came up with a hollow structure in which the module is supported at just a few points with a slight space around it. ​",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 490.00000000000006,
        "width": 350.0,
        "height": 229.99999999999997
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51gifj30mmL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31nkrMU86lL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41joOBvb8KL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qIwONt0jL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        },
        {
            "node": "6358540011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B07D9CDYTT",
        "B074TBNFV1",
        "B014W8J6XM",
        "B013M83HUG",
        "B06XS8Y29X",
        "B014Q9ENCG",
        "B07DGZGLKH",
        "B004KK63UC",
        "B06Y391SCN",
        "B07657P1FN",
        "B06XS9NQPF",
        "B000GX8WAG",
        "B014MN9RCM",
        "B07CWD6XLC",
        "B06Y3KMQZB",
        "B003MYYJD0",
        "B01NC06MSH",
        "B0796T6LSG",
        "B00BLJ7J4O",
        "B00DU411CY",
        "B003URSHKA",
        "product-description",
        "B013TPI9EG",
        "B00186YU4M",
        "B07CPZ8SLG",
        "B07195L174",
        "B06Y4HZF8L",
        "B0718XFT6J"
    ],
    "rating": "3.8"
}