{
    "asin": "B01M7NCT5O",
    "title": "Jaybird X3 in-Ear Wireless Bluetooth Sports Headphones – Sweat-Proof – Universal Fit – 8 Hours Battery Life – Blackout",
    "brand": "Jaybird",
    "feature": [
        "MINI WIRELESS BUDS – The X3 Headphones by Jaybird are designed to be as small as possible without sacrificing performance and looks",
        "UNIVERSAL SECURE FIT –The patented silicone ear fins securely attach to the top and back/lower surface areas of the ear for a snug fit, locking the earbuds in during workouts and intense physical activities. Includes multiple sizes of silicon and Comply tips for maximum noise isolation, fit, and comfort",
        "SWEAT-PROOF – Built to last with a sleek yet rugged design, the X3 Headphones are great for sports, workouts, and all weather conditions. Their hydrophobic nano-coating will keep moisture away, whether it's sweat, rain, or snow",
        "LONG BATTERY LIFE – Don’t let a low battery interrupt your day. The X3 has an 8-hour battery life. 15 minutes of charging gives you a full hour of playtime, so you’ll always be ready for anything. Operation : Operating: 32º F - 113º F (0º C - 45º C . Storage: 14º F - 122º F (-10º C - 50º C)",
        "PERSONALIZED SOUNDS – The MySound App allows you to tweak and customize the sound of your X3 headphones for a personalized experience, and save them for later as a profile"
    ],
    "description": "Go all out with the Jaybird X3 Wireless Headphones! These earbuds are designed to be tiny, but packed to the brim with functionality, unbeatable comfort, and incredible sound quality.The 3rd incarnation in Jaybird’s X series, these are the culmination of the company’s sports earbud innovations. Smaller than ever, the X3 has a longer battery life, better sound, and a more secure fit. The in-ear speaker design has been significantly reduced by 20% and houses an enhanced 6mm driver for subtle lows and a booming bass. The smaller frame is more convenient to handle and offers a comfortable fit for different ear sizes. The earbuds can even be worn underneath a helmet. The frame is made from sandblasted, injection-molded metal for heavy-duty durability and a sleek style that does not affect Bluetooth signal strength. Additionally, the hydrophobic nano-coating makes the whole earbud waterproof, preventing sweat, snow, and rain from affecting your soundtrip! The X3 serves as a reliable partner for athletes and savvy business travelers who are always on the go. Be ready to answer an important call anywhere with confidence! A wide variety of customized fit options are already included inside the box. The patented silicone ear fins (S, M, L) keep the buds securely inside your ear or can be used to hang them over the top. Lift the cord off your neck for a comfortable workout experience! Additionally, the Comply memory foam ear tips are designed to provide maximum noise isolation and comfort. They lock in the headphone for a super secure fit, whether you’re on a calm jog or riding an MTB trail.Also, the MySound app allows you to customize every aspect of your sound: from the rumbling lows to the sweetest highs! Customize every detail with the easy-to-understand interface. Compatible with iOS 9+ and Android 4.4+, your customized presets save directly onto the X3 buds, carrying them over to any music device or streaming service/app you use. Listen the way you want to or discover how your favorite athletes and artists enjoy their music through their custom sound profiles. Also, the Multipoint function allows you to simultaneously pair and connect the X3 buds to two different Bluetooth devices. Listen to your music through your laptop while still answering calls on your phone with the bud controller. You can also share your music with ease, as two separate buds can connect to the same Bluetooth device, eliminating the need to share earphones. You can even connect to your smartwatch and leave your smartphone at home!With 8 hours of battery life, the Jaybird X3 is just as ready as you are for any exciting adventure! Run wild and stop worrying about your sound quality. The X3 has got you covered.",
    "price": 11995.0,
    "listPrice": 12999.0,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": 2150.0,
        "width": 50.0,
        "height": 90.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31TYkfOKqNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41oIzq9b5aL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51n9A5nXVPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51K142AqjUL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5142kTUVrGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/416ikpwIrkL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61GrRhu-ixL._SX38_SY50_CR,0,0,38,50_BG85,85,85_BR-120_PKdp-play-icon-overlay__.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B07BMV5T2N",
        "B071G5LSFM",
        "B06XJN59GK",
        "B01EHIQASQ",
        "B06XJ4CP35",
        "B074JSB6GW",
        "B01MSNENAR",
        "B077ZGRVRX",
        "B01MYT0HKB",
        "B07BHF993Q",
        "B07BBVXJQQ",
        "B01IUP89LS",
        "B01L160DLW",
        "B01MSSEMWE",
        "B013HSW4SM",
        "B01N9AW1W1",
        "B07B9R67WR",
        "B00AIRUOI8",
        "B01MQQPHPN",
        "B0728G6PYG",
        "B01NACFV6I",
        "B07C8CPWCQ",
        "B01C228T7E",
        "B075VS7XN7",
        "B0787GX3HM",
        "B07B5RB7M9",
        "B01M2UVSHF",
        "B07CBQQJRW",
        "B079K66KD5",
        "B079SPB12V",
        "B06XJLBFGZ",
        "B01MF4MYT3",
        "B01N6DC2ZE",
        "B0753GRNQZ",
        "B01L28LWLE",
        "B06XFHJH4G",
        "B01MECNLU5",
        "B0721MP41Q",
        "B07G2R7NRR",
        "B07GVG8TJD",
        "B071SC5VNH",
        "B07GVCZPSJ",
        "B01G8JO5F2",
        "B01MXRJROK"
    ],
    "rating": "3.3"
}