{
    "asin": "B01MQFCYW0",
    "title": "Dust-Off Compressed Gas Duster, Pack of 8",
    "brand": "Dust-Off",
    "feature": [
        "Removes dust, lint and other contaminants from hard to reach areas",
        "Ideal for cleaning cpus, keyboards, computer mice, and workstations",
        "Also great for cleaning items around the home including collectibles, figurines and window blinds",
        "100% ozone safe, contains no cfcs, hcfcs, propane or butane",
        "10 oz. cans, last extra longer"
    ],
    "description": "Dust-Off dusters provide potent dust-removing power for practically any task. Ideal for office use including keyboards, CPU, desktops and mouse. Also great for home use including silk flower arrangements, repair benches, figurines and blinds. 100% ozone safe. Contains a bitterant to help discourage inhalant abuse. Ideal for everyday use. Falcon disposable dust-off is extra-large, more economical to use, and delivers its dust-removing power at less cost per gram than competitive products. Suitable for workstations, labs, repair benches, household use, on-location photography, etc. Dust-off compressed air safely and quickly blows away loose dust, dirt and lint from virtually any surface ... Computer screens, keyboards, printers, scanners, compact discs, audio equipment, cameras, lenses, enlargers, copiers, fax machines, video equipment, sewing machines, electric razors, microscopes, binoculars ... And more. Important Usage Information:NEVER shake or tilt can before or during usage. Use in upright position only.NEVER use near a potential ignition source.NEVER Spray into an enclosed space, such as a trash can or paper shredder.NEVER use on camera mirrors.AVOID skin contact with product in liquid form, may cause frostbite.AVOID contact with product in liquid form, may cause plastic to discolor.CAUTION: Use in well-ventilated area. Keep out of reach of children.Directions for Proper Use:Before Use: DO NOT SHAKE. Remove small tab on top of spray nozzle. Point nozzle away from self and others. Hold can upright and pull trigger to clear valve of any liquid.To Use:Hold can upright approximately 2 inch away from item to be cleaned. Pull trigger in a series of short blasts. (DO NOT SHAKE). To clean hard-to-reach areas, firmly insert extension tube into nozzle.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 800.0,
        "length": 750.0,
        "width": 750.0,
        "height": 850.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51peMxIDuvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kX1Lt7nnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41xVYZ7u7CL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dfkOuvxsL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "8 Packs"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        },
        {
            "node": "281501",
            "title": "Cleaning & Repair"
        },
        {
            "node": "3012916011",
            "title": "Compressed Air Dusters"
        }
    ],
    "similar": [
        "B00MNV8E0C",
        "B075M3G8SV",
        "B00006IFHD",
        "B01DPW2SR2",
        "B01J8VOG0Q",
        "B008KNFAOK",
        "B00DZYEXPQ",
        "B00FZYT278",
        "B005UMF4AE",
        "B075K8B12W",
        "B00X66L40K",
        "B00DB8NSG6",
        "B072FRMVFQ",
        "B0775T6VXQ",
        "B009XCK6PK",
        "B01MXHJ24W",
        "B00LH3DMUO",
        "B008HVHO62",
        "B00006JNNE",
        "B0787KXTFW",
        "B00SI67YRU",
        "B015ME9VQM",
        "B013274YEA",
        "B0050R67U0",
        "B00QSR9BT0",
        "B071JBBQ7R",
        "B0002KKIUA",
        "B00FM58A7I",
        "B073TQMSRY",
        "B00CMKA9HK",
        "B008BU67DK"
    ],
    "rating": "4.4"
}