{
    "asin": "B01MTB55WH",
    "title": "Anker Soundcore 2 Portable Bluetooth Speaker with Superior Stereo Sound, Exclusive BassUp, 12-Watts, IPX5 Water-Resistant, 24-Hour Playtime, Perfect Wireless Speaker for Home, Outdoors, Travel",
    "brand": "Anker",
    "feature": [
        "Unbelievable Sound: 12W of pure audio power with enhanced bass thunders from dual neodymium drivers. An advanced Digital Signal Processor ensures pounding bass and zero distortion at any volume.",
        "Intense Bass: Exclusive BassUp™ technology and a patented spiral bass port boost low-end frequencies to make the beats hit even harder.",
        "Outdoor-Proof: IPX5-protection safeguards against rain, dust, snow, and spills. Get incredible sound at home, in the yard, or anywhere else imaginable.",
        "24H Non-Stop Music: Anker's world-renowned power management technology and a 5200mAh Li-ion battery deliver a full day of sublime sound.",
        "Grab, Go, Listen: Classic design that has been refined and lightened, with effortlessly simple controls."
    ],
    "description": "Sound core 2 the Bluetooth speaker with enhanced sound and playtime from Anker, the choice of 20 million+ happy users industry-leading technology worry-free warranty awesome audio sound core 2 produces outstanding audio from an astonishingly compact speaker (165mm*54mm*45mm). upgraded 2x 6W drivers blast out rich, clear sound. Brilliant bass bring your music to life with proprietary Anker bass up technology. Deeper bass ensures a wide, balanced audio range. Play all day 24h-hour/ 500-song playtime means you can listen all day, and all night too. NOTE: playtime varies according to volume and audio content. Audio on-the-go IPX5 water-resistant rating and dustproof engineering mean you can bring your Beats anywhere - from the garden, to the beach. Upgraded materials provide smooth touch, and better grip. Streamlined connectivity listen for up to 66ft with latest Bluetooth 4.2 technology, while an in-built microphone makes hands-free calling a breeze. No Bluetooth? no problem, an aux port allows you to plug in and play. Worry-free warranty at Anker, we believe in Our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.",
    "price": 3999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 119.0,
        "length": 650.0,
        "width": 220.00000000000003,
        "height": 180.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41IzMGhkW2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412KlWGoLcL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/511rsXvm6DL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517gRDAhvKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Rh30tAl5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51zSGJJrFQL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172623",
            "title": "Portable Audio & Video"
        },
        {
            "node": "689637011",
            "title": "Portable Speakers & Docks"
        },
        {
            "node": "7073956011",
            "title": "Portable Bluetooth Speakers"
        }
    ],
    "similar": [
        "B01D4BY2SC",
        "B0734WQXQD",
        "B074XN1LH3",
        "B074NS9P2J",
        "B01DFKC2SO",
        "B075J2XN9H",
        "B076G6CML5",
        "B00ZY1J5J2",
        "B07526LSFG",
        "B071JN4FW6",
        "B074P2Z9B8",
        "B07594HZ6Y",
        "B079GPYJ3N",
        "B00R124LAK",
        "B07FM4LHT6",
        "B016XTADG2",
        "B01N31DTF5",
        "B078YJRN6C",
        "B077YJ8ZWB",
        "B07BHNRFKC",
        "B073DYSFTX",
        "B01CQOV3YO",
        "B07CMSYG9D",
        "B07691THV3",
        "B073SQYXTW",
        "B078WJS4G2",
        "B0782522QY",
        "B077JFK5YH",
        "B01MQK2QLI",
        "B01IEHIMLY",
        "B07CSPLGV9",
        "B06XCM9LJ4",
        "B074836LY8",
        "B078WJDH3H",
        "B01DB758X2",
        "B073F77G6S",
        "B072F4J4Y8",
        "B015WCV5Q8",
        "B07BHP4W36",
        "B01FGEJWXU"
    ],
    "rating": "4.6"
}