{
    "asin": "B01M19FDRW",
    "title": "Portable Waterproof Bluetooth Speaker Wireless Speaker NFC Mini Outdoor HIFI Speaker Box Hands-Free Speakerphone with Built-in MIC, Stereo Sound, over 8 Hours Playtime-Black",
    "brand": "Wisdomcreate",
    "feature": [
        "✔ULTRA DURABILITY & SMART DESIGN. Made of solid TPU and ABS, this speaker is crash-proof, IP65 water resistant and dustproof, great for indoor and outdoor activities",
        "✔GREAT SOUND QUALITY & WIDE COMPATIBILITY. Independent HIFI speaker unit and crafted sound chamber create 360 degrees omni-directional audio. With built-in intelligent decoding function, it also supports AUX input and pre-stores music of WAV, MP3, APE, WMA and FLC",
        "✔DESIGNED FOR PORTABLE CARRY. The metal ring is made for portable carry. And you can easily operate it under the voice prompt with clear marked buttons on its body. With built-in 1500mah polymer lithium battery, it provides up to 12 hours playback time per full charge",
        "✔HANDS-FREE CALL & SMART SWITCH. With intelligent noise reduction system and embedded MIC, this wireless speaker helps you conveniently pick up a call in car, bathroom, or at home during it is connected to your Smartphone, or initiate a small conference call. Answer or end the call with your phone or by press the “phone call answering” button on the speaker box.",
        "✔BLUETOOTH CONNECTION & EASY PAIRING. Faster transmission speed and longer transmission distance, faster pairing and lower power consumption. In a range of 10 meters (33 ft), it can easily pair with your phone, tablet and all other Bluetooth-enable devices. Automatically remembering successfully-paired devices, it is auto-connecting and simple and convenient to use"
    ],
    "description": "This wireless one-touch NFC connection speaker is compatible with all kinds of Bluetooth devices and supports auxiliary inputs too. Its independent HIFI speaker unit and crafted sound chamber eliminates ambient noise and delivers powerful and stunning effect, which will overturn your auditory sense! With build-in 1500mAh high capacity battery, it supports up to 12 hours playtime. You can make long time phone calls while release your hands. This Bluetooth speaker is ideal for shower, camping, biking! It is also a fantastic gift for birthdays, wedding, anniversary, holidays or any other occasions. Bluetooth Version: Bluetooth 4.0 Power supply: built-in rechargeable polymer lithium battery, 1500mA; USB cable Output Power: 3W SNR (Signal to Noise Ratio): >75dB Pairing Range: up to 10 meters Playing Time: 8~12hours Material: TPU/ABS Product Dimension: 90mm (L) x 81mm (W) x 41mm (H) Net Weight: 130g 1 * Wireless Speaker 1 * USB Charging Cable 1 * User Manual",
    "price": 990.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 65.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/619ptrny4JL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5147v5cMWgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VNPGZYpvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41VSKXg3OvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BuynuD%2BSL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61vhNOOBblL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "667846011",
            "title": "Home Audio"
        }
    ],
    "similar": [
        "B073WFJ7HV",
        "B07797FJKY",
        "B071XY8VWP",
        "B0753BPVPX",
        "B071RWJ39R",
        "B07CPL947B",
        "B01GF4XZ24",
        "B06XCM9LJ4",
        "B07C9XWS93",
        "B01MTTYUOS",
        "B079B97DMW",
        "B071JN4FW6",
        "B01DFKC2SO",
        "B075WZ16CX",
        "B0776NXYBD",
        "B074QQ5WTC",
        "B07CN748CX",
        "B01EZRTHG6",
        "B07F37NYSH",
        "B01M6UKNGD",
        "B06XGG87RX",
        "B079DY2PQB",
        "B016XTADG2",
        "B01MTB55WH",
        "B004TBF90C"
    ],
    "rating": "3.7"
}