{
    "asin": "B01MQV6QL8",
    "title": "Screen Protector for iPhone 7 - Anker [2 Pack] GlassGuard Premium Tempered Glass Screen Protector, with Double Defense Technology for Apple iPhone 7 (4.7 inch) - [Upgraded]",
    "brand": "Anker",
    "feature": [
        "Double Defense: Reinforced glass for durability and pliability—providing twice as much armor as alternative models. Built using premium Japanese glass for superior performance.",
        "Precision Engineering: Due to the iPhone 7's curved-edge design, GlassGuard is designed slightly smaller to *ONLY* cover your iPhone's *FLAT* screen, not the curved edges or bezel.",
        "Ultra Clarity: Retain your iPhone 7's beautiful retina display. Showcase your content and get the clearest view possible.",
        "Spotless Display: Hassle-free installation process ensures a simple, accurate and bubble-free application.",
        "Boost Your iPhone: Anti-smudge and anti-scratch. Your screen stays pristine, while retaining functionality."
    ],
    "description": "The Premium *Double Defense* Tempered Glass Screen ProtectorIndustry-Leading Technology 99% Positive Feedback Built to be different. Innovative engineering ensures strength is increased by 100%, withstanding up to twice as much pressure as alternative protectors. At a mere 0.3mm and weighing less than 5g, GlassGuard is one of the sleekest protectors on the market. Designed so that you forget it's there, preserving all you love about your iPhone 7. Anti-fingerprint - simply wipe to remove any gunk and make your screen pristine again. Industry leading 9H hardness ensures your phone stays safeguarded.Complete compatibility with 3D Touch technology. GlassGuard doesn't compromise the original sensitivity and smooth feel of your iPhone 7's screen. Strong adhesive ensures complete, seamless integration with your phone. Say goodbye to peeling and bubbles. At Anker, we back our screen protectors with a lifetime warranty. That means, no matter how long you've used it, we'll offer you a quick, no-hassle replacement or refund if: • You encounter installation problems such as bubbling or the product does not match your screen size. • Your screen protector sustains wear and tear or scratches during normal use. The screen protector is designed to safeguard your phone, but is not guaranteed or expected to provide protection from extreme trauma like drops or impacts. GlassGuard cannot cover the entire screen due to the curved-edge design of iPhone 7. Precision border also allows space for phone covers.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 509.99999999999994,
        "width": 229.99999999999997,
        "height": 0.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41EVZqMf4aL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51A5wrX5d1L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/516xOhFueoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41KPVwiBd8L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51S-W%2B2waeL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41PpPqQSaKL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407781011",
            "title": "Screen Protectors"
        }
    ],
    "similar": [
        "B01MY52X6O",
        "B07FB2JTPM",
        "B07C4W3JVY",
        "B07C56X4D3",
        "B00EA1P8OI",
        "B01G1XH46M",
        "B074YXH9WX",
        "B074PNV78J",
        "B00SF6VSVG",
        "B01415QHYW",
        "B074YZD9HR",
        "B077BVXNNK",
        "B07GFJTB5R",
        "B07F74D4JL",
        "B01D221GPA",
        "B074Z1QDNP",
        "B07FTGQQJS",
        "B07GDPR58N",
        "B07GPYN873",
        "B01A6L85CC",
        "B07D55WK69",
        "B078BXMP6F",
        "B01FGEJWXU",
        "B00DTXA578",
        "B07H4PNWZW",
        "B00XIS7L9Y",
        "B074DT4RTH",
        "B07D5B47NG",
        "B01KNVF4SI",
        "B074TC1K4J",
        "B00OQ19QYA",
        "B01JRJ6ME2",
        "B016JLKG1G",
        "B07DFZ72BG",
        "B076P6K11M"
    ],
    "rating": "4.1"
}