{
    "asin": "B01N9C9AT6",
    "title": "Mixoo Capacitive Stylus Pen,(Disc Fiber Tip 2-in-1 Series),Fine Tip,High Sensitivity Precision,Stylus Ipad,iPhone Other Touch Screens Devices, Black",
    "brand": "Mixoo",
    "feature": [
        "PRECISE POINT DISC STYLUS PENS FEATURE: Nicely weighted aluminium barrels with a fiber-tipped head on one end and a silicon disc stylus under a screw cap at the other end. Both two ends tips are replaceable. Made from stainless steel and Aluminum without plastic parts. Provides a smooth pen-like writing experience for your touch screen tablets and smartphones.",
        "EXCELLENT DESIGN: Transparent disc provides much better flexibility and accuracy, you can see through on the screen of where exactly you are pointing. Presented black box, rubberised grooved grip making gripping easy and comfortable. Lightweight and Clips right to your carrying case or pocket, Keep your mobile & Tablet free from fingerprints on the screen; Perfect as GIFT!",
        "UNIVERSAL: Compatible with Apple iPads, iPad Mini, iPhones,All Kindle, Kindle Fire, Kindle Paperwhite Android Tablets, Android Phones, Samsung Galaxy, E- readers, Smartphones and other Capacitive Touch Screens devices",
        "CONTENTS: 1 piece Fine Point Disc Tip Stylus, 2 spare replacement small Dics tips,1 spare replacement fibre/ fabic tips included",
        "SATISFACTION GUARANTEE: 30 days money back guarantee for any reason"
    ],
    "description": "Mixoo Stylus Mixoo stylus pen has an excellent weight in your hand which leads to a luxurious feel alone with the nice padding on the precision end. It gives you a real pen feeling. Accuracy The 2mm rubber point of the disc tip(diameter is 6.8mm) allows you select small icons, click small alphabet and gives you the accurate selection. With the transparent disc, you can see exactly where you're pointing at; It's perfect for drawing apps. Compatibility Compatible with most capacitive touch screen devices including ipad, iphone, kindle,kindle fire, samsung galaxy phones, tablets and smart phones. NOTE: Do not compatible with Lenovo yoga 720. Changeable Tips Tips of both sides are replaceable and it's easy to be done in second without tool. Each stylus pen is provided with extra 2 disc tips and 1 fiber tip. About the Product Length:5.5\"(140mm) Pen tube diameter 0.35\"(9.5mm) Disc diameter: 0.27\" (6.8mm)(2mm rubber point) Fiber tip Diameter:0.24 (6mm) Weight: 24g Material: Stainless steel, Aluminum What's in the Package *1pc stylus pen: BLACK *2pcs replaceable disc tips *1pc replaceable fiber tip Attention tips in use: 1: Please do not rip or cut off the plastic blob on the end of the tip; This part is to receive and conduct touch screen signal, without which the styli can not work normally. 2: Notice: Some thicker tablets protective cases with special materials (e.g. Otterbox case + protective film 2 in 1 series) may reduce the sensitivity of stylus due to the low conductivity of material; We do not recommend purchasing Mixoo stylus pens if you are using this kind of phone case. However, Mixoo stylus can be applied to other most common phone cases.",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 640.0,
        "width": 80.0,
        "height": 270.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/319zJZlmi3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41VCKVdj1bL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51rihfd%2BaoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ne2AhhbEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41avWbMEAdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41TaIscXPUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512SpAK-hmL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        },
        {
            "node": "172493",
            "title": "Input Devices"
        },
        {
            "node": "3015430011",
            "title": "Digital Pens"
        }
    ],
    "similar": [
        "B01N2OJX82",
        "B00B24I4II",
        "B074847T3T",
        "B00C2JCXHU",
        "B01J90MSDS",
        "B00JPINIOS",
        "B073HZSSDJ",
        "B01N1MZ5T6",
        "B01JUJR9X2",
        "B013JZCAZK",
        "B00N1BRWLA",
        "B01CGN6E3U",
        "B01M9JKECQ",
        "B01I0YJQNO",
        "B0797GFQQ4",
        "B00PYAOYNK",
        "B076B7S6YZ",
        "B06XQQ3WY5",
        "B071P545K2",
        "B074NXCQB8",
        "B01E0LHE26",
        "B018VASU3O",
        "B07528YXC1",
        "B073HXC6YF",
        "B01M6YJEAH",
        "B07D7ML3WN",
        "B07C7XY7GS",
        "B073HZJKLT",
        "B00LTAOU7Y",
        "B071JY98QL",
        "B07DN6SBFD",
        "B07C8BJ1NT",
        "B0794RHPZD"
    ],
    "rating": "4.2"
}