{
    "asin": "B01N9O1RB2",
    "title": "Cascade Mountain Tech (2 Pack Portable LED 2 in 1 Flashlight and Lantern. 6 AAA Batteries Included. 200 Lumens Great for Emergencies, Camping, Hiking",
    "brand": "Cascade Mountain Tech",
    "feature": [
        "TWO ULTRA BRIGHT: 200 Lumens designed for a longer lifespan",
        "2 -IN-1: Both a flashlight and lantern in one small hand held light.Simply pull to extend and it is a lantern, or keep it closed for a flashlight",
        "THREE SETTING: equipped with a the option to dim from high and low lighting as well as a strobe light for emergencies",
        "DEPENDABLE BUILD: Constructed with high gradematerial; promising long-time durability, The extremely lightweight build allows you to take your lantern on the go with ease",
        "PORTABLE: When travelling collapse the lantern to a smaller size; store it effortlessly in your backpack, purse, suitcase, and more.or use the carry handle for your night walking adventures, or lighting the path of your backyard, no matter where your take them these lanterns will shine bright"
    ],
    "description": "This is one of our favorite lanterns at Cascade Mountain Tech. Its small size has provided a very convenient light source whenever needed. The handle can fold down when using as a flashlight or simply twist the top - pull up and you have a compact ultra-bright lantern. The lantern position has convenient metal handle which can be hung on a tree brand to hang evenly or rest on a table at home. We have designed this lantern to be durable while compact so it can last with you during Hiking trips in the rain or hot summer nights camping. Add this piece to your home to be prepared: · Place in the garage for looking for those hard to find tools 200 Lumens Multiple Light Settings · Flashlight - 4” high when collapsed to hold as a flashlight · Lantern - 5.5” high when extended to sit or hang as a lantern · Diameter - 1.5” (approximately) · Weight - 4.5 oz or .27 lbs (for one lantern) Each light requires 3AAA batteries – your purchase comes 6 AAA batteries",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 170.0,
        "length": 150.0,
        "width": 150.0,
        "height": 400.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31FDrV0%2Bk6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41gTMSNJydL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41VdBF%2BnULL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31HuYFF-oNL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61c2m3iEIYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CGzXqhxzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412heVTXtlL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "3180231",
            "title": "Safety & Security"
        },
        {
            "node": "3180261",
            "title": "Flashlights"
        },
        {
            "node": "2445458011",
            "title": "Lantern Flashlights"
        }
    ],
    "similar": [
        "B01FGE90WI",
        "B01KW4BI5E",
        "B01EFTVXXO",
        "B07D3S8K9L",
        "B00F73BO7S",
        "B078WRLTD8",
        "B078JK77HP",
        "B00LH3DMUO",
        "B07BVRMHWS",
        "B076M5ZVKR",
        "B01NCZWBCL",
        "B01J8B219O",
        "B073P3MCSX",
        "B079XX1KXT",
        "B073P2MZ3Q",
        "B078T26FQR",
        "B06VSK99MC",
        "B011J8NIIM",
        "B01KT75RRY",
        "B07178P9JT",
        "B077883KBN",
        "B01C5QSENQ",
        "B01KH2JP5G",
        "B0784F9TQ8",
        "B07BS5M4B1",
        "B077B3GPCS",
        "B076DVVTPW"
    ],
    "rating": "4.4"
}