{
    "asin": "B01N53MYQL",
    "title": null,
    "brand": "Hi-Spec",
    "feature": [
        "♦ USE ME ANYWHERE: This vise can be easily fitted to any desk, worktop, workbench, countertop or table anywhere you require a strong hold: home, garage, den, office, study, workshop, bench and outdoor locations. Whether sculpting, modeling, painting, gluing, soldering, crafting, tying fishing lines, sanding or woodworking invest in a tool that will keep your project exactly where you need it!",
        "♦ BALL & SOCKET JOINT: Allows the head of the vise to be rotated 360° and fixed into a wide variety of angles so your work is exactly where you need it and can be moved without having to release jaw pressure. The base clamp can be easily fixed to any surface up to 2” thick with a textured pad to maintain maximum grip",
        "♦ PROTECT DELICATE PARTS: Soft rubber jaws maintain a strong a hold on your project without risk of damaging or marking it, ideal for precision soldering tasks or delicate crafting projects. Pads are removable for cleaning leaving tempered high-grade carbon steel jaws to more heavy duty tasks and to increase the jaws opening capacity",
        "♦ USE ME ANYWHERE: This vise can be easily fitted to any desk, worktop, workbench, countertop or table anywhere you require a strong hold: home, garage, den, office, study, workshop, bench and outdoor locations. Whether sculpting, modeling, painting, gluing, soldering, crafting, tying fishing lines, sanding or woodworking invest in a tool that will keep your project exactly where you need it!",
        "♦ BALL & SOCKET JOINT: Allows the head of the vise to be rotated 360° and fixed into a wide variety of angles so your work is exactly where you need it and can be moved without having to release jaw pressure. The base clamp can be easily fixed to any surface up to 2” thick with a textured pad to maintain maximum grip",
        "♦ PROTECT DELICATE PARTS: Soft rubber jaws maintain a strong a hold on your project without risk of damaging or marking it, ideal for precision soldering tasks or delicate crafting projects. Pads are removable for cleaning leaving tempered high-grade carbon steel jaws to more heavy duty tasks and to increase the jaws opening capacity",
        "♦ T-BAR TIGHTENING: Jaws are opened and closed using a sliding T-bar mechanism which allows for delicate tightening where required, as well as creating high levels of torque for maximum tightness when you need it",
        "♦ HIGH-GRADE MATERIALS: Made from cast-aluminium to withstand high levels of torque and pressure, yet offering great levels of portability. Jaws are made from a hardened High-Carbon Steel Alloy so they won’t twist, deform or give with under pressure, and moving parts are precision-milled heat-treated chrome plate carbon steel to offer reliability and protection against corrosion. Covered by Hi-Spec Guarantee"
    ],
    "description": "Get a Firm Hold of Your Hobby, Art & Crafts and Modeling Projects! Invest in a reliable tool to give you assistance when two hands are simply not enough! Great for DIY projects around the home, office ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 180.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B07CTHCJPM",
        "B00XWCEI8S",
        "B0058ED2NA",
        "B071DK732Z",
        "B01AA12CWM",
        "B018QNM7V2",
        "B01FKJ5EK6",
        "B00SRGJ53W"
    ],
    "rating": null
}