{
    "asin": "B01N8T7ACD",
    "title": "Hasbro Richard Garfield's Robo Rally Avalon Hill Game",
    "brand": "Hasbro",
    "feature": [
        "The board game is a strategic race of survival and sabotage",
        "Use playing cards to direct robots' moves through the racecourse",
        "Dodge obstacles and make it to each checkpoint to win",
        "For 2 to 6 players",
        "Includes 6 double-sided gameboards, double-sided start board, 6 robot figures, 6 reboot tokens, 36 checkpoint tokens, plastic priority antenna, 6 checkpoints, 48 plastic energy cubes, 30-second sand timer, 6 robot player mats, 40 upgrade cards, six 20-card programming decks, 6 special programming cards, 74 damage cards, vac tray, label sheet, and game guide"
    ],
    "description": "The robots of the Robo Rally automobile factory spend their weekdays toiling at the assembly line. They put in hard hours building high-speed supercars they never get to see in action. But on Saturday nights, the factory becomes a world of mad machines and dangerous schemes as these robots engage in their own epic race. Enter the world of mad machines and dangerous schemes in the Robo Rally board game. Players control their robot with game cards which reveal directions on how the robots can move through the hectic Robo Rally automobile factory. Chaos ensues as all players reveal the cards they've chosen. Players face obstacles like industrial lasers, gaping pits, and moving conveyer belts -- but those can also be used to their advantage! Use strategy to outsmart rival robots while racing towards each checkpoint in your chosen course in numerical order. Be the first to reach each of the checkpoints in numerical order to win! It takes speed, wits, and dirty tricks to become a racing legend! Do you have what it takes?",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 317.0,
        "length": 250.0,
        "width": 1160.0,
        "height": 1210.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61xocSlZpYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xu5KGDJvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61nNel0q8LL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5111%2B46LAuL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "165793011",
            "title": "Toys & Games"
        },
        {
            "node": "166220011",
            "title": "Games"
        }
    ],
    "similar": [
        "B0716S4WML",
        "B00IVLIW5K",
        "B07DZXQZSG",
        "B079P3DJCH",
        "B01L8N122C",
        "B06X9HC6BL",
        "B0738HD8TH",
        "0975277324",
        "B00H4OKN48",
        "B000XLU8H6",
        "B074WC4NHW",
        "B00FNKYPYY",
        "B00HN2BXUY",
        "B010TQY7A8",
        "B078FHHC1P",
        "B072B6QVVW",
        "1589945131",
        "B00SAUAP5C",
        "B002SQBB3O",
        "B075MNXB2X",
        "B00E97DWKA",
        "B075GJ2MGR",
        "B0009HLSP0",
        "B00OZTUQWE",
        "B0007YDBLE",
        "B077S5SB6L",
        "B00IUAAK2A",
        "B0037W5Y2W",
        "2914849648"
    ],
    "rating": "4.1"
}