{
    "asin": "B01N24JPG5",
    "title": "Hamilco Universal Cable Electronics Organizer Electronics Accessories Case - Cable Organizer USB Drive Shuttle Hard Drive Case Travel Organizer",
    "brand": "Hamilco",
    "feature": [
        "External Dimension: 9.75x7.25x1.0 inches, can fit in handbags and backpacks",
        "High Quality – This Cable Organizer Case is made of heavy-duty, durable and waterproof nylon.",
        "Flexible Accessories/Cable Organizer Case - Specially Designed to Hold Items like Cables, Memory Cards, Hard-Drive, Adapters, Pens and e.t.c",
        "Universal Cable Organizer Case with 18 elastic loops to hold your items - cables, flash disk, etc. It has 6 Mesh pockets and 1 zipper Mesh",
        "Accessories/Cable Organizer Case Designed with well-padded semi-flexible covers that offer excellent protection for your accessories."
    ],
    "description": "Keep your electronic accessories organized in this Portable Cable Organizer Case. find the cord or electronic accessories that you need by storing them in this Cable Organizer Case. It is perfect for storing hard drive, cables, adapters, chargers, memory cards, batteries, pen e.t.c. - this Cable Organizer Case is made with Heavy-Duty, Durable, and Waterproof Nylon. The interior features 6 open mesh pockets and 18 elastic loops on one side and 6 compartments with elastic loops on the other side. The organizer keeps your cords untangled and other electronic accessories organized for easy access. Travel with all your electronic accessories organized together in one place with this portable Cable Organizer Case. This Cable Organizer Case allows you to easily travel with all your cords and other electronic accessories organized together in one place Find the cord or accessory that you need faster and quicker by keeping them stored in this organizer 1 side features A zipper Mesh and 6 open mesh pockets with elastic bands; other side features 6 compartments with elastic bands 9.75x7.25x1.0 inches Made of Heavy-Duty, Durable and Waterproof Nylon, Zipper",
    "price": 1199.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41lN-DW6tFL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YMVtFCunL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41IFW7cGDFL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41YZTHFVlTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41REyPLp1EL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        }
    ],
    "similar": [
        "B072MZ8G1R",
        "B002VPE1QG",
        "B0799LZFXP",
        "B07G46M2N8",
        "B071CHGQHD",
        "B00X5RV14Y",
        "B06XQPY49Z",
        "B07479LGLT",
        "B01N1IUOTE",
        "B06Y2X83WG",
        "B079FHXMK3",
        "B071CLB7KW",
        "B01GB3ZNN8",
        "B06XRWPXWT",
        "B014R4IGHS",
        "B07CPNH2BC",
        "B07CJ4BMD9",
        "B06XBJGWYY",
        "B074DVKXT3",
        "B076VK38DB",
        "B017SKRWL4",
        "B075WQK25R"
    ],
    "rating": "5.0"
}