{
    "asin": "B01N305T7I",
    "title": "Hofumix Arthritis Gloves Compression Gloves Fingerless Gloves Magnetic Anti-Arthritis Therapeutic Therapy Fingerless Gloves Relief Hand Pain Relief Heal Joints Relief - a pair",
    "brand": "Hofumix",
    "feature": [
        "They really help the circulation issue as well as arthritis for the old people,octogenarian.",
        "It also can help your hands which is slowly using function due to osteo arthritis.",
        "The seam on the outside edge is very irritating to boney wrists. Very comfortable and light weight.",
        "Gloves fit well and help with arthritis pain. Comfortable to wear.",
        "Materials: 85% Nylon and 15% Lycra. Package includes: 1pair gloves. One size fits most of people."
    ],
    "description": "They can do ease the arthritis pain and you don't hardly notice them on your hands. Just be sure to turn your rings to the inside of your hand or else that will hurt! Hofumix is doing best to offer superb service for our customers. Shipment Method: Hofumix's packages are shipped by USPS or FEDEX. Usually it takes 3-25 days on transit. Sometimes since the busyness of our system, tracking number fails to be updated promptly andcannot be showed on your order detail page. Please do not worry about it, just contact our customer service as soon as possible then we will do everything we could help. Return Policy: To provide superb service for our customers, Hofumix offers convenient after-sales service: If you receive broken, damaged or wrong item, please contact our customer service with pictures, after confirming it, we will refund or resend in 24 hours and youcould keep the item without returning. If you do not like it, we are willing to arrange returning, or give several advice we think is feasible or more convenient. If for any other reasons, we encourage our customer contact our customer service, we will response in one business day and try our best to help you.",
    "price": 798.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 100.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41TQpYY6%2B6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Rpv-ZHQ7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41OBbeFDtjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41lJBiO8ElL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51PMUQe6hUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51EiaWefkmL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/4134p0JJWcL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3775161",
            "title": "Medical Supplies & Equipment"
        },
        {
            "node": "3775541",
            "title": "Braces, Splints & Supports"
        },
        {
            "node": "8619203011",
            "title": "Arthritis Gloves"
        }
    ],
    "similar": [
        "B071NWDQQ7",
        "B00OA54EEE",
        "B00ZO4WW7Q",
        "B072J8W8L9",
        "B07173ZJWY",
        "B07DHP18NR",
        "B01N0Z46JR",
        "B00VTR6MRI",
        "B01NARFY39",
        "B071YHWRNS",
        "B00E7V9MF2",
        "B01N4B6VY4",
        "B00HF4T0IW",
        "B07CG3MSTK",
        "B00ZO4WWBM",
        "B01GUOFDG0",
        "B0734RS6MF",
        "B00VTR6MNW",
        "B072FP932W",
        "B00VTR6MDM",
        "B01LWW6NXQ",
        "B072TNBH5V",
        "B00UKC7DGW",
        "B071KQ4T1P"
    ],
    "rating": "2.9"
}