{
    "asin": "B01NC3CK4J",
    "title": "Michael Todd Soniclear Antimicrobial Specialty Replacement Head Brushes",
    "brand": null,
    "feature": null,
    "description": "Soniclear’s antimicrobial protected LUSH CASHMERE BRUSH HEAD allows you to confidently cleanse & exfoliate in one simple step without taking time to disinfect your brushes between use. Now available for even the most sensitive skin or as an additional polishing final step in the cleansing process for all skin types. Remove your Antimicrobial LUSH CASHMERE BRUSH HEAD from the box. Secure the Antimicrobial LUSH CASHMERE BRUSH HEAD into your water proof Soniclear cleansing system by twisting and pressing gently until it snaps into place. Remove protective cap. Follow the cleansing instructions in the operating manual that came with your Soniclear. When finished cleansing, wash your brush in warm soapy water and return to the charging cradle. Michael Todd Beauty is the creator of award-winning beauty tools designed to prepare skin to apply moisturizers and serums, like our Soniclear - the world's first sonic cleansing brush with antimicrobial protection.",
    "price": 1800.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 8.75,
        "length": 220.00000000000003,
        "width": 220.00000000000003,
        "height": 150.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31jokvun95L._SX50_SY65_CR,0,0,50,65_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51L-SJaawiL._SX50_SY65_CR,0,0,50,65_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qCAWXsHYL._SX50_SY65_CR,0,0,50,65_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31l2g2tFRiL._SX50_SY65_CR,0,0,50,65_.jpg"
    ],
    "attributes": null,
    "categories": [],
    "similar": [
        "B07DYDBNRB",
        "B07DYFNLKK",
        "B00VVMM1S0",
        "B01ND4R0NU",
        "B01N5Y14T4",
        "B0758JDTXK",
        "B01MZIJFIX",
        "B07DCHFGSZ",
        "B00VVDCBUC",
        "B07DYC2N38",
        "B019FYF466",
        "B01IHAO4GU",
        "B016IT3738"
    ],
    "rating": "4.4"
}