{
    "asin": "B01NBOPJW2",
    "title": "Wireless Headphones, Anker SoundBuds Tag In-Ear Bluetooth Earbuds Smart Magnetic Headphones with aptX Technology, CVC 6.0 Noise Cancellation, 6 Hour Playtime — Bluetooth 4.1 Headset with Mic",
    "brand": "Anker",
    "feature": [
        "Enjoy Better Sound: Rich bass and crystal highs are delivered via Bluetooth 4.1 and high-fidelity aptX lossless technology.",
        "Intuitive Design: Smart-magnets power on when separated and automatically pair with last connected device.",
        "Sweat Resistant: Innovative nano-engineering delivers robust performance in practically any environment.",
        "A Tailored Fit: Customize your hold with multi-size EarTips and patented AirWings - engineered for superior comfort and grip.",
        "What's In the Box: S/M/L EarTips, S/M/L/XL AirWings, FitClip, Micro USB Cable, Travel Pouch, welcome guide, our worry-free 18-month warranty and friendly customer service."
    ],
    "description": "Tag The High-Fidelity Earbuds with Smart-Magnet Control From , the Choice of 20 Million+ Happy Users Industry-Leading Technology Worry-Free Warranty We've boosted the bass for heavyweight performance. AptX lossless technology delivers smooth, high-fidelity audio. Pull apart to turn on, clip together to turn off. SoundBuds Tag function intuitively, automatically connecting to your devices in seconds — just pull and play. Listen while jogging, or in the rain. Cutting-edge nano design means SoundBuds Tag are completely rugged, sweat resistant, and equipped for practically any environment. Fully charge in an hour and a half, and bank enough juice for the day. A 6 hour battery provides plentiful power… from your morning commute, to your end-of-day workout. Multi-sized EarTips and patented flexi-fit AirWings allow you to customize your hold. Lock in, isolate outside noise and enjoy a better audio experience. Multi-function remote allows you to manage your sounds seamlessly. In-line microphone with cVc noise cancellation makes clear, hands-free calling a breeze. At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support.",
    "price": 1998.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31uA-viEcnL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X4j8mpWIL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41JdPE%2BRE6L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51L4XTddG4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/519f6vrxwJL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WIIBXx2ZL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Mfb1h0iaL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097478011",
            "title": "Earbud Headphones"
        }
    ],
    "similar": [
        "B06ZXR7646",
        "B071GNH9MT",
        "B07DWCKJM2",
        "B07GV9DNV2",
        "B07C4WCPG6",
        "B07F7R97XP",
        "B01N31Z0FX",
        "B015IEW1AY",
        "B075NRNZWD",
        "B0721MP41Q",
        "B07F3T7VGD",
        "B07F434GN1",
        "B072JJNYQY",
        "B071JBBYCR",
        "B01N6DC2ZE",
        "B07G13G7TC",
        "B01D3QZB2Y",
        "B07CB7Y44K",
        "B07GZFWHPK",
        "B077XNCSQS",
        "B07CG7KW3D",
        "B07BKN8Q79",
        "B00S2P0M1C",
        "B07FLKQ2N1",
        "B07D72XKY2",
        "B00N771OEE",
        "B01L160DLW",
        "B07GH5LBK6",
        "B07DVCQ47Y",
        "B00NTRQ4KG",
        "B07BMV5T2N",
        "B07GB78HG1",
        "B071JXMMK6",
        "B07F2BK9VK"
    ],
    "rating": "3.8"
}