{
    "asin": "B01N7G8G0S",
    "title": "Bluetooth Headphones, Hotncold Wireless Sport Stereo In-Ear Noise Cancelling Sweatproof Headset for iPhone 7/ 7 Plus iPhone 6s Samsung Galaxy S7 and Android Phones",
    "brand": "Hotncold",
    "feature": [
        "Our Bluetooth headphones feature Bluetooth 4.1 audio decode technology, giving these wireless earbuds unparalleled stereo sound quality. Digital noise reduction technology, intelligently filter ambient noise, enable clearer sound during calls and while listening to music; You've truly never heard music sound so good from sport headphones!",
        "These Bluetooth headphones for iPhone 7, iPhone 7 PlusiPhone 6s, iPhone 6, Android phones & tablets and other Bluetooth devices",
        "With our Bluetooth headset, running & workouts can go for longer to the beat! The polymer 80mAh battery in the Bluetooth headphones wireless device provides 6 hours of talk & playing time & 150 hours of standby time. Much more than other sports headphones!",
        "Our wireless headphones pair with devices up to 8 meters away, and the Bluetooth headset has mic functionality, so you don't have to stop working out to answer calls! The running headphones are even sweatproof, so you won't have to worry about wearing them when you're giving a strenuous workout your all",
        "The volume, sound, song selection and telephone controls are all right on the wireless Bluetooth earbuds, making these the most convenient Bluetooth earbuds for running, sports, lifting weights & more! For All Bluetooth Devices Including iPhone 6, iPad, iPod & Samsung Galaxy S6"
    ],
    "description": "Fortunately, there is a way that you can sweat to the beat without any of the hassles that come with wearing ordinary sport headphones and running headphones! The Bluetooth headphones are the latest breakthrough in wireless earbuds. Capable of pairing with any Bluetooth enabled device from up to 8 meters away, these wireless Bluetooth earbuds feature Bluetooth 4.1 audio decode technology. As a result, the Bluetooth earbuds wireless signal is stronger and clearer than what's ever been possible with Bluetooth earbuds before. You'll hear the difference immediately! Unlike ordinary Bluetooth earbuds for running and workouts, it can stream music and answer calls with two devices at once! Use them as Bluetooth headphones for an iPhone 7, iPhone 7 Plus phone and an Android tablet or as Bluetooth Headset wireless earbuds for an iPod Touch and a Samsung Galaxy S6. The possibilities are truly endless. With the Bluetooth Headset, running, gym workouts and sports training will be easier and more convenient than ever before. Lightweight and sweatproof, the earbuds won't get in your way or make it hard for you to easily move. Plus, they provide up to 6 hours of talk and listening time on just one charge, so you can sweat on and on and on...",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41HAZpCzQFL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41vaguWitoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41c%2BwcflbRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41eJz7dBqIL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ftiScWs7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zGvtjdmTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WWpzzeeEL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B0142464IQ",
        "B00GJFW1F2",
        "B00XE87LAM",
        "B07C77M3HL",
        "B07GTJ5WK5",
        "B00AWIPITS",
        "B075TRLBZ6",
        "B074V5B8KG",
        "B07F2KQPPF",
        "B076BNBKCC",
        "B07FZZTXLJ",
        "B078W1WXZJ",
        "B07DZLBLXC",
        "B07GS5NM66",
        "B01MXXR3IM",
        "B01JFPQJCI",
        "B00DVEJA7G",
        "B00N2E3ZHG",
        "B013U54BFG",
        "B07122GWD5",
        "B075NRNZWD",
        "B072L44Y4M",
        "B071JXMMK6",
        "B07GB2FT4J",
        "B07FKL4VYF",
        "B07G95VDJZ",
        "B07GFGJJS8",
        "B0742BMSCV",
        "B01L160DLW",
        "B075MZLSSR",
        "B0794SCYM8"
    ],
    "rating": "3.9"
}