{
    "asin": "B01N68TDD7",
    "title": "ENKEEO Multi-Beam LED Headlamp 2200 Lux Brightness, Middle T6 Bulb, 2-Side XPE Bulbs, 4 Light Modes, USB Charging Cable, Beam up to 1000ft, Telescopic Zoom for Trail, Skiing, Biking, Climbing",
    "brand": "ENKEEO",
    "feature": [
        "HAND-FREE LED LIGHT: with high quality CREE LED lights (a middle T6 bulb and 2 side XPE bulbs), the headlight offers up to 350 lumens brightness; a built-in red light keeps you safe as alert sign, and the zoomable light spot adds more convenience",
        "LONG BATTERY LIFE: packaged with 2 rechargeable 2000 mAh lithium batteries, and lifespan reaches up to 100000 hours; comes with a USB cable and a car charger to easily power up the headlamp",
        "4 LIGHTING MODES: with 4 different light modes(middle light, side lights, 3 lights and flash lighting mode), ensures great visual quality and easily adapts to diverse situations; perfect for biking, camping, hiking, fishing, reading",
        "FULLY ADJUSTABLE: the 3 LED lights are 90° rotatable for extra comfort and convenience; the elastic headband and strap is designed to fit different head sizes easily and ensure comfortable wearing without slipping or shocking while working",
        "VERSATILE USAGE: weighs only 204g, suitable for indoor working and outdoor activities particularly at night time such as hunting, running, cycling, jogging and camping; the battery box with cushion cover is waterproof for any weather condition"
    ],
    "description": "When the Sun is gone and the Moon takes on the main role, the Enkeeo headlamp will lead your adventures. This rechargeable LED headlamp is perfect to enlighten your way while freeing your hands during your night hikes, while camping, fishing or riding your bike. It will beam up to 1000ft, and its 115°of angular vision of extent will allow you to have a super-wide view.Plan a super trail adventure throughout the night on the mountains and do not forget to take your Enkeeo LED Headlamp. It has a triple-beam with Cree High-Quality LED lights (2 side lights and a middle one) with 2 rechargeable 2000mAh lithium batteries. Weighing only 0.45lbs. (204g), it is your ideal piece of equipment to guide you through the darkest hours.This headlamp comes with a USB charging cable. The user-friendly smiling face charging indicator will let you know when it has been fully charged. Moreover, the headlamp has 4 different lighting modes (lights, lights on both sides, the 3 lights and flash light) to better adapt to the conditions and scenarios where you use it.-Battery type: 2 x 2000mAh Lithium Batteries -LEDs type: Middle T6 bulb + 2 Side XPE bulb-Bulb Luminous Flux: 350 + 2x 300 Lumens-Intensity of LED：2200 LUX 1200 (Mid) + 500 (Sides) + 500 (Sides)-Lifetime of LEDs: 100000h- Dimensions: 4.7 x 4.1 x 3.7in /12x10.5x9.5cm-Angle of Light: 115°-Color Temperature: 3700K-5300K-Range: 1000ft1 x Headlamp2 x 18650 lithium batteries1 x USB Cable1 x Car Charger1 x User Manual",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 98.75,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51UTWEWrNBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517bzxSAZtL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51JeQZReZML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41tlpug6BdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51yj-S1hK2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61IAzCoRPzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51QIiHdN1lL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "706814011",
            "title": "Outdoor Recreation"
        },
        {
            "node": "3400371",
            "title": "Camping & Hiking"
        },
        {
            "node": "3401301",
            "title": "Lights & Lanterns"
        },
        {
            "node": "3401361",
            "title": "Headlamps"
        }
    ],
    "similar": [
        "B074P1ZBZX",
        "B01H71F8AG",
        "B07DDHJ7C3",
        "B06XH1HT8V",
        "B00NIOCZIK",
        "B0744H5T4L",
        "B07DN57B1K",
        "B01M3X0IKQ",
        "B018FVPLMW",
        "B07374QD33",
        "B06ZZCT8WC",
        "B07DW646GY",
        "B07CZV8KDC",
        "B01N3QKS3X",
        "B01MSTDTE5",
        "B07G2VVYG3",
        "B01EFKUXO8",
        "B078JZQD7R",
        "B01M5CZ44X",
        "B072MBF9F5",
        "B01MXJ8PLN",
        "B07CVJYT2F",
        "B071FZG845",
        "B077R1VHVQ",
        "B01AHLMQHQ",
        "B01GD463NE",
        "B06XGR2KGN",
        "B01N0XF1LD",
        "B072JBJ2SW",
        "B07DCNS9YX"
    ],
    "rating": "4.1"
}