{
    "asin": "B06WGQLRZL",
    "title": "Telephoto Mobile Phone Camera Lens, Portable Universal 8X-12X Zoom Manual Focus Cellphone Camera Lens Clip-on Telephoto Lens for iPhone 7, iPhone 6S, HTC (Black)",
    "brand": "Qable Powerz(TM)",
    "feature": [
        "ULTIMATE TOOL FOR MOBILE PHOTOGRAPHY - Package includes 100% Brand New, Industrial Grade, Professional Universal Clip-on Smartphone Camera Lens Portable Telephoto Lens with 8X-12X Zoom Magnification suitable for smartphones with single rear camera.",
        "COMPATIBLE DEVICES - This portable, clip-on telephoto lens is universally compatible with most smartphones including iPhone 7, iPhone 6S, 6S Plus, iPhone 6, 6 Plus, iPhone 5S, SE, HTC, Sony, LG G4, G5, Google Pixel XL, OnePlus 3, and many others.",
        "PREMIUM GRADE FRAME AND SUPERB OPTICAL LENS - Engineered with superior quality materials to guarantee long-lasting durability and optimum functionality, our smartphone telephoto camera lens is equipped with heavy duty body and premium coated optical lens to help you experience high quality mobile photography.",
        "HIGH QUALITY PHOTOGRAPHY WITHOUT THE LEG WORK - Features 12X zoom lens that delivers superior quality pictures from a distance without you having to get too close to your subject. This augments your camera phone's zoom feature enabling you to capture shots from a distance without distortion.",
        "REMOVABLE TELEPHOTO MONOCULAR LENS - Never miss any remarkable and unforgettable scene. This removable clip-on camera lens can also be used as a standalone monocular telescopic lens with a focusing distance of about 3M to help you view distant objects, sceneries, games and concerts more clearly."
    ],
    "description": "Transform your mobile phone into an instant Telephoto Camera Lens hassle-free with this Premier 8X-12X telephoto lens. Our telephoto lens will help overcome the limitation of smartphones that can only take near-sighted photos or low quality zoomed images. It's like taking superior quality photos like a pro! It attaches to almost all smartphones using its removable clip without leaving ugly marks or scratches on the device. Remove this camera lens from your smartphone and have yourself an instant monocular with a focusing distance of about 3M. This is perfect to take with you for your travels, bird watching, watching wildlife or scenery, watching games of F1, football and basketball and so on. Just attach the telephoto lens to your phone using the detachable clip if you want to take photos again. So, the next time you explore the outdoors make sure to bring this handy, lightweight camera lens with you and capture every moment for that timeless memory.",
    "price": 899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51lArWb1pvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41O9in2pZ2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-DD1Jd--L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41yYaVU7gjL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41iHhRahltL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/619krLZ%2BtZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/4150QqrJ78L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "172435",
            "title": "Accessories"
        },
        {
            "node": "525898",
            "title": "Lens Accessories"
        },
        {
            "node": "3347581",
            "title": "Lens Supports"
        }
    ],
    "similar": [
        "B074KP83YB",
        "B079PMS1PW",
        "B07C76P1BD",
        "B075YDYB46",
        "B01KUQ61H4",
        "B07FGFNQ33",
        "B01LYH6FR1",
        "B01BESQYJW",
        "B01IDQEQ34",
        "B07541YBXC",
        "B0757DYMQN",
        "B07C6RYK4F",
        "B0797P22HY",
        "B07888CSJX",
        "B07F9SQMQW",
        "B078RDGQC6",
        "B07BW682KB",
        "B072MZ42GW",
        "B01N1INMPI",
        "B073CRN1QM",
        "B01N90GSD6",
        "B071LHLS11",
        "B0797TL48W",
        "B07B4TN3LL",
        "B079J6ZZ51"
    ],
    "rating": "2.4"
}