{
    "asin": "B06WRXHRGB",
    "title": "Portable Projector, ELEGIANT Portable Mini Home Theater LED Video Projector 1080P 1500 Lumens 800x480 Resolution for TV Laptop SD Android TV Box Support USB SD AV VGA TV Interface",
    "brand": "ELEGIANT",
    "feature": [
        "★【 Portable Design】8.1*5.9*3.5 ( L*W*H) Inches, Portable design, Small Size, suitable for travel, camping, and outdoor party. Enjoy happy movie or football match after family dinner or BBQ Party at home or courtyard. Easy to share sweet pictures with your family and friends.",
        "★【Crystal Clear Image】Super Color Technology delivers superior,1500 lumens LED brightness and 800 x 480p native resolution (support 1080p and 720p), can provide crystal clear image in the dark environment! Projection Distance is 1~5m, and Projection Size is 50~150 inches.",
        "★【Multimedia Interfaces】Multiple alternative interfaces like AV\\VGA\\USB\\SD\\TV \\High Definition Multimedia Interface slots which make it possible to connect desktop, notebook, tablet, DVD, WII, XBOX game machine, TV box, hard disk, MP5, digital camera to this projector.",
        "★【Completely sealed designed】 High-efficiency ventilation design, largely upgraded the stability and lifetime, LED lamp, works for over 50000 hours, with vivid color and abundant details; Optical keystone correction function, which can adjust keystone distortion of images.",
        "★【System Support】 Multi-media (Music, Picture, Video, TXT); Enjoying watching movie at home and outside for camping. Not recommended for PPT or business presentation, ideal for home theater movies and video game use."
    ],
    "description": "Model: VS314 Technology: 4 \"LCD x 1 LED light source + LCD display technology Resolution: 800 * 480 Maximum resolution is compatible with: 1920 * 1080P Lens: 5 coated glass lens fixed focus lens Image size (diagonal): 30 \"to 180\" (moving away from the projector to produce image size) Projection distance: 1M ~ 5M Lamp life: 50000 Hours Speaker: 8 ohms 2W x2, stereo speakers Noise at Work (db): ≤15dB Volume (length x width x height): 205 * 150 * 90MM Power requirements: 100 - 240 V, AC 50/60 Hz Support JPEC, GIF, PNG, TIF and other formats of still pictures display; Support Fly, board, division, wipe, blinds and random lines and other slide transition effects; Support picture zoom, 360 degree rotation operation mode, full-screen views. \" AVIN video input: support for PAL, NTSC format Text reading: \"Support TXT text document reader, supports automatic and manual page turning read 1. SD pixel resolution to achieve true 800 * 480; 2. Contrast and brightness are also close to the index standard household projector. In the home entertainment category is as easy to get fully competent in HD 3. The appearance is a strong sense of science and technology as part of the appreciation of science and technology to enhance the user between cis grade; 4. using imported lens and optical glass to maximize the use of LED light source, the power can replace 60W traditional craft 100W light source. Fit energy saving concept of social welfare; 5. The device can be connected to interfaces readily available, wireless, mobile phone screen with the most up to you to control the play; 1x AV video cable 1x power adapter 1x Accessories Remote Control 1x Manuals & Instructions 1x Lens cover",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 290.0,
        "length": 10.0,
        "width": 10.0,
        "height": 10.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41mbuvvD0rL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qZR8H9CqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41G9pDDyj2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xxXFsRvBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2BwRs-xs3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nS0GBhHUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51lvadHQyRL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "300334",
            "title": "Video Projectors"
        }
    ],
    "similar": [
        "B07688Z4NT",
        "B00005213S",
        "B079FVBH7L",
        "B07BT6QB7R",
        "B00005213Y",
        "B06ZYL1ZQG",
        "B000KNHRG2",
        "B01M9C27FQ",
        "B01JR7G672",
        "B07D8CMNS9",
        "B010PR28WK",
        "B01BMM48CK",
        "B075WNMV3R",
        "B075GM3847",
        "B07174LM85",
        "B0743DRFTT",
        "B072X814YC",
        "B0742CPG7Q",
        "B01N8RBGPH",
        "B01K1RZRDG",
        "B007VTPATO",
        "B01HRFBOWI",
        "B07FNCLJC4",
        "B01BLXLR38",
        "B0727W3SBT",
        "B078KF8CSX"
    ],
    "rating": "3.6"
}