{
    "asin": "B06XKSNWKX",
    "title": "IEKA Plug-in LED Night Light,Smart Sensor Automatic Dusk to Dawn Light Warm White Glow Soft Brightness Perfect for Bedroom, Nursery and Baby's Room (6 Packs)",
    "brand": "IEKA",
    "feature": [
        "◆Soft Brightness: Not too bright, Not too dim. Just the right amount of light to see where you are going in the dark. Allow you to get up at night, get some water, use the restroom and return to bed without turning on any main lights",
        "◆Safe and Offset Plug Prong - With standard plug, no need batteries, no heat from the night light, stays cool to the touch, safe for use in kids room. Small and cute design: smaller than the palm, will not block other outlets",
        "◆Smart Auto On/Off: Built-in sensitive light sensor, the nightlight automatically turns on at dusk and off at dawn. You don't have to worry about turning them on and off around the house in the morning and evening",
        "◆Soft Brightness: Not too bright, Not too dim. Just the right amount of light to see where you are going in the dark. Allow you to get up at night, get some water, use the restroom and return to bed without turning on any main lights",
        "◆Safe and Offset Plug Prong - With standard plug, no need batteries, no heat from the night light, stays cool to the touch, safe for use in kids room. Small and cute design: smaller than the palm, will not block other outlets",
        "◆Smart Auto On/Off: Built-in sensitive light sensor, the nightlight automatically turns on at dusk and off at dawn. You don't have to worry about turning them on and off around the house in the morning and evening",
        "◆Offset Plugs: Compact size plus offset plugs, the nightlight doesn’t block the second outlet on the wall, so you don’t have to unplug the nightlight if you want to plug in something else above or below it",
        "◆Wide Applications: Packages including 6pcs night light, perfect for anywhere you need extra soft glow at night, such as kids room, bedroom, bathroom, kitchen, basement, hallway, entryway, laundry room, stairwell"
    ],
    "description": "Choose Night Light Reasons: For many families ,this cute night light is your best choice. It is important for children to have enough sleep.and they will never fear the darkness, the product can aiso ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B071D8XV7Y",
        "B00HFMHPEU",
        "B01DLLTDLG",
        "B01CF85JFK",
        "B01N47M3V0"
    ],
    "rating": null
}