{
    "asin": "B06XFZBTKZ",
    "title": "LOTOPOP Waterproof Floating Hand Grip for Gopro Hero 5 3+ 4 Session 3 - Handle Mount Accessories and Water Sport Pole for GeekPro 3.0 and ASX Action Pro Cameras Action Camera Accessories-White",
    "brand": "lotopop",
    "feature": [
        "1. It is made of high quality PC,and constitute ABS, with screws and hand strap. It is fully compatible with GoPro HD Silver and Black Hero 1, Hero 2, Hero 3, Hero 3+, Hero 4, Hero 4s Session edition,hero 5 and xiaoyi GeekPro 3.0 and ASX Action Pro Cameras",
        "2. Floating grip，Keep your GoPro afloat in the water, Keep your GoPro afloat in the water: Whether you take your camera into the ocean or pool intentionally, or it falls in by accident, the floating hand grip will keep your action cam floating on the surface.",
        "3.Textured handle for extra grip: The covering will make it easier to keep hold of your bobber, especially when used in wet conditions. The high quality non-slip handle delivers tight grip and extra comfort. The grip will not get sticky from sun exposure like rubber grips.",
        "4. Removable butt cover to access to extra storage compartment, The watertight compartment of the floaty grip can be used either as a storage for your valuable small items to keep dray",
        "5. PORTABLE and LIGHTWEIGHT: The hand grip is 7 inches tall (diameter:1.4 cinches)and only weighs under 88 grams and can be used both on land and in the water. The mount tilts 180 degree providing increased shooting possibilities."
    ],
    "description": "Description: The multi-purpose camera handlegrip with added features. Whether you are deep sea diving, snorkelling, scuba diving, swimming, surfing or engaging in other water sports activities, LOTOPOP is the best choice of floating hand grip for you. Aside from great control when filming and keeping your camera afloat if you drop it into water, you can now fill the handle with water to create neutral buoyancy when scuba-diving. If you are not underwater you might even want to use the watertight compartment to keep a little something hidden and dry. Specification: Brand LOTOPOP Quantity :1Piece Color Black + WhiteMaterial PC +SiliconMax.Load 1000g Band Length 20cm Size: 18 cm x 3.5 cm x 3.5 cm Package: 17x7x7cm Net Weight (88 g) Shipping Weight (160 g) Package include: 1 x Floating grip 1 x Long screw 1 x wrist strap",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": 300.0,
        "width": 300.0,
        "height": 700.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41BfUCLDViL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/414CYJIGXUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41niMKhIgbL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51461fO4D2L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "499306",
            "title": "Tripods & Monopods"
        },
        {
            "node": "499314",
            "title": "Monopods"
        }
    ],
    "similar": [
        "B01M6CMB1U",
        "B07GYQDV19",
        "B01LWKCIQN",
        "B07FLZQ7X8",
        "B074BRFDHZ",
        "B01IBUWML0",
        "B0796T44QV",
        "B07BBFZF7R",
        "B0755PDKCN",
        "B01MYW6B7E",
        "B01171X0UW",
        "B01H0IJ1WC",
        "B07CHNKWWP",
        "B07FF3NYKP",
        "B01MZ841R3",
        "B01HU3Q6S4",
        "B01M635128",
        "B07FFV513V",
        "B01M2D4L6K",
        "B014BME3Z0",
        "B01M4I7RKG",
        "B06XWMMPGV",
        "B0796SXMP2",
        "B07CWS619X",
        "B01DKOFZVQ",
        "B01M14ATO0",
        "B01N311C7B",
        "B01MFGCP4R",
        "B00Y3SBXH4"
    ],
    "rating": "4.4"
}