{
    "asin": "B06XRZC67R",
    "title": "Occlusion Training Bands by BFR Bands, RIGID EDITION, Blood Flow Restriction Bands Give Lean & Fast Muscle Growth without Lifting Heavy Weights - Strong Adjustable Strap + Comfort Liner (Arms)",
    "brand": "BFR BANDS",
    "feature": [
        "EXTRA WIDE BANDS: Our RIGID EDITION BFR Bands are 2 inches wide and designed to offer superb restriction of blood flow through the working limb to the targeted muscles. These Blood Flow Restriction (BFR) bands reduce oxygen supply to the muscles in order to pre-fatigue slow twitch muscle fibers and diminish their response to workout loads, but to enable fast twitch muscle fibers to respond quickly to exercise training loads, resulting in faster lean muscle growth.",
        "INCREASED FACTORS FOR MUSCLE GROWTH: Studies show BFR training can increase muscle protein synthesis, NOS-1 expression and mTOR signaling, resulting in increased muscle growth. The studies also show BFR training can boost muscle growth and enhance potential for muscle gain by reducing Myostatin concentrations.",
        "EXTRA-STRONG AND SUPER-COMFORTABLE BFR BANDS: Made of extra strong hook and loop fastener material combined with a tightly woven metal slider and added comfort liner, the RIGID EDITION BFR training bands are easy to strap up, effortless to release as soon as the exercise is completed, and exceptionally comfortable on the working limb. Each BFR Bands’ order comes with 2 bands to allow you to exercise both legs or both arms at the same time.",
        "The Arms version is 2 inches wide x 18 inches long. Comes with a free BFR ebook."
    ],
    "description": "These bands are easy to strap up, quick to release as soon as the exercise is completed, and exceptionally comfortable on the working limb. They are applied to working limbs and paired with loads of 10-30% of a 1RM in order to achieve lean muscle and great tone quickly without heavy weight-lifting. If you are looking for the best Occlusion Training Bands ®, buy BFR Bands RIGID EDITION. Click \"Add to Cart\" now!",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 26.25,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51VQe6A24lL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kY63sFh6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/417y2b4OdSL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2BTw1ZSWQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513Cjpna0fL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51KBV0lPMkL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "10971181011",
            "title": "Sports & Fitness"
        },
        {
            "node": "3407731",
            "title": "Exercise & Fitness"
        },
        {
            "node": "3407891",
            "title": "Accessories"
        },
        {
            "node": "3407931",
            "title": "Exercise Bands"
        }
    ],
    "similar": [
        "B07CQ6LZ8G",
        "B074RLNQCF",
        "B00ZHJ8DYE",
        "B07CQXDSQ5",
        "B01H5SZXSI",
        "B078JNPPMT",
        "B01C2BAE5A",
        "B076FRP517",
        "B01N2NKZSA",
        "B01FO0K5AK",
        "B07F7YT4JZ",
        "B07FSW6ZH6",
        "B0777QRRHH",
        "B01FL4ILWS",
        "B07CXQMV2G",
        "B07C5Z62JF",
        "B06XS3JWKS",
        "B074PBQLBR",
        "B01FIKCTR8",
        "B01G97Q7LS",
        "B076FRG3G1",
        "B01C2BAE82",
        "B07CHGZGVP"
    ],
    "rating": "4.4"
}