{
    "asin": "B06XBGR2L9",
    "title": "Dowellife Cut Resistant Gloves Food Grade Level 5 Protection, Safety Kitchen Cuts Gloves for Oyster Shucking, Fish Fillet Processing, Mandolin Slicing, Meat Cutting and Wood Carving, 1 Pair (Large)",
    "brand": "Dowellife",
    "feature": [
        "Protect your hand from cuts and abrasions---The high performance cut resistant material HDPE is adopted and the gloves is awarded with the highest EN388 level 5 cut resistance certification. 10 times stronger than normal gloves.",
        "Excellent comfort and dexterity to wear and grip--- flexible operation, Not too hard, No sliding. The special high elastic nylon is blended to make the gloves fit your hand so well.",
        "Easy to sanitize and keep clean--- it is hand and machine washable and can be sanitized as kitchen dishwashing towel.",
        "More convenient to hang dry and replace--- One intimate designed hang ring is fixed on each gloves wrist.",
        "Now click the \"Add To Cart\" button to order to avoid 99% hand accidental injury for your family at kitchen cuts, oyster shucking, meat cutting, butter mandolin, vegetables slicing, fruits peeling, wood carving, carpentry and garden working. Please only purchase the Dowellife cut resistant gloves from Dowellife. We DO NOT authorize any other seller to sell our product in Amazon. The imitated \"Dowellife cut resistant gloves\" sold by other sellers are cheap,but disqualified."
    ],
    "description": "Your Dowellife cut resistant gloves could help you to handle grater, knives, and mandoline with high protection and good dexterity, without worrying about hands injury.Made of food safe and highest cut resistant level material, the gloves are designed to provide EN388 level 5 cut protection for your hands from blades cutting.Multipurpose safety gloves in and out of kitchen, Dowellife cut resistant gloves are the best choice as oyster shucking gloves, meat cutting gloves and wood carving gloves.The cut resistant gloves offer you firm grip on slippery and awkward items due to good elastic material and lightweight design.You could grasp firmly not only the food and wood, but the mandoline slicer, oyster knife, wood carving knife.You’ll be able to complete kitchen working and wood working more quickly, accurately and safely.Compared with the chainmail gloves, the Dowellife gloves are designed for excellent comfort with ultra-thin, soft and highly elastic.Weighing less than 2 ounces, perfect balance between protection and dexterity for kitchen and wood working. (1) 1*pair gloves (2) 1*pcs safety notice and manual.",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 800.0,
        "width": 500.0,
        "height": 50.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61fFyp%2BX1CL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61ORZZp9arL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Glirk4T7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/613ivmMw1RL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Czt2MNHnL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61HbOhhKbeL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ahjfoBRpL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "228013",
            "title": "Tools & Home Improvement"
        },
        {
            "node": "3180231",
            "title": "Safety & Security"
        },
        {
            "node": "486555011",
            "title": "Personal Protective Equipment"
        },
        {
            "node": "4954450011",
            "title": "Hand & Arm Protection"
        },
        {
            "node": "318139011",
            "title": "Lab, Safety & Work Gloves"
        },
        {
            "node": "7491822011",
            "title": "Impact Reducing Gloves"
        }
    ],
    "similar": [
        "B074QFP9CQ",
        "B07BKQVQV5",
        "B078SQ5MRJ",
        "B06XH4N928",
        "B0795K2SXL",
        "B07DWX7FJ5",
        "B004NG98L4",
        "B002UOTMSU",
        "B00MXUHHGK",
        "B01KFOU2OE",
        "B07CTFG54F",
        "B0756JCLYS",
        "B00ZYC2J4O",
        "B0788NPGVZ",
        "B077H6RZ9Z",
        "B01DUZZP9W",
        "B071YDZ84S",
        "B076Z3B4YC",
        "B01874DY58",
        "B01MSYOWEY",
        "B074QK7946",
        "B00N0UA4CQ",
        "B0791WT82F",
        "1565238672",
        "B078T69DB5",
        "B00VQFE1MQ",
        "B06XBSZ1TY",
        "B075JGHP9C",
        "B06XC11FL8",
        "B00004OCLC",
        "B07BDQ67CW",
        "B00GU1RD2G",
        "B074QH1ZC9"
    ],
    "rating": "4.3"
}