{
    "asin": "B06X9RP7S3",
    "title": "Power Bank Sunydeal 26800mah Portable Battery Charger External Powerbank with 3 USB Port for iPhone iPad Samsung Galaxy LG BlackBerry Sony Xperia Nexus Other Android Cell Phone Tablet- Black",
    "brand": "Sunydeal",
    "feature": [
        "Ultra High Capacity 26800mAh 3-usb Port Portable Charger for Phones: Charge your iPhone 7 about 8 times, iPhone 7 plus over 5 times, iPhone 6 up to 9 times, iPhone 6S over 5 times, Galaxy S7/ S8 up to 5 times, or an iPad Mini more than 3 times with Sunydeal Portable External Battery. Equipped with 3 Smart Identify USB Output Ports, It Can Charge Three Digital Devices (2 Cell phones and 1 Ipad Tablet) At The Highest Speed Simultaneously.",
        "2A Twice as Rapid Charging: DC 5V/2A Input is Twice as Fast as Normal DC 5V/1A Input Power Banks to Save 50% of your Recharge time. Use a DC 5V/2A or above Charger to Achieve Full Charging Speed. DC 5V/2A adapter is Not Included.",
        "Intuitive Battery Level Indicators and LED Flashlight: 4 Integrated LED Indicators Show the Available Power Capacity and Power status. Each light will turn on as it reaches that power level until all 4 become solid indicating the power bank is fully charged. Built-in LED Flashlight, will be a Good Helper when You Need an Emergent Light on Camping, Hiking and any Emergency Occasions.",
        "Safety Protection: Built-in Multiple Protections, Short-circuit Protection, Input Overvoltage Protection, Output Over-Current Protection, Output Overvoltage Protection, Overcharge Protection, which Protects Your Devices against Excessive current, Overheating, and Overcharging.",
        "The Standard USB Ports Are Universal Fits Most Digital Devices,Universal Application: Fits For Apple iPhone, iPad, iPod, Samsung Galaxy, HTC, LG, Google Nexus, Moto, Sony, Nokia Lumia, Blackberry, BLU, Asus Zenfone, Padfone, Smartphone, Tablet, Digital Cameras, Game Consoles And MP3/MP4 Players, and more."
    ],
    "description": "This power bank upgrade to 3 USB ports, 1A for iPhone, 2.1A for Samsung Galaxy Android cellphone, 2.1A for iPad. You can charge multiple electronic devices you have with just one power bank. 16.5cm*8cm*2.2cm, slim compact size, just makes it easy to carry and convenient to use. Put it in your bag and go for a long travel, you would never miss the nice moment or beautiful scenery when your phone was nearly out of power. Blue LED light indicator shows you the charging status and the battery level. No need to worry the external battery may not be full charged. LED flashlight provide emergency lighting. Double press the on-off button, you will see the flashlight on. No longer be afraid when you are walking alone on the dark street. High Capacity: 26800mAh Input: 5V / 2A Output: 5V-1A / 2.1A Conversion Rate: 85% 1 x Sunnydeal Backup Power Bank Box 1 x USB Charging Cable 1 x User Manual 1.Use the usb charging cable included in the parcel to charge the external battery. 2.Check the led indicator to know the charging status. The light is flashing when it is on charge and the power bank has been fully charged when 4 blue lights on and stopped flashing. 3.Choose the right usb port, connect it to charge your phone. It is recommended to use the original usb cable of your device. Get Our Best Battery, Share the Power, Share the Fun!",
    "price": 2699.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 110.00000000000001,
        "length": 690.0,
        "width": 180.0,
        "height": 480.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/3161U42ei%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31eLkLwbv%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31EtQYDX8gL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31UGpBeopCL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Shrps75iL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/413kQiE6QiL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/411KhX5XCbL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407758011",
            "title": "Batteries & Battery Packs"
        },
        {
            "node": "7073960011",
            "title": "Portable Power Banks"
        }
    ],
    "similar": [
        "B00X5RV14Y",
        "B07G755P1F",
        "B00AANMVNQ",
        "B07BWBMZDL",
        "B06XX124TW",
        "B06X9XSNMZ",
        "B077XSMKFF",
        "B01KX3854Q",
        "B07843C26M",
        "B07GGRWC1K",
        "B075RKH47V",
        "B0787S4FFL",
        "B01NBQX51D",
        "B019XI0Q8K",
        "B07CN1YZ2M",
        "B07CK6H14Q",
        "B06ZXW6NRG",
        "B073P81Z9V",
        "B0722NZK26",
        "B01G1XH46M",
        "B00OUCO5JG",
        "B01MXCMGB8",
        "B07GDY2Z4D",
        "B01D2SWJHS",
        "B07F59FVMR",
        "B01M99N6QQ",
        "B07BMS9GPX",
        "B07BF8KC83"
    ],
    "rating": "3.2"
}