{
    "asin": "B06Y6NJ3J1",
    "title": "Galaxy S8 Plus Case,LOHASIC Clear Hybrid Hard Back and Slim Thin Excellent Grip Flexible Soft Silicone Gel Bumper Shockproof Full Body Protection Cover for Galaxy S8 Plus - Black Edge",
    "brand": "LOHASIC",
    "feature": [
        "Flexible Armor: Slim fit, lightweight shock absorption protective armor case",
        "Premium Material: Anti-slip, anti-scratch cover with excellent grip. Ultra-Transparent body reveals and enhances the original color and design of the New Samsung Galaxy S8 Plus",
        "Dual layer drop protection: Shockproof TPU border + Hybrid hard tough crystal PC frame with corner cushion design.360 degree full body drop shock absorb protection:raised bezel keeps the camera from touching the ground and protect your front LCD screen when Galaxy S8 Plus Phone drop. The smooth case reinforces the original form and shape with ultra-clear, long-lasting drop and scratch resistant protection",
        "Features: Responsive button covers, exact cutouts and raised camera & screen bezels",
        "Accessories compatible with Samsung Galaxy S8 Plus (2017)"
    ],
    "description": "-Material:German import 4H scratch-resistant, Durable clear tpu protects your phone against drops and scratches-Multi-functional - Perfect for on-the-go use 1)Shockproof 2)Scratch-resistant 3)Personality that shows, and a magnetic lock design-Convenient to Use - Precise cutouts for speakers, camera and other functional ports allow you easy access to all ports and functions, without removing the case-Providing a 360-degree strong protection with elegant appearance. Full Body Shockproof, especially the webcam in phone, your phone will not be scratched, soiled or broken by accident.-Compatible with Samsung Galaxy S8 Plus (2017)-Industry-Leading 360 Degree Protection Technology-Fast ReplyWe back our cases with a lifetime warranty. That means, no matter how long you've used it, we'll offer you a quick, no-hassle replacement or refund if:-It doesn't fully protect your device-It breaks during normal useOur Lifetime Warranty does not cover natural wear and tear or damage caused by the user",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 13.0,
        "length": 790.0,
        "width": 390.0,
        "height": 70.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41SNRdHNoyL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VMpzWGTnL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51is4pZORGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51k2qZVZa1L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BoH-nPfwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YvFls7KbL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ih2utuU%2BL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B07H2F2LNG",
        "B06XP6KZKC",
        "B0777L3TVQ",
        "B06XNW4ZVJ",
        "B06XFQNZ8N",
        "B06XGYDWFN",
        "B06XXP8QDZ",
        "B06XP4WS9Y",
        "B06Y6NFQPN",
        "B074QDSW2B",
        "B07GKK1M2S",
        "B07GNDMCPS",
        "B07B9QBZJV",
        "B06Y65BJDS",
        "B072BHDKNX",
        "B072F34SPB",
        "B074QN6ZWQ",
        "B071Z8MDPS",
        "B07DDKQ232",
        "B00LGWTM5U",
        "B07569PJ6Z",
        "B07GX71RKL",
        "B073WZ4FCN",
        "B0748BKTC9",
        "B07796Q91N",
        "B073GT454S"
    ],
    "rating": "4.3"
}