{
    "asin": "B06Y4SVBTG",
    "title": "Abstract Art Cool Guitar Picks - Wassily Kandinsky Paintings. 12 Medium Gauge Celluloid Guitar Picks In a Box W/Picks Holder. Unique Guitar Gift For Bass, Electric & Acoustic Guitars",
    "brand": "Art Tribute",
    "feature": [
        "✅ For Men Women Teens Guitarist - This Luxury Pack Comes With 12 Cool Picks with a Premium Bonus - Key Chain Leather Pick Holder. The complete set feels like having an Art Museum in the palm of your hand!",
        "✅ AVOID EVER LOSING PICKS AGAIN With a Specially Designed Metal Click Clack Box Which Fits Into Your Pocket & Guitar Case - Push down the middle to open, Squeeze the sides to close.",
        "✅ MEDIUM GAUGE (0.71mm) Thickness Celluloid Themed Plectrum - High Quality Printing Provides Natural Feel and a Warm Sound. The image isn't going to come off due to use.Starry Night, Sunflowers and Bedroom in Arles Use For Electric,Classic, Bass and Acoustic Guitars As Well As Ukulele.",
        "✅ BEST GIFT FOR HIM- the simple way to say \"I Love you\" for Kids Teens Girls Boys Mens Womens Guitarist and Musicians. Great Present For Birthday, Christmas,Stocking Stuffer, New Year , Father's Day,Valentine's day gift for guitarist & Holidays!",
        "✅ 90 DAY RISK FREE Purchase - Guaranteed 100% Satisfaction."
    ],
    "description": "Abstract Art Guitar Picks - Wassily Kandinsky Paintings. 12 Medium Celluloid Guitar Picks In a Box W/ Picks Holder. Fantastic Original Gift for Guitarist. Guitar Picks That Will Upgrade Your Musical Performance And Appearance As An Artist! Get this amazing set, update your guitar picks collection and be sure that you will never lose them again! It is not just about the 12 picks of memorable paintings. It is also about the luxury pack that comes with the picks! The user friendly click clack box fits into your pocket and your guitar case. A leather key chain pick holder is also offered! Make sure that you won't need to buy more picks anytime soon! Be Unique As An Artist And Do Not Miss This Limited Edition Set! Get your daily inspiration only by looking at the paintings of your picks! Imagine how these unforgettable painters left their mark in the global art legacy. Get the motivation you need to become awesome! It is said that “Art does not have an expiration date”. Be as passionate as these artists and make your music stand out! Art Tribute takes away all your worries. We offer the best deals on the market. What are you waiting for? Enjoy playing and creating music like never before with a source of endless inspiration right at your fingertips! Don't Miss This Opportunity! – While Supplies Still Last!",
    "price": 1395.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 400.0,
        "width": 400.0,
        "height": 100.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/61WbLq9GyUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RjmL3py0L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mjcokvoBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VvPNQl9KL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41bi-YFCs3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51lmakiP2sL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61T4ScJX0VL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "11091801",
            "title": "Musical Instruments"
        },
        {
            "node": "11965871",
            "title": "Instrument Accessories"
        },
        {
            "node": "11967641",
            "title": "Guitar & Bass Accessories"
        },
        {
            "node": "486415011",
            "title": "Picks & Pick Holders"
        },
        {
            "node": "11968681",
            "title": "Picks"
        }
    ],
    "similar": [
        "B01H1QCLFW",
        "B0773RFKD6",
        "B014P5BHSY",
        "B06XG9WY6Y",
        "B00JA4T7QK",
        "B01AUOUI9I",
        "B01JBY4JDY",
        "B0728B2W58",
        "B06XGVC13Y",
        "B075MCPBGT",
        "B0198GZS26",
        "B07BJ2LYXW",
        "B07G9Z3QZK",
        "B01H1R14IG",
        "B0006NDF8A",
        "B00US77MXI",
        "B0753K49ZL",
        "B07C91XVTZ",
        "B01H1Q2TDG",
        "B01D21K4F4",
        "B07C41RPLC",
        "B01HFRDEI0",
        "B01H1Q9D76",
        "B0756NRJ4V",
        "B01J14J7CC",
        "B01MV7JXNT",
        "B0187288ME",
        "B07F75YNGD",
        "B01N4IW5S6",
        "B07G4C6RMB",
        "B00C7AFDVM",
        "B00DSSOVJW",
        "B01N7V9TPE",
        "B01A48JQ6Q",
        "B0195PBGYO",
        "B077VRH8H2"
    ],
    "rating": "4.8"
}