{
    "asin": "B06Y43MG2W",
    "title": "[2 Pack]Wellead Huawei Mate 9 Screen Protector,[Japan Asahi Glass(AGC)]Tempered Glass Bubble Free for Huawei Mate 9",
    "brand": "wellead",
    "feature": [
        "Exact fit for huawei mate 9, our Huawei mate 9 screen protector doesn't cover the full screen because of the curved edge of Huawei mate 9",
        "Strong silicon adhesive features easy installation and firm attachment while not affecting the sensitivity of the screen",
        "Bubble free: Bubble-free auto adhesives for easy installation and no residue when removed",
        "Surface hardness : 9H hardness body with hard coating treatment on the surface prevents scratches, wearing, chipping and cracking",
        "What you get:Wellead screen protector, transprent case, alcohol prep pad, dust-absorber, dry cleaner and our friendly service."
    ],
    "description": "Wellead Huawei mate 9 screen protector doesn’t cover the full screen because of the curved edge of Huawei mate 9,it will have white edge and bubble on the edge if cover the full screen.So please notice that we screen protector can not cover the entire screen when you purchase.On the other hand,we screen protector will be perfect for your Huawei mate 9. 9H hardness body with hard coating treatment on the surface prevents scratches, wearing, chipping and cracking, way more durable than normal screen protectors. Wellead Defense is designed to work flawlessly with the enhanced optics of your device’s screen. Its 100% clarity rating means screen protection that’s so clear, you won’t even know it’s there. So enjoy crisp, clear images in vibrant ultra HD clarity like they were meant to be seen. Applying screen protection shouldn’t take an advanced degree, so we’ve made the process worry free. The application process is smooth, seamless, and accurate – every time. Unlike any other screen protector out there, Wellead glass is treated with a specially engineeredoleophobic nano-coating to ensure that fingerprints and residue wipe off with ease. This coating is applied using a unique electric infusion process, and will not degrade for up to two years of everyday use. We will work with you resolve any problems you may have. If we cannot fix the problem or you are still unhappy with the product or its performance, you can return your Wellead products fora complete refund after purchase. 2x screen protector 2x alcohol prep pad 2x dust-absorber 2x dry cleaner 1x Free Phone Case",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 680.0,
        "width": 409.99999999999994,
        "height": 80.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/514myk079YL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FgRCQzrQL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/514QPWa0mOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VfkkAtPoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gnlEeOpoL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/515z7XQlbQL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51e2mjx0dZL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "With Transprent Case"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        }
    ],
    "similar": [
        "B01MYRABC3",
        "B075P294S6",
        "B01N6BCXDJ",
        "B01NAE4QBS",
        "B01C75LJFK",
        "B077198RPR",
        "B01MXT7SMK",
        "B07CBP8XB5",
        "B079B89N4R",
        "B01N1JV80Z",
        "B014EB532U",
        "B07FCS8BV8",
        "B073SQ7C3P",
        "B0122VRASE",
        "B01N959RVT",
        "B01N0DTMAV",
        "B075WPK4ZF",
        "B077BVXNNK",
        "B074G1W2RC",
        "B07BMSMFC8",
        "B01054S5FM",
        "B074SJCG41",
        "B01NBKBCS0"
    ],
    "rating": "3.2"
}