{
    "asin": "B06ZZN7383",
    "title": "Malicosmile Crochet White Dream Catchers for Bedroom Wall Decor, Handmade Dreamcatcher for Dreams Teenage Girl Room Decorations",
    "brand": "Malicosmile",
    "feature": [
        "♥ The dream catcher has a beautiful symbol. Pray for peace and good luck with you. Drive out nightmare, let you sleep with sweet dreams",
        "♥ The dream catchers are perfect to hang in your living room, house, windows, bedroom to decorate or avoiding evils",
        "♥ The dream catcher represents blessing in original, warm and mysterious ways. An ideal gift for you, family, kids, friends, or someone undergoing nightmare and sufferings, etc",
        "♥ The unique white crochet dream catcher is pure handmade. It looks very delicate, the feather beautifully flutter when hanging it on. It be sure to bring you cheerful mood",
        "♥ A full money will refund to you without hesitation if you are not satisfied with the products"
    ],
    "description": "*Material: High quality flocking cloth + Polyester thread + ABS bead + Feather; *Size: Measures about 25.5’’( 65-70cm ) in length; *Color: Pure White; ♥ The white crochet feather dream catcher is pure handmade. Each process is woven by a worker who has had many years of weaving experience, and only skilled workers can weave such a uniform, perfect and rhythmic grid; ♥ The ABS bead is polished and treated with the color preserving paint.The color of the pendant is bright and shiny, and the sleek and glossy design makes the white dream catcher unique; ♥ The white feathers are fumigated and then carefully screened to ensure that each feather is flawless and trimmed by the master; ♥ Because of its beautiful design and symbol, both adults and children will enjoy with it; ♥ The dream catcher feather mobile waves beautifully and quietly in the air, it will not disturb you and it will pray for peace and good luck with you. ♥ It is perfect to hang above your bed, in the window, hang to decorate your house anywhere or hang in your car; ♥ It is also a great gift idea for your friends or families with best wishes to them. Our dream catchers are pure handmade, so it is very normal if there is a little difference between each one. If there is any question, please feel free to contact me, I will reply you within 24 hours and do my best to satisfy you",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 19.0,
        "length": 800.0,
        "width": 800.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Z5gY%2BdhNL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51csxgvz4TL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/617qxfcV00L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61m30vcgvwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5143uM8YCkL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51koKg7lnuL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "White Crochet"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "1063278",
            "title": "Home Décor"
        },
        {
            "node": "3735061",
            "title": "Home Décor Accents"
        },
        {
            "node": "12659353011",
            "title": "Dream Catchers"
        }
    ],
    "similar": [
        "B077ZQM297",
        "B06XJ17PWQ",
        "B07DWV71JV",
        "B07343FJWW",
        "B076Z1N87Y",
        "B01G4X620I",
        "B07B23KSCT",
        "B07869LLNY",
        "B07GKM8Q3W",
        "B07F5BSFW4",
        "B06ZZN75Y4",
        "B01KV9KU40",
        "B07CJSJ19P",
        "B075R7DLSJ",
        "B01HQHR8YU",
        "B078WFQH2X",
        "B07D7S5SV2",
        "B01IGSHB2M",
        "B0784FT5G3",
        "B07FNHN6WJ",
        "B0733KRHV8",
        "B07FMT9CSX",
        "B07G6Z4QG5",
        "B07C2QGQGQ",
        "B01MZ5T1OA",
        "B01LHO01UQ",
        "B079GJQZ6H",
        "B07CHDCBNG",
        "B077CJTMH9",
        "B074LJ1QK4",
        "B01HM2A0BC",
        "B07GQFPYN5",
        "B07FL1KLYZ",
        "B07FL4R3LZ",
        "B06XBXZ7LK",
        "B06ZYLJVLT",
        "B01HGNPDG4"
    ],
    "rating": "4.4"
}