{
    "asin": "B06ZZB62XM",
    "title": "SoundPEATS Bluetooth Headphones In Ear Wireless Earbuds 4.1 Magnetic Sweatproof Stereo Bluetooth Earphones for Sports With Mic (8 Hours Play Time, Secure Fit, Noise Cancelling) - Black",
    "brand": "SoundPEATS",
    "feature": [
        "[BLUETOOTH 4.1 + APTX] - SoundPEATS Q12 Bluetooth headphones support two devices connected simultaneously and allow automatically reconnecting if paired successfully before. They own high fidelity stereo sound with aptX codec. The headphones are widely compatible with most cell phones, such as iPhone and Android phones, and also plenty of other Bluetooth devices.",
        "[LONG-LASTING & LIGHTWEIGHT] - Upgraded built-in lithium batteries support up to 7 hours talk / music time (depends on volume and audio content) for prolonging enjoyment. Only charge for 1-2 hours can get full energy back. The surprisingly ultra light design at only 0.53 ounces net weight barely makes you feel anything during workout.",
        "[BUILT-IN MAGNETS] - Both earpieces are with built-in magnets which can attach to each other like a necklace around your neck when not in use. This elegant design helps earphones storage and keeps you away from getting entangled with the wire. You’ll find it most convenient to carry the earphones around for any outdoor activities, such as hiking, cycling, sports, exercise, and more.",
        "[SECURE & COMFORTABLE FIT] - SoundPEATS Q12 Bluetooth headphones are ergonomically designed with oblique angle to fit your ear canal better and reduce noise. In addition, with 4 pairs of ultra soft ear tips (XS/S/M/L) and 3 pairs of ear fins included, the earphones ensure comfortable and secure wearing and using experience.",
        "[IN-LINE MIC & VOLUME CONTROL] - With in-line microphone and volume buttons, the headphones enable you to make hands-free calls and manage music easily and instantly. Tips: When charging with a charging adapter, please make sure the current should not be greater than 1A. SoundPEATS provides 12 months hassle-free warranty to ensure the enjoyment of your purchase."
    ],
    "description": "♥ How to pair the headphones to your device? ♥1. SoundPEATS Q12 headphones support both iOS and android system, and also most of other Bluetooth-enabled products.2. Please turn on the Bluetooth on your device at first. Then press and hold the middle button (multifunctional button) on the headphones until hearing \"power on\" and \"pairing\", the red and blue indicator will also flash. There you can see \"Q12\" on the Bluetooth list of your device. You will be able to get them connected by clicking the pairing name \"Q12\".3. SoundPEATS Q12 can remember previously paired devices. Hence, you don't need to go through the pairing steps every time. Next time, you will only need to turn on the headphones.Should you have any pairing issues, please do feel free to reach us. Some customers are not aware of holding the button after turning on the headphones in their first use, therefore they can't get the headphones into pairing mode.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 35.0,
        "length": 2300.0,
        "width": 100.0,
        "height": 130.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41UGgkzmtiL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51cutU4YNsL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BNRJbWgAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51iMEYyMEiL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41dlVGpXWAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5173J07XUXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418LXtVHS9L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B07DFGP3XQ",
        "B07GFGJJS8",
        "B07G93VKWT",
        "B074THH5Q2",
        "B0765DV1KD",
        "B07FLKQ2N1",
        "B01G8JO5F2",
        "B06XFHJH4G",
        "B07BQCTYML",
        "B07DN8HS95",
        "B0772PPFX6",
        "B07CG7KW3D",
        "B01L160DLW",
        "B07C77M3HL",
        "B079Z1YZT2",
        "B07G2MTWR4",
        "B07GB2FT4J",
        "B07D75GT72",
        "B079Z2SCP3",
        "B07FPG94RP",
        "B07B93BTJ5",
        "B07GVXYBVX",
        "B06XNWCHS5",
        "B07F2VPFJ7",
        "B075NRNZWD",
        "B07C4PNW7W",
        "B07C9ZM22D",
        "B07D6KH5HF",
        "B076T3P91H"
    ],
    "rating": "3.6"
}