{
    "asin": "B06ZXXYSJS",
    "title": "Star Wars Battlefront II - PC",
    "brand": "by Electronic Arts",
    "feature": [
        "A New Hero, a Story Untold",
        "The Ultimate Star Wars Battleground",
        "Galactic-Scale Space Combat"
    ],
    "description": "Battlefront II: Heroes pack: Embark on an endless action experience from the bestselling Star Wars HD videogame franchise of all time. Rush through waves of enemies on Starkiller Base with the power of your lightsaber in your hands. Storm through the jungle canopy of a hidden Rebel base on Yavin 4 with your fellow troopers, dispensing firepower from AT-STs. Line up your X-wing squadron for an attack on a mammoth First Order Star Destroyer in space. Or rise as a new Star Wars hero – Iden, an elite Imperial special forces soldier – and discover an emotional and gripping single-player story spanning thirty years. Experience rich and living Star Wars multiplayer battlegrounds across all three eras: prequel, classic, and new trilogy. Customize and upgrade your heroes, starfighters, or troopers, each with unique abilities to exploit in battle. Ride tauntauns or take control of tanks and speeders. Down Star Destroyers the size of cities, use the Force to prove your worth against iconic characters such as Kylo Ren, Darth Maul, or Han Solo, as you play a part in a gaming experience inspired by 40 years of timeless Star Wars films. You can become the master of your own hero’s journey. Jump into the boots of an elite special forces soldier, equally lethal on the ground and space, in an emotionally gripping new Star Wars campaign that spans over 30 years and bridges events between the films’ Star Wars: Return of the Jedi and Star Wars: The Force Awakens. A Star Wars multiplayer universe unmatched in variety and breadth where up to 40 players fight as iconic heroes, authentic-to-era troopers and in a massive array of vehicles on land and in the air – as battle rages through the galaxy. Space combat has been designed for Star Wars Battlefront II from the ground up with distinct handling, weapons and customization options. Join your squadron and weave in between asteroids fields, fly through Imperial Dock Yards and take down massive capital ships as you pilot legendary starfighters in high stakes dogfights with up to 24 players and 40 AI ships. Not just an iconic hero- your hero. Master your craft with customizable character progression. Upgrade abilities unique to each hero, trooper class, and starfighter. Use these abilities to adapt and modify your character’s powers, either as lethal active effects on your opponents, helpful status boosts, or tactical assistance, to counter any opponent on the battlefront. ** STAR WARS BATTLEFRONT II (“PRODUCT”) THE LAST JEDI HEROES OFFER EXPIRES UPON PRODUCT RELEASE. Offer valid only at participating retailers. Other conditions and restrictions apply. See www.ea.com/games/starwars/battlefront/battlefront-2/disclaimers for details.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": null,
        "length": 740.0,
        "width": 50.0,
        "height": 550.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51B7vBFLbxL._AC_SX150_SY75_CR,0,0,150,75_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41QopTmgZvL._AC_SX150_SY75_CR,0,0,150,75_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41czxnSBvGL._AC_SX150_SY75_CR,0,0,150,75_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "468642",
            "title": "Video Games"
        },
        {
            "node": "229575",
            "title": "PC"
        },
        {
            "node": "4924894011",
            "title": "Games"
        }
    ],
    "similar": [
        "B071ZRTMXF",
        "B00YXO5U40",
        "B07F776WF3",
        "B079G9FDHX",
        "B076BZTZQV",
        "B01GKGVI8K",
        "B076DWKD5B",
        "B074X2LK3L",
        "B07CG4R3MQ",
        "B01EZA0DFW",
        "B000AAL4HI",
        "B076NDKCBX",
        "B0779K3FXQ",
        "B07BS73N8T",
        "B071Y1RXHG",
        "B01AU7Z5A2",
        "B077BXCCWS",
        "B074PJCWQS",
        "B072MK1CY2",
        "B0779LGKH5",
        "B077QCB34Y",
        "B071NB8J67",
        "B06ZZHRXYZ",
        "B076PXC9Z6",
        "B07FFLHM13",
        "B00GYBPYR8",
        "B072Q4Y5FV",
        "B071Y9XLYJ",
        "B00W8FYF4W",
        "B01N1P0KFI",
        "B06XPPQD2V",
        "B01GW8YDLK",
        "B077LBCL22",
        "B07DDD9VK7",
        "B077LCYLDP",
        "B0778YBHN4",
        "B007XIWJWY"
    ],
    "rating": "2.9"
}