{
    "asin": "B071JBBYCR",
    "title": "Anker SoundBuds Slim Wireless Headphones, Lightweight Bluetooth 4.1, Stereo IPX5, Earbuds with Magnetic Connection Nano Coating, Sweat Resistant, Sports Headset with Metallic Housing (Blue)",
    "brand": "Anker",
    "feature": [
        "Listen Up: Precision engineered 6mm drivers, fed via Bluetooth 4.1, offer powerful and skip-free audio.",
        "Find Your Fit: Lightweight design with customizable EarTips and InEar-Hooks give anyone a strong and comfortable fit.",
        "Leading Playtime: Listen for up to 7 hours on a single charge. Enough juice to soundtrack your day.",
        "Water-Resistant: Run in the rain or sweat it out in the gym. IPX4 water-resistant shell and internal nano-coating provide a double layer of water protection.",
        "What's In The Box: SoundBuds Slim, XS/S/M/L EarTips, S/M/L InEar-Hooks, FitClip, Shirt Clip, Micro USB Cable, Travel Pouch, welcome guide, our worry-free 18-month warranty and friendly customer service."
    ],
    "description": "SoundBuds Slim The Lightweight Earbuds that Defy Sweat and Rain High-Fidelity Audio 6mm drivers deliver crisp, clear music to your ears via a smooth, skip-free connection. Built For Active Lifestyles SoundBuds Slim are designed to be slimline and light (15g), while offering serious performance. Magnetically attach together when not in use, or tuck away into the travel pouch. Customizable Fit Multi-size EarTips and InEar-Hooks provide a sturdy, comfortable hold. Cable measures 55cm for universal fit and no annoying tangles. Adjust your cable length with the FitClip, or affix to your clothing for extra security via the Shirt Clip. Water Resistant IPX5 water-resistant shell and internal nano-coating ensures complete defence against liquids. Push yourself to your limit during workouts and SoundBuds Slim will handle your audio effortlessly. Listen Longer Play for up to 7 hours; longer than most earphones on the market. Bluetooth 4.1 ensures a connection range of up to 33 ft, compatible with the iPhone 7 or any Bluetooth device. Intuitive Control In-built microphone (with CVC Noise Suppression) and 3-button remote enable you to manage more conveniently - from skipping a song, to answering a call without touching your phone. Worry-Free Warranty At Anker, we believe in our products. That's why we back them all with an 18-month warranty and provide friendly, easy-to-reach support. Note: If you want to recharge these earbuds after exercising, please follow these steps: 1. Open the port cover and shake to remove any sweat from inside the USB port.2. Wipe the USB charging port dry with a cotton cloth.3. Charge with a 5V certified charger and cable.4. Make sure the port cover is fully closed after charging. *Playtime varies according to volume level and audio content",
    "price": 2799.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 22.0,
        "length": 2180.0,
        "width": 120.0,
        "height": 50.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31n8NknhzKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512uherCrXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2Ba90HAIXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51aUECFjEPL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61ClTAbVwUL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-Qa%2BbrDRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RMTuxj9IL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B07BMV5T2N",
        "B0792QJQT1",
        "B07GFGJJS8",
        "B07BHHB5RH",
        "B0194WDVHI",
        "B072JJNYQY",
        "B076P5ZYGB",
        "B071G5WSK2",
        "B07GCZ83GX",
        "B01N7M9CLT",
        "B076V4H8BR",
        "B0756T7R5T",
        "B01L160DLW",
        "B07BHDLXGK",
        "B01G8JO5F2",
        "B07BPV776F",
        "B07DYWHL6Y",
        "B07BMQXBFH",
        "B079SPB12V",
        "B01NBOPJW2",
        "B078P4JHVW",
        "B073YMJ1RQ",
        "B01N6DC2ZE",
        "B01IUP89LS",
        "B01IEHIMLY",
        "B07DHCZ1TR",
        "B07B9R67WR",
        "B07C77M3HL",
        "B07D4GXQTM",
        "B07GF3STXM",
        "B071GNH9MT",
        "B07B8CNHW9",
        "B075NRNZWD",
        "B07BHF993Q",
        "B0765DV1KD"
    ],
    "rating": "3.9"
}