{
    "asin": "B0714KKB2R",
    "title": "Male Masturbator Sex Toys, Louviva Realistic Vagina Pocket Pussy, Adult Toy for man Masturbation,Discreetly Packed",
    "brand": "Louviva",
    "feature": null,
    "description": "Save 15% on the purchase of Qualifying 2 Louviva products, 20% of Qualifying 3 and 30% of Qualifying 4. Enter code 9MMGL4AT at checkout. Male Masturbators Vagina Pocket Man Masturbation Cup Louviva Sex Toys for male Realistic Textured Discreetly Packed Made of soft and safe TPR material that is pliable like real skin, giving a lifelike feeling with every thrust All the edible level of green made of soft, safe and environmentally friendly non-toxic no Smell. Realistic 3D vagina, the vagina to join the massage soft thorns, when used to enhance The friction pleasure, so that more intense pleasure. Features an internal textured tunnel and super stretchy material, with a tight, textured sensation, this stroker is designed to give men realistic blow job experience Full IPX7 waterproof function grade level.easy to clean. Squeeze a little silicone or water-based lube in for better experience.DISCREET PACKAGING And Amazon FBA Prime Expedited Delivery Click “Add to Cart” NOW to experience pleasure the Louviva massager bought to you. Shipped fast and totally discreet – Now go for it! All Louviva products come with 24-month 100% money-back guarantee. If you have any problems with this toy, you can just contact us for a solution. Product Specifications: ✔ Material: body-safe TPR ✔ Model:SQ-MA60023 ✔ Product Dimensions: 16.5cm*9.4cm ✔ Function:For Male Masturbator Pleasure ✔ Waterproof IPX7 waterproof function grade level and easy to clean ✔ Packaging List: a Male Masturbator, a product specification",
    "price": 2888.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 130.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41d1EybTqpL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41T5q9WbpKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410mDHzhf3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31B2vbB-9yL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41DxeH%2BYABL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31NEREgjcCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31P6x4WrBJL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3777371",
            "title": "Sexual Wellness"
        },
        {
            "node": "3777781",
            "title": "Adult Toys & Games"
        },
        {
            "node": "3777811",
            "title": "Sex Toys"
        },
        {
            "node": "1243837011",
            "title": "Masturbators & Dolls"
        }
    ],
    "similar": [
        "B078SQ3VZS",
        "B00G5K7L24",
        "B07G74RWGD",
        "B01DVLP2UW",
        "B0713MFZS8",
        "B074CBVPDR",
        "B07DQPCB13",
        "B073GV87WF",
        "B075455QQR",
        "B0787XJNVR",
        "B078X85TN6"
    ],
    "rating": "3.6"
}