{
    "asin": "B071CSSBMJ",
    "title": "ETEVON Women's Casual Crystal Quartz Leather Watch with Black Dial and Rose Gold Stainless Steel Case, Simple Dress Wrist Watches for Women Ladies",
    "brand": "ETEVON",
    "feature": [
        "❤CLASSIC ELEGANT DESIGN❤ The classic elegant watch features with glossy bezel and rose gold watch hand . The mysterious black dial with four luxury crystal marker. Perfect for all kind of business, casual, indoor activities and daily use",
        "❤IDEAL GIFTS FOR WOMEN❤ Comes in an elaborate luxury gift box. No extra wrapping needed. Perfect fashion gift to your girlfriend and wife, etc.",
        "❤WATER RESISTANT FOR DAILY USE❤ 98FT(30M) water resistant, hand-wash, splashing and raining are all No Problem. NOTE: Please DO NOT PULL OUT the crown under water",
        "❤HIGH QUALITY COMPONENTS❤ Japanese quartz movement provides precise and accurate time keeping. Japanese long-usage battery, scratch-resistant mineral watch face, stainless steel back case etc.",
        "❤ETEVON SERVICES❤ 90 days money back guarantee for any reasons + 12 months replacement or full refund for quality issues + 24 months maintenance for quality issues"
    ],
    "description": "ETEVON, as an innovative pioneer in the industry, is committed to provide people the watches of quality and style, with advancing design philosophy based on a well equipped factory. Every single piece is made of firm and properly selected materials, imported movement, hardlex window glass and comfortable band. Above all, ETEVON watch will surely be a trustworthy partner in your daily life. 1.Elegant Dial Design : The rose gold watch hands and luxury crystal markers, stylish and fashionable. 2.Classic Simple Surface : The mysterious black dial surface with glossy rose gold-toned bezel, just like the deep universe on your wrist. 3.Classic Leather Strap : Soft and thick leather, comfortable and durable to wear.4.Water Resistant for Daily Use : In general, withstands splashes or brief immersion in water, but not suitable for swimming.5.Fashion Dress Matching : The elegant watch is fitted for different styles of dress. Perfect for all kind of business, casual, indoor and outdoor activities. Case: Metal Band: LeatherWindow: Mineral Glass (Scratch Resistant) Dial Color: Black Dial Case Diameter: 1.4 inches Dial Case Thickness: 0.3 inches Band Color: Black Band Width: 0.6 inches Band Length: 9.3 inches Band Clasp Type: Buckle Watch Weight: 1.06 ounces 1. Please DO NOT PULL OUT any button in the water 2. If mist or droplets found inside watch surface, please contact manufacturer immediately 3. Clean the strap by a soft cloth on regular bases is highly recommended",
    "price": 1499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41JGzBUdHcL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/415o0918v9L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Zu%2BC4XDwL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WyCjtOurL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kbKISLFEL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51uLGIxweOL._SR38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        },
        {
            "node": "6358543011",
            "title": "Watches"
        },
        {
            "node": "6358544011",
            "title": "Wrist Watches"
        }
    ],
    "similar": [
        "B000GX3ILO",
        "B071Z2PWZJ",
        "B01N5P90HX",
        "B004MSU88K",
        "B06ZYQ7HZ6",
        "B07657P1FN",
        "B06ZZ9MB1N",
        "B06XBWB3PR",
        "B000GX3IL4",
        "B078YBG1VC",
        "B078YCN8N1",
        "B0773MW1FL",
        "B076DGNPYT",
        "B000GAYQT0",
        "B078NJ2L3G",
        "B06XS9NQPF",
        "B0777L7QMG",
        "B071XRZ4YJ",
        "B07GQZDMG2",
        "B07FC8V73R",
        "B07H83WRWN"
    ],
    "rating": "4.1"
}