{
    "asin": "B071D58ZY5",
    "title": "LEVOIT LV-H132 Air Purifier with True Hepa Filter, Odor Allergies Eliminator for Smokers, Smoke, Dust, Mold, Home and Pets, Air Cleaner with Optional Night Light, US-120V, White, 2-Year Warranty",
    "brand": "LEVOIT",
    "feature": [
        "Ideal for wildfire smoke and ashes; good choice for allergy season",
        "3 Stage Filtration System: Pre-filter, TRUE HEPA Filter, & Activated Carbon Filter. It removes 99.97% of dust, pollen, smoke, odor, mold spores, and pet dander; filters particles as small as 0.3 microns and larger and filters air pollution of PM 2.5",
        "100% ozone free, does not use UV or ions which produce trace amounts of measurable ozone, a harmful air pollutant",
        "3 Speed Settings (low, medium, and high) provide options for various conditions. Noise Level : 50 dB. Power Consumption : 28 Watts",
        "Quietly operates throughout the night, and has a gentle night light with two brightness settings",
        "Unique size and contemporary design makes it a perfect fit in smaller rooms or office spaces. The perfect gift for family, friends, and office mates",
        "2-year warranty and lifetime support; CARB, ETL&FCC-approved. Note: please remove the plastic bag of the HEPA filter and charcoal filter before running the air purifier",
        "On average, the filter should be replaced every 6 months and is available for purchase (Search for: LV-H132-RF); the air filter may need to be replaced sooner or later depending on the air quality in your area"
    ],
    "description": "Love fresh air? Bring it inside—whether in your living room, atop a small nightstand, or right next to you at your work, let the LEVOIT LV-H132 Air Purifier do its work. Choose from low, medium, or high fan speed settings. Three stages of filtration (Fine Preliminary, True HEPA, Activated Carbon filters) tackle 99.97% of particles and odors. Enjoy a cleaned-up breathing space all around it. And sit back knowing there’s a 2-year warranty that comes with lifetime support from Levoit customer service.1 x True HEPA Air Purifier1 x Fine Preliminary Filter1 x True HEPA/Activated Carbon filter1 x User Manual1.Power Supply (only): AC 120V / 60 Hz. (A voltage converter is needed to transfer the power supply to US use first if you want to use this air purifier beyond the US.)2.Please check the filter's color to relieve your concern on whether the device is purifying the air.3. To be Ozone-free, this Levoit Air Purifier is NOT AN IONIZER and does NOT USE UV-C LIGHT. Ionic air purifier emits negatively charged ions into the atmosphere of a room. As a result, a small amount of ozone is produced. UV-C light systems will produce \"photolytic\" ozone when UV-C hits oxygen (O2) molecules. Ozone is an important part of the atmosphere, but ozone is harmful for the lungs at ground level.4. Always allow 15 in. (38 cm) of clearance on all sides of the purifier.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 630.0,
        "length": 850.0,
        "width": 850.0,
        "height": 1450.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41QTAu6KexL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51U9Apykc7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FIoe235UL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51jaH6kh3BL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fPbg%2BfzuL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51cqz38DbRL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "White"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "3206324011",
            "title": "Heating, Cooling & Air Quality"
        },
        {
            "node": "267554011",
            "title": "Air Purifiers"
        },
        {
            "node": "510192",
            "title": "HEPA Air Purifiers"
        }
    ],
    "similar": [
        "B00V609RPW",
        "B06XD7X81D",
        "B07BQ7JX9V",
        "B06W54K29J",
        "B004VGIGVY",
        "B07CHTTWRH",
        "B07C8B1JMS",
        "B074MZ6S13",
        "B0763R5H75",
        "B00895ICIK",
        "B0722YZ1R1",
        "B078K4CLNK",
        "B075K5J94D",
        "B07CTB6JPC",
        "B07BZGSVMH",
        "B01JKDAN2M",
        "B077V2MKY1",
        "B00XW2JLZI",
        "B076X2FJ5X",
        "B07DFVYZCR",
        "B077RVGBT2",
        "B075YLJM75",
        "B005NICL7E",
        "B00NB8NA14",
        "B01CTN024Y",
        "B00D8Y1YLE",
        "B078QXBZ66",
        "B075F915WR",
        "B0716F16MN",
        "B00NB8N7OO",
        "B07CKWMGJN",
        "B005CWK0FG",
        "B01D8DAYII",
        "B0788GPZPB",
        "B01N4IRIWK",
        "B00OLBR084",
        "B0796Q6KX8",
        "B07BF91M9L"
    ],
    "rating": "4.3"
}