{
    "asin": "B0713YF4V1",
    "title": "CYLAPEX 2 Pack White Fairy Lights Fairy String Lights Battery Operated Remote Control Firefly Lights 8 Modes 16.4ft 50 LED Copper Wire Twinkle Lights Small Christmas Lights Christmas Décor Waterproof",
    "brand": "CYLAPEX",
    "feature": [
        "Battery Operated(Non Plug-in) - The fairy string lights are powered by 3x AA Batteries (Batteries NOT Included), the battery case is with switch button helping control and change the lights mode, very easy & safe to operate, up to 5days continuous battery life if using with steady on mode, longer if using with breaks",
        "8 Modes with Remote - Remote control for turning on/off the lights and setting them to mode you like, 8 modes are: Combination; In wave; Sequential; Slo-glo; Chasing/Flash; Slow fade; Twinkle/Flash; Steady on. Mode also can be changed by clicking the switch button on the battery case",
        "Timer Function and Brightness Adjustable - Press timer button on control to activate timer function of lighting circle of 6hrs on, 18hrs off. You can also adjust the lights brightness for saving energy",
        "Waterproof & Widely Used - IP67 grade waterproof level makes it possible for both indoor & outdoor lighting decoration, creating romantic and festive lighting atmosphere. These fairy lights are suitable for any king of led décor idea, all imaginable & unimaginable occasions like Christmas, Wedding, Party, Halloween, Thanksgiving, Outdoor adventure, Bedroom, Living room and plants, crafts, projects and etc…",
        "What You Get - CYLAPEX 2 Sets Fairy String Lights Battery Operated(Battery NOT included), 2 Remote Controllers(Battery Included), 1 User Manual, CYLAPEX Gift Card, 18months warranty and a lifetime friendly customer service"
    ],
    "description": "The CYLAPEX Fairy Lights are waterproof and dimmable with 8 modes adjustable by using the remote control.Lighting color is cool white, 50 LEDs on 16.4ft silvery copper wire, flexible and bendable, sturdily built with durable IP67 waterproof battery case. --- The waterproof lights strings are perfect for outdoor lighting décor, wrap them on trees, flowers or decorate your wedding with cool pure and romantic atmosphere.Take them to your outdoor night adventure for more fun, use these lights for any occasion outside patio lawn and garden that needs decorative lighting. --- Put them into mason jar, they’re firefly lights then and perfect night light in your bedroom, or centerpieces for your dinner party;Surround the fairy lights on projects or crafts, adding much more fun for parties and events. Fairy String Lights Length: 16.4feetMaterial: Silvery copper wireLED QTY: 50pcsLight Color: Cool WhiteModes: 8 with TimerDimmable: YESPower Supply: 3x AA batteries (NOT included) Battery Case: WaterproofBattery Case Size: 3.15*2.36*0.87inchesRemote Controller: Powered by CR2025 Battery (Included) Remote Operating Range: Up to 12feet (Make sure to point the remote to the battery case) 1 --- Please prepare quality fresh 3 AA batteries before you receive the item2 --- Please replace with new AA batteries if the lights go dim or when the remote controller does not work well, top quality rechargeable batteries are recommended for saving money",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 40.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51FrtbZTOxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/610482gVyhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51l5mumy6vL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Dos2hmVoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51R6ZcJZLfL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61fqtITR9pL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "2 Set 16.4ft 50leds Cool White"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "13679381",
            "title": "Seasonal Décor"
        },
        {
            "node": "3736751",
            "title": "Seasonal Lighting"
        },
        {
            "node": "15704871",
            "title": "Indoor String Lights"
        }
    ],
    "similar": [
        "B077NHH18W",
        "B0713YDXH2",
        "B074TBPJ5V",
        "B071YV717D",
        "B079YD2TMX",
        "B01LWTYVF6",
        "B075NHR4DC",
        "B077N8J77P",
        "B07CQPGSF5",
        "B01N0XDLV2",
        "B078XBL3RC",
        "B072NH2FQ1",
        "B077N6Q3B8",
        "B077N5LGCX",
        "B075GG43SK",
        "B01LLSNG1E",
        "B01KE88N5Q",
        "B075SYL9YQ",
        "B077N8JBVC",
        "B01G1DRQF6",
        "B0136BFTWI",
        "B0744B48XM",
        "B077NDKMR5",
        "B0084M67LM",
        "B01M0XUF5P",
        "B00MHOBWYK",
        "B01M35WBDZ",
        "B0149EAWZK",
        "B00DNZ53RE",
        "B077NL4JBP",
        "B0753YKWLY",
        "B07D7FZHWK",
        "B07G8WPLFF",
        "B01N488IFW",
        "B07G95TCLL",
        "B01FOITH9M",
        "B077NCRXHR",
        "B01LPZQKKC"
    ],
    "rating": "4.3"
}