{
    "asin": "B072SNH5HB",
    "title": "3Pack 3FT 6FT 10FT Long Micro USB Cable, High Speed Nylon Braided Micro USB Fast Charging Cord & Data Transfer Android Charger for Samsung Galaxy S7/S6/S5/Edge,Note 5,HTC,LG(Black Gold)",
    "brand": "Qwik Charge",
    "feature": [
        "✅ UNIVERSAL COMPATIBILITY: Support most Android Tablets, Cell Phones, and Windows Phone which with Micro USB port. Compatible with Samsung Note 5, Galaxy S3/S4/S6 Edge S7, HTC, Motorola, Nexus, Nokia, LG, HP, Sony, Blackberry, MP3 and other Micro USB compatible devices.",
        "✅ PREMIUM QUALITY NYLON BRAIDED: The Micro USB cord jacket is woven tightly with premium fiber braided materials. The ultra-compact aluminum alloy plated connector allows the cable to plug into a very suitable jack space and has a great connection between connector and device. Heat-resistant connectors ensure complete safety and reliability.",
        "✅ HIGH SPEED SYNC & CHARGE: High-quality copper wire maximizes signal quality and increases durability. Great performance ensures your devices syncs and charge simultaneously with up to 480Mb/s transferring speed. We have done vigorous testing to deliver a fast and safe cable",
        "✅ DIVERSE LENGTH: 3ft/6ft/10ft different length for using on sofa, in bed, in car and some other places. The bundles of the micro USB cable make your life more convenient.",
        "✅ WARRANTY POLICY: Every sale includes a 12-month, worry-free guarantee to prove the importance we set on quality. If you have any questions, don't hesitate to contact us!"
    ],
    "description": "Qwik Charge 3Pack 3FT 6FT 10FT lengths Micro USB 2.0 Nylon Braided Cables is 100% brand new and is of the highest quality. All cables religiously tested by our professional teams before shipping out to ensure you and your device safely. It is widely used to connect the computer's USB port to your phone and sync & charge your phone simultaneously. The Micro USB 2.0 cable is widely compatible with variety of smartphones, such as Samsung S6/S5, Note5, HTC One, Motorola ATRIX, Nexus 4, Nokia, LG, HP, Sony, Blackberry, MP3 or any Micro USB compatible devices. The premium nylon braided Micro USB 2.0 cables make great performances to ensure your devices sync and charge simultaneously with up to 480Mb/s transfer speed. We have done vigorous testing to deliver a fast and safe cable. 3FT 6FT 10FT length provides your great convenience. You can use your device with more freedom when charging in bed, sofa, cars, hotel rooms, and more. We stand by each customer and offer easy to reach and 24 hours reply with solution service. 12 MONTHS NO WORRY WARRANTY GUARANTEE provides confidence for your every purchase from Geeks Garage. If you have any questions, please do not hesitate to contact us. 1X3FT Black&Gold Micro USB 2.0 Nylon Braided Cable1X6FT Black&Gold Micro USB 2.0 Nylon Braided Cable1X10FT Black&Gold Micro USB 2.0 Nylon Braided Cable",
    "price": 1148.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51IyYbpCwtL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41f0tjTWLRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51K3peKztFL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/418xx%2B8gPHL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61BaV1nlwzL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407774011",
            "title": "Cables"
        }
    ],
    "similar": [
        "B079BJWP8X",
        "B01HRVABD0",
        "B07DRFMR88",
        "B07F7SCQ5K",
        "B07CBNZXJN",
        "B00NH13BI2",
        "B079L22B9G",
        "B074QM24TR",
        "B01GJC4WRO",
        "B07678HQ26",
        "B078BPFW1D",
        "B077HWDL49",
        "B077TQYQ41",
        "B01G802HGU",
        "B06XD2QQFH",
        "B073PT6Q1P",
        "B07C3N7BQD",
        "B00QTE09SY",
        "B07CSRL6PH",
        "B076LSF2L6",
        "B07BWFRBTG"
    ],
    "rating": "4.0"
}