{
    "asin": "B072FHGPLH",
    "title": "Shxstore 2 X 2 Cardboard Flip Coin Holders For Coin Collection Supplies, 6 Sizes, 300 Counting",
    "brand": "Shxstore",
    "feature": [
        "Cardboard Coin Holders Assorted Sizes: Cardboard about 4 X 2 inch (100 X 50 mm), the size of the after folding 2 X 2 inch (50 X 50 mm). Internal diameter of 0.8 inch, 1 inch, 1.14 inch, 1.3 inch, 1.5 inch, 1.57 inch and other 6 dimensions.",
        "Coin Holders Product Packing: 50 each of 6 different sizes coin holders, and there are 300 coin holders in total.",
        "Simple And Practical: They are very good coin collection supplies, and also an inexpensive, practical way to store. Simply set your coin onto the clear window, fold the holder in half and seal with staples or tape.",
        "Flip Coin Professional Protection: Coin flips mylar is dedicated so they are safe for long-term storage, low dust level for the best protection.",
        "Powerful Enough: The coin flips includes flips for half dollar, dollar, pennies, quarter, penny and nickel, and these cardboard coin holders assorted sizes are very comprehensive, completely enough for your daily collection of coins."
    ],
    "description": "The coin holder is 100% brand new, high quality and well made. They are made of sturdy white cardboard which are durable enough to last for a long time. There are 6 different sized coin flips in the packing, 1 inch, 1.14 inch, 1.3 inch, 1.5 inch and 1.57 inch. It includes the most popular penny and quarter sizes, cents, nickels, dimes, quarters, halves, small dollars and large dollars. The assorted sizes combination meet various demands. The coin flips are binder pages and they are easy to use, insert the coin into the flip, fold over, and staple shut. The collectible coin holder is one of great coin collection supplies for both private collectors and professional dealers. They are perfect for long term storage and protection of cherished collectibles coins. The penny coin holder is with archival safe crystal clear window, so it can display your coins collections clearly and also can protect your coins from dust. The state coin holder is excellent gift for your friends, especially for coin collecting lover.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 105.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41SEvgPwYRL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41BL4F6zxJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41x1FjlPIZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Sv%2B5EHAaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41%2B%2BaTWNXzL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "1064954",
            "title": "Office Products"
        },
        {
            "node": "1069242",
            "title": "Office & School Supplies"
        },
        {
            "node": "1069376",
            "title": "Forms, Recordkeeping & Money Handling"
        },
        {
            "node": "1069378",
            "title": "Money Handling Products"
        },
        {
            "node": "490848011",
            "title": "Coin Storage & Shipping Boxes"
        }
    ],
    "similar": [
        "B005DNOQUY",
        "B00I23JCJC",
        "B0051QAN3M",
        "B06XK7G362",
        "B00M9G4AIG",
        "B006J36V8M",
        "B00A6WTXTQ",
        "B002KDNAU2",
        "B07CQQ4S81",
        "B0118GQZUS",
        "B07CST2PJL",
        "B00C9P72XW",
        "B002BKEU2Q",
        "B01N5WWQZJ",
        "B002KDPEMY",
        "B077GKP2JG",
        "B07DDJSXXG",
        "B01N0V87F5",
        "B078GRX291",
        "B002BKKDS6",
        "B07CNDTYC6",
        "B005DGYCAA",
        "B0799DQG15",
        "B07CNTTVF9",
        "B07CQFPK3L",
        "B0776FJNLH",
        "B072KQCRB3",
        "B078GRRDK2",
        "B06XSQTNJY"
    ],
    "rating": "4.2"
}