{
    "asin": "B072Z9Z7RG",
    "title": "HTC U11 Screen Protector, OMYFILM HTC U11 Tempered Glass [Full Coverage] [Bubble-free] 9H Hardness Screen Protector for HTC U11 (Black)",
    "brand": "OMYFILM",
    "feature": [
        "Full Screen Coverage- Curved design and precisely cut perfectly fit the entire screen of HTC U11.",
        "High Definition- WIth strong adhesion all around the whole surface, it can stick snugly onto the screen and effectively reduce the rainbow effect.",
        "Scratch proof- Highly durable glass strongly protects the screen from scratches by knife, keys and normal wear and tear.",
        "Touch Compatible- 0.26mm thick glass material promises full compatibility with touch sensitivity and high response.",
        "Simple installation- Please gently press it from the center to sides as you aligning the hole positions, then it will attach to the screen automatically."
    ],
    "description": "U11 Screen Protector, OMYFILM HTC U11 Tempered Glass [Full Coverage] [Bubble-free] 9H Hardness Screen Protector for HTC U11 (Black) By undergoing high temperature temper treatment, Tempered-glass screen protector offers a good protection to your HTC U11 owing to its industry-high 9H hardness and the glass base, say goodbye to the possibility of scratches and enjoy a better touch experience. OMYFILM is engineered to allow your fingertips to glide effortlessly when using your phone or tablet. Our materials are designed to minimize friction and drag while remaining virtually invisible. Don’t settle for less when it comes to keeping your mobile electronics secure! 1. OMYFILM GLASS screen protector 2. Wet Wipe 3. Microfiber Cloth 4. Dust Absorber 5. Installation Instruction You will be entitled to have the products replaced if the products fail to be of acceptable quality and be supported with professional and efficient product & after-sales service guaranteed by Omyfilm. If you need any more information about our products, please feel free to contact our team and we’ll answer any questions you may have. If you’re looking for the BEST protection for your mobile devices, search for our full collection today to find everything you need no matter which brand of smartphone you rely on.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/510y171Nj1L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51okMWoyhdL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/417MqEp8SdL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41EAmtIQl%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412qWR%2BzPuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51VdRrU0BIL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407781011",
            "title": "Screen Protectors"
        }
    ],
    "similar": [
        "B077PXG6GD",
        "B07144ZQ87",
        "B075H9ZK47",
        "B07234FLGX",
        "B0721B7SZ9",
        "B0722X3M9F",
        "B077BVXNNK",
        "B07CTKF9N6",
        "B01MRRX62W",
        "B078XBTHZ7",
        "B07C5MWL22",
        "B07G2XRY71",
        "B072MSBFDK",
        "B075BL2CJX",
        "B071D7CM98",
        "B071FSWRTD",
        "B0728KGW2X",
        "B016QW1J5U",
        "B0728937FV",
        "B07FF39GMS",
        "B01NCM2Y8E",
        "B071G8J69W"
    ],
    "rating": "1.0"
}