{
    "asin": "B072BDL23Q",
    "title": "IAGREE Back Rear Camera Glass Lens Cover with Adhesive Fix Replacement Parts For For LG V20 H910 H918 LS997 US996 VS995 H990 (Black)",
    "brand": "Iagree",
    "feature": [
        "Brand New - High Quality Glass Lens Cover with Back Frame Holder For LG V20 H910 H918 LS997 US996 VS995 H990",
        "The lens cover and surrounding frame bezel not only protects your rear camera but they also surround it to ensure it securely stays in its housing.",
        "Instructions are not included however multiple videos are available on YouTube.",
        "It comes with tools kit, but you don't have to used all. Just pry the glass off and be careful of small glass pieces that flake off.",
        "Compatibility for LG V20 H910 H918 LS997 US996 VS995 H990"
    ],
    "description": "Back Camera takes great pictures, but if the rear camera lens on your phone has become scratched or broken then a simple replacement will let you get back to taking great sharp images again. This high quality Rear Camera Lens Cover Replacement is the exact part you require to make your rear camera like new again. Save your phone and money by using these parts Installation steps 1.Use a hair dryer to warm the glass and soften the adhesive, and pop the glass out from the back with the screwdriver. ( some model don’t need open phone, just clear broken back camera glass/Len) 2.Tear off the protective film on back camera len.(some model two Sided with film,some model just one side with film. 3.look \"inside\",Make sure the camera and the camera len is clear before installation ( some time you need to Anti-stafic cleaning wipe to clear len) Package Includes: 1. 1* High Quality Rear Camera Lens Cover Replacement (Glass) 2. 1*Handy Plastic Card Pry Opening Scraper for iPad Tablet for Samsung Mobile Phone Glued Screen Repair Tool ( it is easy to open phone) 3.1*Stainless Steel Anti-static Tweezers 4.2* Plastic spudger 5.1 * 0.8 x 30mm Pentalobe screwdriver 6.1 * 1.5 x 30mm Phillips screwdriver 7.2 *Plastic prying bar 8.1*Anti-stafic cleaning wipe ( some time need to clear the camera or camera len) 9.1*spared ouble-sided adhesive Compatible for LG V20 H910 H918 LS997 US996 VS995 H990 (All Carriers) With all of the included tools, the kit worked great and was easy to install. But maybe no all will need used in the Installation steps.",
    "price": 990.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 15.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41FUAUNWn5L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ug29-CIrL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Az2d4ZyzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ZY7W9D6CL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407780011",
            "title": "Replacement Parts"
        }
    ],
    "similar": [
        "B074GWQMRS",
        "B07DMXYC8V",
        "B074PNB8XS",
        "B01MQ7JLGS",
        "B07GXH2WK6",
        "B072FLYT96",
        "B07GXHLGRQ",
        "B01N8VDMIR",
        "B074C97HSS",
        "B06Y3JGZM6",
        "B07GB7VGGH",
        "B077BSW8VX",
        "B078C74D3W",
        "B00O79YIF8",
        "B073FJ66FP",
        "B01M5LG0N2",
        "B071RK5CWJ",
        "B072DZ5Y2K",
        "B07DQDBTZC"
    ],
    "rating": "3.7"
}