{
    "asin": "B072LV5WW3",
    "title": "Ecotools Cruelty Free and Eco Friendly Total Perf Blender Brush, Made with Recycled and Sustainable Materials",
    "brand": "EcoTools",
    "feature": null,
    "description": "The Total Perfecting Blender is designed with EcoFoam Technology to blend primer and foundation for flawless looking skin.Use sponge wet or dry. When using wet, squeeze excess water until damp. Apply makeup all-over face in a “stippling” or “bouncing” motion to blend product into skin. Dry and display sponge in aerated storage stand until next use. We've always believed in the power of beauty. At EcoTools we encourage you to embrace your own individual meaning of beauty and share it with the world, whether it is makeup tutorials, an inspirational story or giving back to the community. Because when you feel truly beautiful, you will make the world and everyone around you feel beautiful! Armed with a mission to make women look beautiful on the outside and feel just as good on the inside, sisters Jen and Stacey set out to create a brush collection that was not only nature friendly, but chic, high-quality, and affordable too. After sourcing recycled materials, renewable bamboo and better manufacturing processes, in 2007, EcoTools was born. This year, we’re celebrating EcoTools’ 10th anniversary by introducing a fresh new look, brushes that feel even better in your hands, and packaging with detailed tutorials that make it easier than ever to create a beautiful look from hair to toe. We’re also marking a decade of living beautifully by making a $100,000 donation to Glamour’s The Girl Project via our #MyTrueBeauty campaign that supports women’s empowerment and encourages women to become the best version of themselves. We believe in giving a new purpose to old things. That’s why our products are made from recycled aluminum and plastic. Our packaging is made of 100% Tree-Free paper. HOW? With 20% cotton and 80% bamboo fibers! The handles on our products are made of renewable bamboo, one of the fastest growing plants on the planet!",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 5.0,
        "length": 300.0,
        "width": 160.0,
        "height": 640.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41zAu6zec0L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41xP1egTNkL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31QTsaX0saL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31tZmvyRdgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31f5LoMfoJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/21A2hkcmaRL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "11062741",
            "title": "Tools & Accessories"
        },
        {
            "node": "11059391",
            "title": "Makeup Brushes & Tools"
        },
        {
            "node": "16228309011",
            "title": "Face"
        },
        {
            "node": "11059501",
            "title": "Blenders & Sponges"
        }
    ],
    "similar": [
        "B01BSB56OY",
        "B075R9VL9S",
        "B01MZARHY9",
        "B01F36JEXE",
        "B001SYWTFG",
        "B07B9NM47R",
        "B01JK8HP0U",
        "B01N7CHK17",
        "B00TN497PS",
        "B00TI6TSGY",
        "B004TSFBJO",
        "B001KYVLSU",
        "B06XX9YG35",
        "B01N4VMLGA",
        "B000BNG4VU",
        "B075R9P7HW",
        "B075S543DR",
        "B00QPNVC0I",
        "B01MS8EUTC",
        "B00GNA9KKM",
        "B00AEM0W3E",
        "B00SUWFDIO",
        "B01JINOV04",
        "B007K8Q6CQ",
        "B0745KM61Z",
        "B0723BFN7Q",
        "B074N8X393",
        "B07GSTFTJ8",
        "B071VZ6J36",
        "B07GT3HRK6"
    ],
    "rating": "3.9"
}