{
    "asin": "B0728GCLYM",
    "title": null,
    "brand": "RSP Nutrition",
    "feature": [
        "NATURAL, HEALTHY WEIGHT LOSS SUPPLEMENT - L-Carnitine is a natural amino acid that has been shown to help facilitate the transfer of fatty acids in order to increase energy production, stimulate fat loss, and preserve lean muscle during training.",
        "LOW RISK FAT BURNER - RSP Liquid L-Carnitine plays an essential role in converting fat into a usable energy source and has been shown in numerous studies to support fat loss and aid in muscle preservation during training, making it a powerful, stimulant free fat burner supplement for men and women.",
        "PROVEN STIMULANT FREE METABOLISM BOOSTER - By helping convert fat to usable energy and enabling the body to use that energy as fuel, RSP Liquid L-Carnitine becomes a potent supplement that helps boost metabolism, enhance athletic performance, and reduce fatigue with no jitters and no stimulants.",
        "NATURAL, HEALTHY WEIGHT LOSS SUPPLEMENT - L-Carnitine is a natural amino acid that has been shown to help facilitate the transfer of fatty acids in order to increase energy production, stimulate fat loss, and preserve lean muscle during training.",
        "LOW RISK FAT BURNER - RSP Liquid L-Carnitine plays an essential role in converting fat into a usable energy source and has been shown in numerous studies to support fat loss and aid in muscle preservation during training, making it a powerful, stimulant free fat burner supplement for men and women.",
        "PROVEN STIMULANT FREE METABOLISM BOOSTER - By helping convert fat to usable energy and enabling the body to use that energy as fuel, RSP Liquid L-Carnitine becomes a potent supplement that helps boost metabolism, enhance athletic performance, and reduce fatigue with no jitters and no stimulants.",
        "COMPREHENSIVE LIQUID FORMULA FOR RAPID ABSORPTION - RSP Liquid L-Carnitine contains 3000mg of 100% pharmaceutical grade L-Carnitine, formulated for maximum potency and efficacy, ensuring comprehensive weight loss support, making it a safe alternative to typical fat burners and diet pills.",
        "100% TESTED & GMP CERTIFIED - All ingredients in RSP Nutrition Liquid L-Carnitine are scientifically researched, tested, and manufactured in a GMP certified lab and contain no artificial colors, preservatives, or fillers."
    ],
    "description": "RSP's Liquid L-Carnitine promotes stimulant-free metabolism enhancement, fat burning, healthy body composition, and enhanced performance. L-Carnitine is an amino acid that has been shown to help facil ...",
    "price": null,
    "listPrice": 1998.9999999999998,
    "prime": true,
    "dimensions": {
        "weight": 123.0,
        "length": 250.0,
        "width": 250.0,
        "height": 850.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "info.html",
        "B07FCRQK54",
        "B01GVPUOCQ",
        "B079V3XVYX",
        "B00N4A2P60",
        "B01IX87MQU",
        "B0019LVGPW",
        "B00K7G08O0",
        "B00YCXWKC2",
        "B01MTJZNQF",
        "B01GNML37C",
        "B06ZZNJ6XT",
        "B01M9D1J2C"
    ],
    "rating": null
}