{
    "asin": "B0728HFQV9",
    "title": "Mpow Jaws [Gen-2] Bluetooth Headphones Call Vibrate Alert Wireless Neckband Headset Stereo Noise Reduction Earbuds w/ Mic",
    "brand": "Mpow",
    "feature": [
        "VIBRATING CALL ALERT: Mpow Jaws bluetooth headphones can vibrate when a phone call comes in and avoid missing incoming calls while the earplugs are not in your ears",
        "CONVENIENT SHARK-LIKE MAGNET and PLEASE NOTE: The built-in magnet attracts the earplugs when you don’t need them, greatly decreasing the burden on ears and giving you a convenient storage way to carry around. NOTE: To protect the earbud cable from the damage of pulling force, please pinch the earplugs instead of the cables when pulling earplugs out of the shark-like magnet which can ganrantee the lifespan of earbuds by using it in the right way",
        "CVC 6.0 NOISE REDUCTION: Featured with CVC6.0 noise reduction technology, Mpow Bluetooth neckband headphones filter out background noise to guarantee high quality sound and provide you clearer voice for calls",
        "FLEXIBLE & LIGHTWEIGHT: Mpow bluetooth headphones weigh only 1.2 oz in flexible and durable silicone, 60% lighter than any other bluetooth headphones, you’ll even forget you have them on!",
        "ULTRA LONG WORKING TIME: Mpow Bluetooth headset' powerful rechargeable battery provides up to 13 hours of continuous talking/music time and 350 hours of standby with a single charge. WARRANTY: Every Mpow product includes a 45 days money back & 18-month warranty"
    ],
    "description": "Featured with , the Bluetooth neckband headphones intelligently filter out background noise for perfect speech transmission in busy and noisy environments. Compared to Bluetooth 4.0, the latest features faster & stable signal transmission, clearer sound quality and lower power consumption.With the built-in intelligent magnet design, you can easily trim the earplug cables when you do not need them and hang the headphone like a necklace around your neck. Prevents troublesome wires from tangling and provides a natural feel through all-day wear.Unlike ordinary Bluetooth earbuds for running and workouts, this comfort-fit earbuds allows for easy and accurate one-touch control located on the neckband, no need to take off the earbuds.Now you do not have to stop what you are doing at hand to answer a call. The wireless Bluetooth headset allows auto switching between music and calls. You can control all functions of music and calls easily via the buttons on the headset. Enjoy a cheerful chat with your friends while you are doing your office work, housework, gardening, or particularly when you are driving along the fast lane.Every Mpow product includes a 45 days money back & 18-month warranty.",
    "price": 2499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 1140.0,
        "width": 800.0,
        "height": 130.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41te1VDDjOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51MF6rBZLYL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51en9MsMGAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517f4BqFmJL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mwy7KyFmL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dCwntk9sL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B015IEW1AY",
        "B07F63XBYQ",
        "B07DG18J6X",
        "B01MYRJSM5",
        "B07GD9T3V7",
        "B01IEHIMLY",
        "B07C4X3D5Y",
        "B07DWNMNQM",
        "B00AWIPITS",
        "B07216T4CB",
        "B075QLCNMG",
        "B07CYQSJRK",
        "B01L160DLW",
        "B07FLCFFRB",
        "B073JJBZ52",
        "B01JA9J6UQ",
        "B07CZYTKYS",
        "B07F6PNQ3S",
        "B07D4GXQTM",
        "B07GJ1P65W",
        "B07DZQ14VJ",
        "B07F59M551",
        "B075NRNZWD",
        "B075XPNT9S",
        "B071WJYGH7",
        "B01MDK0PIP",
        "B07DVM279T",
        "B075ZV96X6",
        "B07GN65CYN",
        "B07C6CC7TJ",
        "B073LZHPZH",
        "B01G8JO5F2"
    ],
    "rating": "4.4"
}