{
    "asin": "B0721MP41Q",
    "title": "Anker SoundBuds Curve Wireless Headphones, Bluetooth 4.1 Sports Earphones with Nano Coating, 14 Hour Battery, CVC Noise Cancellation, Workout Headset with Built-In Mic and Carry Pouch",
    "brand": "Anker",
    "feature": [
        "Loud And Clear: Superior sound quality with QualcommⓇ aptX™ audio and cVc noise cancellation technology for clear phone calls.",
        "Tailored To You: Customizable EarTips for the perfect everyday fit and additional EarWings to keep your headphones in place during tough workouts.",
        "Full Power: With 14 hours of talk time and 12.5 hours of music time you’ll need to recharge long before your headphones do. A 10-minute charge keeps you going for one hour.",
        "Superior Defense: Water-resistant casing and an impermeable nano-coating effectively protect internal components against liquids.",
        "What's In The Box: SoundBuds Curve, Multiple EarTips (silicone and memory foam), EarWings, Cord Management Clip, Shirt Clip, Micro USB cable, PU Leather Carrying Pouch with Aluminium Carabiner, and our worry-free 18 month warranty and friendly customer service."
    ],
    "description": "SoundBuds Curve Wireless HeadphonesThe Wireless Earphones With Superior Sound And Comfort From ANKER, the Choice of 20 Million+ Happy Users• Industry-Leading Technology• Worry-free 18 month warrantyPowerful SoundsPowerful Qualcomm® aptX ™️audio for superior sounds and clear calls with cVc Noise Cancellation technology. Memory foam tips provide total isolation from external noise. Stick With YouEarTips in multiple sizes offer excellent comfort day in, day out and silicone EarWings ensure SoundBuds stay in place during your most hardcore workouts. Zero to HeroFully charged in just 1.5 hours. Up to 14 hours of talk time and 12.5 hours of music time keep you tuned in no matter how long your gym session.Don’t Sweat ItProtective water-resistant shell and internal nano-coating keeps the tunes coming, whether you’re sweating buckets or running in the rain.Seamless ControlEffortlessly skip songs or answer a call using the 3-button remote with built-in microphone.Worry-Free WarrantyYou can enjoy peace of mind with our fan favorite 18-month warranty. Note:If you want to recharge these earbuds after exercising, please follow these steps: 1. Open the port cover and shake to remove any sweat from inside the USB port.2. Wipe the USB charging port dry with a cotton cloth.3. Charge with a 5V certified charger and cable.4. Make sure the port cover is fully closed after charging. *Playtime varies according to volume level and audio content.",
    "price": 2599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 2720.0,
        "width": 170.0,
        "height": 110.00000000000001
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41HGN3vNIML._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41OgnyLj9iL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X2Sn0XRxL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41po%2B2NO6lL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51F5KHsdzfL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51xNFYR%2BBNL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410xBV7wbWL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B00SXRXUFE",
        "B07G7YHL4G",
        "B01G8JO5F2",
        "B075BF8JJ3",
        "B07C77M3HL",
        "B076HG4F1L",
        "B07DYWHL6Y",
        "B0734SV14J",
        "B07GCZ83GX",
        "B07D4GXQTM",
        "B077XT42H5",
        "B0753GRNQZ",
        "B01HF0YGCK",
        "B075K2HFDY",
        "B074WTL19N",
        "B075QPHM3S",
        "B07BHHB5RH",
        "B0734T78Z7",
        "B077HKJK3S",
        "B07B9R67WR",
        "B07BMV5T2N",
        "B075K84P2T",
        "B076P5ZYGB",
        "B07G2R7NRR",
        "B0756T7R5T",
        "B07BKN8Q79",
        "B01N6DC2ZE",
        "B07BPV776F",
        "B07BHF993Q",
        "B0776ZGP7N",
        "B07BHLJ6BD",
        "B07FKL4VYF",
        "B07F2F8M31",
        "B079SPB12V",
        "B0769PYJ6M",
        "B07BC4PPZQ",
        "B07GFGJJS8",
        "B075F3P496",
        "B079CL7S2Z",
        "B073KXGWTN",
        "B01L160DLW",
        "B0734TM6D3",
        "B07FMYQMV5"
    ],
    "rating": "4.0"
}