{
    "asin": "B073R4GFFD",
    "title": "QardioBase 2 Wireless Smart Scale and Body Analyzer - Arctic White",
    "brand": "Qardio",
    "feature": null,
    "description": "GET FIT WITH BETTER DATA Want to know if you’re burning fat and gaining muscle? Or whether you’re actually losing weight, not just water? The QardioBase smart scale makes it all possible. Qardio Base 2 measures body mass index (BMI) and body composition, including body fat percentage and muscle, water and bone mass, for a complete picture of heath that goes far beyond weight. SET AND TRACK GOALS Set goals and monitor your daily or weekly progress with our intelligent results tracking. Tired of obsessing over the numbers on a scale? Switch to Smart Feedback mode, which uses emojis (smileys) instead of numbers to recognize progress. The scale includes Haptic Feedback, which uses a gentle vibration to confirm when a measurement is complete. Also works with MyFitnessPal to track nutrition. SMART AND CONNECTED QardioBase uses WiFi and bluetooth technology to send data to your iPhone, iPad, Apple Watch, Android Device or Kindle. Free and friendly Qardio App automatically syncs your data SLEEK AND MODERN DESIGN This fitness analyzer is as beautiful as it is smart. Ultra thin with glass top and an easy-to-read LED display. No need to hide it under the bed, you'll want to leave it out and use it every day. MADE FOR SHARING QardioBase is clever enough to automatically recognize different users in the same household. It has a special pregnancy mode so moms-to-be can track their weekly progress and add pictures to their numbers. - QardioBase Smart Scale, not just another wireless scale. - Fitness, BMI and Body Analyzer - Works with iOS 10.0 or later, Kindle, Android 5 or later, Android Wear and Apple Watch (iPhone not included) - Requires Bluetooth 4.0 - Measurement Range 9-396 Lbs. - Accurate down to 0.2 Lbs. with 4 Sensors - LED Display - Rechargeable battery (USB to Micro USB charging cable included), lasts up to 1 year with regular use",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 1130.0,
        "length": 1460.0,
        "width": 1460.0,
        "height": 150.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41oRAg8uumL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31rqM1l90gL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/413M%2BshiQUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41FxG9F60jL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51TBcz-00nL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ujnYWEYGL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3775161",
            "title": "Medical Supplies & Equipment"
        },
        {
            "node": "3777131",
            "title": "Health Monitors"
        },
        {
            "node": "8619064011",
            "title": "Body Composition Monitors"
        }
    ],
    "similar": [
        "B071ZPW19Q",
        "B01N1UX8RW",
        "B01F3LJ2RW",
        "B012AFGWXQ",
        "B073R3MJ87",
        "B0032TNPOE",
        "B07BJY6GTJ",
        "B01HLX3PDC",
        "B01C6CUFM2",
        "B077J7FGRF",
        "B00QU5OCI0",
        "B072BGYHLK",
        "B06W5JLTY4",
        "B07D9B1R2N",
        "B07965NDW7",
        "B00JM6EBHG",
        "B01MFAABKO",
        "B00QU5OCMQ",
        "B076MPFG7J",
        "B07CH395NF",
        "B06W9FPR82",
        "B071XW4C5Q",
        "B078HW8BPY",
        "B0752M6T6K",
        "B00QU5OCMG",
        "B01C6E2YSI",
        "B07CPZSG18",
        "B079DQ7JK6",
        "B078JDXLFG",
        "B01FHELB56",
        "B01B8LEELA"
    ],
    "rating": "3.2"
}