{
    "asin": "B073TRH3S7",
    "title": "20 Pieces Silicone Earbud Cover Tips Teemade Replacement Ear Gels Buds for Samsung Galaxy Note 5/Note 7/S7/S6/S6 Edge/Level U Earbuds (White)",
    "brand": "Teemade",
    "feature": [
        "High quality soft comfortable silicone, durable, flexible, removable and replaceable and washable",
        "Wearing the earbuds with comfortable feeling for a long time with this soft silicone earbuds covers",
        "Compatible spare ear gels to replace your old ones",
        "Packaging include 10 pairs silicone earbud tips",
        "Designed for the Teemade brand only for great quality"
    ],
    "description": "Package includes 10 pairs (20 pieces) white replacement earphone covers tips for galaxy s7, s6, s6 edge earphones. High quality soft comfortable silicone, durable, flexible, removable , replaceable and washable. Wearing the earbuds with comfortable feeling for a long time with this soft earbuds cover. Compatible spare ear gels to replace your old ones. Designed for the Teemade brand only for great quality. Packaging include 10 pairs(L1:10 pieces + R1:10 pieces) silicone earbud tips. Condition: Brand New Material: Soft Silicone Perfect Fit Made of soft silicone, unique design fit for Samsung earphones. Samsung Active In-Ear Headphones Samsung G920L Earphones Samsung EO-EG920BWGCH Earphones Samsung Level U Bluetooth Wireless Headphones Samsung Galaxy S6 Earphone Samsung Galaxy S6 edge Earphone Samsung Galaxy S7 Earphone Samsung Galaxy S7 edge Earphone Samsung Galaxy Note 5 Earphone Samsung Galaxy Note 7 Earphone",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 620.0,
        "width": 70.0,
        "height": 380.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412SyXa%2BAcL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "White"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "172532",
            "title": "Audio & Video Accessories"
        },
        {
            "node": "11039351",
            "title": "Headphone Accessories"
        },
        {
            "node": "13880181",
            "title": "Earpads"
        }
    ],
    "similar": [
        "B078SM9QYG",
        "B014DYJ67Q",
        "B07BHKNDDR",
        "B077FPNXQF",
        "B01D3QZB2Y",
        "B00XWQ0R8Y",
        "B07DJ3FGZ1",
        "B01N3YPMVS",
        "B07D7LK8NQ",
        "B01A7G35S0",
        "B074WLSWBZ",
        "B00YYTW7YU",
        "B07GJ1H1D8",
        "B075M4STL6",
        "B075QLCNMG",
        "B07GLHWBLD",
        "B07G9G2THT",
        "B01LLYXDT8",
        "B01HWU1FTA",
        "B07BNNYZRZ",
        "B0778TBVH2",
        "B075CJK3PX",
        "B01N79G14B",
        "B014O60QY0",
        "B07644ZS1D",
        "B06XH85LY4",
        "B072BZ1ZMM",
        "B06XBSYVLG",
        "B07BRS2VW7",
        "B01LT8BHL2",
        "B07GLTGP54"
    ],
    "rating": "4.5"
}