{
    "asin": "B074PPX1SN",
    "title": "Kimitech l065 Car Mount Mobile Phone Holder with Telescoping Long Arm Quick Release Button Vacuum Chuck with Stickiness for Smartphones of Different Sizes, GPS, PDA and Mp4 - Black",
    "brand": "Kimitech",
    "feature": [
        "Simple fixing button: Traditional mobile phone holder is easily damaged by pressing two wings to fix the phone",
        "Telescopic arm length: This holder can be fixed on the windshield and the dashboard",
        "High-quality vacuum chuck: Vacuum chuck has a strong and lasting adsorption force",
        "Full 360-degree rotation bead and 180-degree adjustable arm are designed for you to adjust your device up and down as you like",
        "Broad compatibility: This holder is suitable for 3-6.5inch mobile phones in the market, also, it matches mp3/4, GPS and pda"
    ],
    "description": "Super humanized design: The clamp arm is perfectly designed. It successfully avoids the position of buttons on the phone, charging port and headphone jack, which will bring more convenience to you. Shockproof and anti-skid: With the sponge layer, the bite force of the clamp arm is strengthened, which can effectively prevent shedding and scratching off your device. What is more, it is shockproof. Can be used frequently: After a long period of repeated adsorption, the suction cup may be dirty. You just need to clean it with water and wait for it to wind up. And it will have better adsorption.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 430.0,
        "width": 310.0,
        "height": 370.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Xe7Yc6oRL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [],
    "similar": [
        "B06X9BG9ZS",
        "B078J3D1VC",
        "B01IRJ2A4O",
        "B0785BJWPT",
        "B07CVDBN2R",
        "B075FNV5PB",
        "B01MR7LU0W",
        "B073R68TSH",
        "B074Z6GG6W",
        "B07G824TK9",
        "B01HBQBNCY",
        "B01MS8LG8T",
        "B00PGJWYJ0",
        "B07F378X1R",
        "B01MZWXIJ5",
        "B074PVFTDW",
        "B07DQF8SDM"
    ],
    "rating": "2.0"
}