{
    "asin": "B074JBLWDS",
    "title": "KUNSTWORKER 26800mAh Portable Charger, Qualcomm QC 3.0 Power Bank ,With LCD Digital Display,Type-C / USB-C Input & Output Battery Pack for Macbook, Galaxy S8, iPhone and More (black)",
    "brand": "kunstworker",
    "feature": [
        "●ULTRA-HIGH CAPACITY: Made by high quality lithium polymer battery pack, Perfect battery backup for Macbook, tablets, cell phones. Fast charging iPhone 7 10 times, Galaxy S8 7 times and iPad air 2.5 times, Macbook 1.5 times.",
        "●QC 3.0 Technology: Quick charge 3.0 available for both Input & Output! Charge up to 80% of the battery for QC 2.0 / 3.0 compatible devices when charging for approximately 35 minutes. QC 3.0 is compatible with USB, QC 2.0, & 1.0.",
        "●Charging and Recharging Quickly: The Bidirectional USB Type-C Port both supports Fast in and out. Dual Intput - ①Micro USB Input: 5V/2.1A max; ②Type-C QC 3.0 Input :5V/3.0A max. Dual USB Output -①OUT 1 Port: 5V/3.0A max; ②OUT 2 QC 3.0 Port: 5V/3A max, 9V/2A max, 12V/1.5A max. Charging 3 devices simultaneously, the most cost-effective external battery pack.",
        "●Built-in LCD Display and LED Flashlight: The LCD digital display help you easily know the charging status and remaining battery percentage clearly. The power bank has built in LED flash lights for dark or low-light environments. Our power charger is useful especially you are in a pinch and need a small light during a blackout.",
        "●Happinness Guaranteed: Our torage offers 18 months warranty, if you have any problems during the warranty period, feel free to contact us for replacement or refund. Quick customer service, we will answer and solve all your concerns about the product within 24 hours."
    ],
    "description": "① In order to reach the best performance, we suggest you choose 5V/2.4A or 5V/3.0A charger as well as the original USB cable which takes about 6-8 hours to be fully recharged. NOTE: AC Charger not included. ② The LED digital display screen of the mobile power supply has a protective film. Please tear it before using! Using Qualcomm's advanced Quick Charge 3.0 technology. QC3.0 also support QC2.0, charging speed faster than QC2.0 by 27%, reduce power consumption by 45%, can charge your smartphone to 80% within 35 minutes, providing 5V 9V 12V for different devices. Made by High Quality Lithium Polymer Battery Pack, Perfect battery backup for Macbook, tablets, cell phones. Fast charging iPhone 7/6/6s 8.5 times,7/6Plus 5 times, Galaxy S8/S7 5 times and S6 6.5 times, Ipad mini 3 times,2017/2016/2015 Macbook 2 times. Suitable for any devices with USB port, such as iPhones, iPad, Samsung, iPods, Galaxy, HTC, etc. Just connect this power bank with your phones, and then use it at ease. It is equipped with over-charged, over-discharged, over-voltage, over-current and short-circuit protection. The high-grade flame-retardant plastic shell protects your devices from damage. Capacity: 26800mAh Product Weight: 1 pounds Size: 6.5*3.1*0.6 inches (L*W*H) Input (Micro): 5V / 2.1A Max Input (Type-C): 5V / 3A Max USB Output 1 (QC 3.0) : 5V / 3.0A, 6.5V~9V / 2.0A, 9V~12V / 1.5A Max USB Output 2: 5V / 3A Max Type-C Output: 5V / 3A Max 1 x 26800mAh power bank 1 x USB Cables",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 117.0,
        "length": 310.0,
        "width": 90.0,
        "height": 650.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/417KaAQ1o%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41wv5-DTYCL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51pzakLPr8L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51OrfdxHSzL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YxUh-RPAL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41yFWpLHJiL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51o2fpk1nML._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407758011",
            "title": "Batteries & Battery Packs"
        },
        {
            "node": "7073960011",
            "title": "Portable Power Banks"
        }
    ],
    "similar": [
        "B071HQFYRR",
        "B01IVONCAG",
        "B01LRQDAEI",
        "B07CTBGNM4",
        "B01LA941IG",
        "B075CJQNW2",
        "B01N6M0GF5",
        "B078JKW4LS",
        "B0791BCKCS",
        "B0759TDR3H",
        "B0791BGYS3",
        "B07CNPJ69M",
        "B012NIQG5E",
        "B00W52JWFK",
        "B019IFIJW8",
        "B00X5RV14Y",
        "B01MTYAKAF",
        "B0761NKB74",
        "B07BGWRMZN",
        "B07793KSV4",
        "B074J6DT6S",
        "B0721MQ4Y9",
        "B07DJ5511L",
        "B01N48HMD0",
        "B07B8J6N2L",
        "B01MZ61PRW"
    ],
    "rating": "3.1"
}