{
    "asin": "B074W748MZ",
    "title": "Wireless Headset, TaoTronics Over Ear Bluetooth Headphones with Deep Bass & 25 Hours Playtime (Memory Foam Ear Pads, Dual 40 mm Drivers, On Ear Control Buttons)",
    "brand": "TaoTronics",
    "feature": [
        "Comfortable Fit for All Head Shapes: Treat your ears to pillowy, fully customizable comfort with memory foam ear pads, adjustable headband, and swiveling ear cups",
        "25 Hours in Just 2: Enjoy up to 25 hours of wireless music playback or a 3 month standby time after 2 hours of charging; connect via the included 3.5 mm cable when the battery finally runs out",
        "Supreme Auditory Experience: Stable CSR chip and two 40 mm large-aperture drivers make for unprecedented audio; acoustic seal cushions block outer noise for a more immersive reproduction",
        "CVC 6.0 Noise Cancelling Microphone: Reduces environmental noise and background disturbance for crisp, clear phone call quality even in noisy, crowded environments",
        "On-Ear Control Buttons: Adjust the volume, change the track, and play and pause the music via the headphones; foldable design makes it easier to fit in the included case for carrying and storage"
    ],
    "description": "Over-the-head headphones are just like hats: what fits you might not fit somebody else’s head. TaoTronics combats this reality by providing a Bluetooth headset that adjusts to best suit the user’s physiognomy. While the ear cups swivel and the headband extends to nestle on heads of different sizes and shapes, the memory foam ear pads feel soft, yet snug on the ears. Wireless headphones are great and nothing beats the convenience of streaming audio without the nuisance of wires. But what if the battery runs out? In addition to providing over a day of wireless music playback or a 3 month standby time after only 2 hours of charging, the TaoTronics Over-the-Ear Headset connects via the included 3.5 mm cord for uninterrupted audio reproduction. Make every tune, podcast, or movie memorable with the TaoTronics Foldable Earphones with On-Ear Controls. A more stable, easier to pair CSR chip and two 40 mm large-aperture drivers make for an unprecedentedly good audio quality, while the snug acoustic seal cushions block outer noise for a more immersive reproduction. Looking for a high-quality headset that doesn’t skim on functionalities? You’re in for a treat with the TaoTronics Dual Wired & Wireless Headphones! Equipped with a CVC 6.0 noise cancelling microphone for crisp, clear phone call quality, the headset allows you to adjust the volume, change the track, and play and pause the music via the on-ear controls. Conveniently fold the earphones in the included case for carrying and storage 1 x TaoTronics TT-BH21 Dual Wireless & Wired Stereo Headphones 1 x USB Charging Cable 1 x 3.5 mm Audio Cable 1 x Carrying Case 1 x User Guide",
    "price": 3999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 100.0,
        "length": 750.0,
        "width": 670.0,
        "height": 310.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41rNfdNuFIL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51QXl-sW0zL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51qQgj06dZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51s3w8ejHLL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51bxiuu3LzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ul7xpAF-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51lNb7Y-7oL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B075NRNZWD",
        "B075QLCNMG",
        "B0746G946P",
        "B0753DJT6G",
        "B07FQRWDS1",
        "B01L160DLW",
        "B075CBHN9M",
        "B06XKT63V1",
        "B075XPNT9S",
        "B06Y27HM9W",
        "B07C77M3HL",
        "B07GB2FT4J",
        "B07F59HQRC",
        "B07D4KP4SP",
        "B07FF8Z9DF",
        "B07GS5NM66",
        "B07GDBR6TZ",
        "B07FD5R74Q",
        "B07C8BBHXG",
        "B07GB179W8",
        "B01G8JO5F2",
        "B07CGMG3V7",
        "B076HPB1HQ",
        "B01IV1H1ME",
        "B0728HFQV9",
        "B019U00D7K",
        "B06WP5DBMQ",
        "B07H4DR364"
    ],
    "rating": null
}