{
    "asin": "B074P2DPLN",
    "title": "Watch Band Replacment for Men Leather Watch Strap 14mm 16mm 18mm 20mm 21mm 22mm 24mm Steel Spring Bar Pin Buckle for Men 11 Color Choose",
    "brand": "DaStrap",
    "feature": [
        "COMFORTABLE AND BEAUTIFUL: It might be a little bit stiff when first taken out of the package. Bend it forth and back for some time or wear it for a few day, it will become quite soft and comfortable to wear. The leather is very nice, classy and stylish. It looks great, the stitching and markings are all very nicely done.",
        "HIGH QUALITY: Be made well with a decent looking embossed skin pattern. The buckle is excellent quality and smoothly polished",
        "SUITABLE BRAND - Leather strap and stainless steel buckle, classic and elegant appearance provides a perfect replacelment to Timex, Casio, Seiko, Tissot, Citizen, U.S. Polo, Stuhrling, and Nautica,Breitling, Breguet, Cartier,Longines, Nomos, Omega,and other standard watches.",
        "OPTIMAL FIT: Guaranteed to fit all men and women or money back; Approximately 8\" total length when not attached to watch; Designed to fit wrists 6.1\" to 7.6\", but watch geometry also impacts fit.",
        "FULL DaSTRAP WARRANTY - If you're not completely satisfied with your purchase of this quality band Within 3 months, simply let us know and you'll be offered a FULL refund or replacement, no questions asked. Enjoy this absolutely RISK FREE purchase today by clicking the yellow 'Add to Cart button' above."
    ],
    "description": "Genuine leather watch band comfortable beautiful watch strap ? Premium cowhide leather is skin-friendly without Allergy concerns. ? Classic Business Casual Design. Combines quality, leading edge fashion. Stylish in Shape & Durable in Use. ? Made from 3 layers and the bottom layer is coated with waterproof meterial. ? Great replacements for the original watch band as a Spare, or as a Gift ? Band Material: Genuine Cowhide Leather ? Band Color: Black / Brown ? Band width: 18mm 20 mm or 22 mm ? Band Length: 75 mm & 125 mm ? Watch Weight: 1.06 oz / 30 g ? Avilable Length: fits 155mm-225mm (6.1\"-8.85\") wrists Watches with standard 20 or 22mm lugs: Fits all 20 or 22mm Timex, Casio, Seiko, Tissot, Citizen, U.S. Polo, Stuhrling, Nautica watches etc. Moto 360 2 (2nd Gen, 46mm 2015); LG G Watch W100, Urbane W150, R W110; Samsung Gear 2 R380, Neo R381, Live R382; Pebble Time/ Pebble Time Steel/ Pebble Classic; Asus ZenWatch WI500Q, ZenWatch 2 WI501Q; For Seiko SKX007; Vostok Amphibian; Cookoo Smart Watch; Fossil Q Founder, Fossil Q Grant; Martian Notifier Smart Watch; Vector Luna, Vector Meridian; Basis Peak Fitness Tracker Watch ? The band might be a little bit stiff when first used. Bend it forth and back for several times or wear it for a few days, it will become quite soft and comfortable to wear. ? Please DO NOT wear this watch band for longtime underwater activities - such as shower, swimming, ect. 1*Watch Strap + 1*Spring Bar Tool + 4pcs Spring Bars",
    "price": 950.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41rUh8TI-PL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41qkqxQdwJL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41yaf00MXKL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41kQKTMa2lL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ZeOqbIzuL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41nWdY9-%2BRL._SR38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "22"
        },
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "6358539011",
            "title": "Watches"
        }
    ],
    "similar": [
        "B074NWJXGQ",
        "B01ASOGBYG",
        "B074P1H9QT",
        "B074NXSV92",
        "B072J13SRM",
        "B01N0BVI3F",
        "B074NR3W9L",
        "B06ZZB5S1L",
        "B074NWXRTR",
        "B06XKB9F9L",
        "B00QBTQGF2",
        "B074P1B9QH",
        "B01N0DFGTL",
        "B07FFLGHXN",
        "B06XHF3XP9",
        "B01IEWZPD2",
        "B077XZVHNM",
        "B06XS1B33R",
        "B075R1MZWK",
        "B07FM6K5SH",
        "B07B5M91V7",
        "B06XCTMS8Q",
        "B078WQCYL2",
        "B075R6Q7FQ",
        "B07CGRMT6W",
        "B01K3SZXFA",
        "B01KD8J89M",
        "B01ID1K0QQ",
        "B073FGBHHC"
    ],
    "rating": null
}