{
    "asin": "B074KDJVS2",
    "title": "Sony Noise Cancelling Headphones WH1000XM2: Over Ear Wireless Bluetooth Headphones with Microphone - Hi Res Audio and Active Sound Cancellation - Foldable On Ear Headphones with Travel Case - Black",
    "brand": "Sony",
    "feature": [
        "DIGITAL NOISE CANCELATION: Industry leading noise canceling eliminates distracting background noises",
        "SMART LISTENING: Quickly detects your activity to automatically adjust the ambient sounds you hear",
        "QUICK ATTENTION MODE: Cover the right ear cup to turn down your music for instant, easy conversation",
        "TOUCH CONTROL: Skip a track, change the volume and take or make calls just by touching a headphone",
        "FAST CHARGING: Enjoy up to 30 hrs of cordless NC and a 10 min quick charge for 70 more mins of play",
        "WIRED OR WIRELESS: Go hands free or plug in the over-ear headset for streaming and noise reduction",
        "VOICE ASSISTANT: Activate your cell phones voice assistant with a simple touch on the right earphone",
        "WHAT’S INCLUDED: Adjustable earphones with mic, portable case, airplane adaptor, cables and manual"
    ],
    "description": "DIGITAL NOISE CANCELLATION Sony’s WH-1000XM2 premium noise-canceling headphones let you completely immerse yourself in your music anytime, anywhere. Bluetooth and NFC technology offer wireless freedom, while industry-leading noise cancellation blocks out background noise. SMART LISTENING Smart Listening by Adaptive Sound Control detects your activities and environment in order to adjust the ambient sound accordingly. Download the Sony | Headphones Connect App for Android/iOS to customize your settings and hear audio optimized for where you are and what you’re doing. TOUCH CONTROL With a swipe of a fingertip on the right ear cup, you can control tracks and volume, use your phone’s voice assistant, and take or make phone calls. Double tap for hands-free calling, and place your hand over the entire cup to instantly lower the volume for conversation. HI-RES AUDIO A 40mm driver pairs with Sony’s DSEE HX software for powerful hi-resolution audio, ensuring you’re hearing music the way it was meant to be heard. S-Master HX technology also enhances the sound and reduces distortion, while LDAC wireless streaming transmits data in a flash. - Industry leading noise cancellation as of August 31, 2017 according to research by Sony Corporation and measured using JEITA compliant guidelines. - Battery life will vary based on your unique setting, environmental conditions and usage. Interoperability and compatibility among Bluetooth devices may vary. - Customized sound requires download of the Sony | Headphones Connect app for iPhone from the App Store or for Android from Google Play. User must link compatible devices in order to control operation. Subject to app terms and conditions. - Headphones are only compatible with High-Resolution audio when wired. - Voice assist function is compatible with an Android smartphone (Google App) or iPhone (Siri). Bluetooth connection is required.",
    "price": 29999.0,
    "listPrice": 34999.0,
    "prime": true,
    "dimensions": {
        "weight": 190.0,
        "length": 730.0,
        "width": 290.0,
        "height": 980.0000000000001
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31jJEdcg%2BFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41WOuuAUzUL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/316qmqGwOdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41wg4442YZL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41tO6YIsr2L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zfi-E9AUL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097479011",
            "title": "Over-Ear Headphones"
        }
    ],
    "similar": [
        "B0746H458L",
        "B0756GB78C",
        "B07DBY9H6X",
        "B07CVFZ43C",
        "B074W5BKPH",
        "B0756CYWWD",
        "B01MUKKSAE",
        "B077WTVMNS",
        "B07889HH5V",
        "B07H41TJT8",
        "B0779DMR4J",
        "B078HPHLPR",
        "B01MUGEYT7",
        "B07G4MNFS1",
        "B07C3CLVC6",
        "B06XX2TJSD",
        "B017KE8N0M",
        "B077YX3JY7",
        "B07C7TSXJV",
        "B01N5UVZBP",
        "B01MSZSL4I",
        "B01LXS5BXS",
        "B075NRNZWD",
        "B078HRHWH2",
        "B078HDXQR2",
        "B07CGMG3V7",
        "B009ZIILLI",
        "B07DBYPZ3R",
        "B019U00D7K",
        "B07BHV59Y6",
        "B07G4YL6BM",
        "B075CBHN9M",
        "B079GPFLT1",
        "B07D4CVTLR",
        "B074KBWVYT",
        "B077WWB8J2",
        "B01L160DLW",
        "B0775YF36R",
        "B07GSVR9PV",
        "B07GJQPZC9"
    ],
    "rating": "4.2"
}