{
    "asin": "B0749QRGJG",
    "title": "Brass Hand Spinner Fidget Spinner EDC Toy Metal Spinning Tops Gyro, Premium Bearing, Ultra Duarable",
    "brand": "Amperer",
    "feature": [
        "Spin Times: 6-9min, Premium Bearing for extremely fast and long spin times. Removerable Buttons: Easy take off caps make cleaning and replacing bearings conveniently. (Besides, if you want to get a fidget spinner which can spin more than 9min, please contact us.)",
        "Material: Brass body. Balance Wheel x 2, Ruby x 4, Sapphire x 12. The balance wheel on each side can move. When you spin the spinner, the fly wheels spin together. Very special and beautiful. Limited edition designed, very worthy of collection.",
        "Helpfully: Great For Anxiety, Focusing, ADHD, Autism, Quitting Bad Habits, Helps Relieve Stress,Staying Awake,also effective for Focus and Deep Thought through the Different Play.",
        "How to Use: Hold spinner in one hand and use the other hand to spin it rapidly using small continuous strikes to keep it spinning indefinitely with practice,spinners can be spun using one hand only using the fingers of one hand to stop and start spinning.",
        "NOTE： Only Mallstar sells this spinner authentically. We haven't authorized others to sell our products and we are not responsible for anything from any buyer who may purchase elsewhere."
    ],
    "description": "NOTE： Only Mallstar sells this spinner authentically. We haven't authorized others to sell our products and we are not responsible for anything from any buyer who may purchase elsewhere. - This is a new type of decompression toys, the use of several fingers to grasp and toggle can be in the fingertips rotating small toys. - It is perfect products for people focusing, ADHD, autism, quitting bad habits, staying awake and so on. - Do not underestimate it is simply a rotation, when you line up waiting for a car, or on weekdays leisure, you can let it spin up, I promise it will be your good friend. -Hold spinner in one hand and use the other hand to spin it rapidly using small continuous strikes to keep it spinning indefinitely with practice,spinners can be spun using one hand only using the fingers of one hand to stop and start spinning.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 21.875,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51TneximpdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51EhaIEzhKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tshrsxmWL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Kp2ceo%2B5L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Qw4PFP7sL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51SbadY4vAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61LKp5-eOJL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Brass 1 6+min"
        }
    ],
    "categories": [
        {
            "node": "165793011",
            "title": "Toys & Games"
        },
        {
            "node": "166027011",
            "title": "Novelty & Gag Toys"
        },
        {
            "node": "17238448011",
            "title": "Fidget Toys"
        },
        {
            "node": "17238450011",
            "title": "Fidget Spinners"
        }
    ],
    "similar": [
        "B071NV4HXL",
        "B072LPF9XH",
        "B071DKYYQ5",
        "B071Y9Z6NY",
        "B06ZYNF5NB",
        "B078TC4H1X",
        "B075FPS48P",
        "B06XHN299X",
        "B0727NPYCL",
        "B0716S8TD7",
        "B07113TLG5",
        "B072J7MV6V",
        "B071NRSHMN",
        "B06WVN6Y5W",
        "B06ZY74HZS",
        "B0745GW8ZT",
        "B074J6KPWD",
        "B076VP5WGS",
        "B0774RJFC6",
        "B072VGX5Q1",
        "B071ND8FR5",
        "B079P83D38",
        "B06XSDYH8Q",
        "B071SBH381",
        "B0794X3ZXP",
        "B075F1QH4G",
        "B0734K4XTX",
        "B0713PGQQJ",
        "B075FTLRRN",
        "B071WKVLGY",
        "B071Z68LGL",
        "B0779KYCVC",
        "B07B6PPD9C"
    ],
    "rating": "4.3"
}