{
    "asin": "B0749KFLSR",
    "title": "Samsung Galaxy S8 Case, Luxury Leather Plating Coated Frame Slim Cover Cell Phone Case for Samsung S8 (5.8 inch) - Pink",
    "brand": "Gitech",
    "feature": [
        "Superb craftsmanship, perfect match your mobile phone, you can freely control all the keys of the mobile phone, enjoy all functions.",
        "The case which support wireless charging, you can charging your mobile phone without take off the cover case.",
        "For men, the influx of people's style and glittering lines, make you more attractive and tasteful, you are unique.",
        "For women, beautiful appearance, whether it is gathering or shopping, you are the focus of all people, enjoy the fashion.",
        "Today, you will be eye-catching! The luxury skin texture combined with heavy metal line design, the fusion of urban colorful, smooth curve texture, to achieve the artist's pursuit of visual effect."
    ],
    "description": "Samsung Galaxy S8 case The design inspired by urban life, colorful colors, fashion style of influx of people, and bold fashion style and streamlined design and urban street complement each other, highlighting the unique personality of the concept. Combining silicone and fabric, exquisite fabric texture technology, optimized design allows you to effectively hold the phone, help you complete challenging sports, achieve excellent comfort. The line/volume buttons at each angle are seamlessly adjusted to fit the body lines, resulting in excellent comfort and control. Let you do whatever you want and stay productive throughout the day. Change the traditional charging way, the case support wireless charging and you can charging your mobile phone without taking off the case Our mobile phone shell is designed by the French visual masters and costume masters, smooth curves, so that the mobile phone shell is no longer common. Luxury skin texture combined with heavy metal lines design, stylish and beautiful appearance, in any place, heavy metal design, under the irradiation of sunlight and light, will There will be glittering effects. TPU, Plastic, 5.8inch Hot Pink 5.1*0.39*2.3 inch 0.2lb 0.2mm 1 * Brand New Case",
    "price": 1399.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 550.0,
        "width": 250.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51teLHWkthL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tnKrmAQTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512cqrWdC4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517UVE7QuOL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CgnAE4f7L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51hUkBgJIhL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51U9F7uSsRL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B07FDT68RY",
        "B075DF9VLH",
        "B06XP5YQNQ",
        "B075CVT5DN",
        "B06XP51T59",
        "B06XP6KZKC",
        "B06Y44F4SX",
        "B07B65QPYL",
        "B075CX4PLC",
        "B0781JT3SN",
        "B0749DZWY2",
        "B0768H3QF5",
        "B07415QFNM",
        "B07GKK1M2S",
        "B06XNNJ4KM",
        "B07GNDMCPS",
        "B0768FWKDC",
        "B074167P98",
        "B06Y65BJDS",
        "B078NC6Y3J",
        "B07BH2BFLD",
        "B07794PFJ7",
        "B073JTW4R2",
        "B07B3VR47J",
        "B07DDKQ232",
        "B077PXVK22",
        "B07FR39F6M",
        "B0727V2V7X",
        "B06XHT4P9M",
        "B072XD1C9T",
        "B06XXM99VD",
        "B0748BKTC9",
        "B0749C4KQD"
    ],
    "rating": "4.0"
}