{
    "asin": "B0744BP6MZ",
    "title": null,
    "brand": "Bekith",
    "feature": [
        "Our stainless steel is rust-free, top-notch, food-grade silicone is completely BPA-free, easy to clean, you can feel healthy and confident using our infuser.",
        "Truly fine mesh helps you to filter all types of tea, including super fine tea that get through other tea balls or tea diffusers.",
        "The silicone handle protects you from heating up and burning your fingers because of the hot water, Additionally it flexes lightly making manipulating in your cup very easy, floats in the cup.",
        "Our stainless steel is rust-free, top-notch, food-grade silicone is completely BPA-free, easy to clean, you can feel healthy and confident using our infuser.",
        "Truly fine mesh helps you to filter all types of tea, including super fine tea that get through other tea balls or tea diffusers.",
        "The silicone handle protects you from heating up and burning your fingers because of the hot water, Additionally it flexes lightly making manipulating in your cup very easy, floats in the cup.",
        "Holes allow the water to move through the tea leaves but keep most of them in the steel ball and out of your cup so you don't have too many leaves in the bottom of your cup.",
        "Suitable for all kinds of loose tea including fine to large tea leaves, includes a little BPA- and phthalate-free drip tray to set the infuser, so you can enjoy your tea time anywhere. Perfect for working or travelling."
    ],
    "description": "4-Pack Fine Mesh Silicone Tea Infuser - Perfect Tea Strainers for All Types of Loose Leaf Tea 1.Safe to use: FDA-approved, pure food-grade silicone and stainless steel 2.Steel ball's holes design redu ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 700.0,
        "width": 690.0,
        "height": 110.00000000000001
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B07C6ZJGXW",
        "B07C5G32YK",
        "B01MRZLHAE",
        "B0159JONG8",
        "B07F21D598",
        "B00ECOOV1O"
    ],
    "rating": null
}