{
    "asin": "B0742DD36K",
    "title": "Roav by Anker Dash Cam C2, FHD 1080P, 3\" LCD, 4-Lane Wide-Angle View Lens, G-Sensor, WDR, Loop Recording, Night Mode, 2-Port Charger, No Wi-Fi or App",
    "brand": "ROAV",
    "feature": [
        "TOTAL NIGHT-VISION: NightHawk technology and WDR (Wide Dynamic Range) video system deliver completely balanced images and footage. Clearly capture license plates—day or night.",
        "RICH, CLEAR VIDEO: Advanced Sony Exmor IMX323 sensor and Ambarella A12 chipset combine to capture every drive in brilliant, 1080p detail.",
        "SEE THE WHOLE ROAD: Equipped with an f2.0 wide-angle aperture lens, comprised of 5 lens elements, to capture 4 lanes of traffic and record more than just the car in front.",
        "EXTREME TEMPERATURE RESISTANCE: Designed with a steel frame to disperse heat away from internal circuits.When plugged in: Operates in -4℉-158℉. Using battery power (for the parking monitor): Operates in 32℉-158℉.SEAMLESS SET-UP: 2 installation methods—a suction cup and a 3M adhesive sticker—allow you to perfectly position DashCam on any windshield.",
        "WHAT YOU GET: Roav DashCam C2, Trim Removal Tool, 2-Port USB Car Charger, Suction and 3M Sticker Mounts, User Manual, Happy Card, our 12-month product replacement warranty and friendly customer service.Note: Operation requires a microSD card (not included). 32GB Samsung or SanDisk class 10 SD card recommended."
    ],
    "description": "DashCam C2 Capture The Unexpected From Roav — Making the smart driving experience accessible to all A collection of connected devices that increases your driving experience Created by the same team as Anker—renowned for exceptional quality and innovation Crystal-Clear Definition An advanced Sony Exmor IMX323 sensor and Ambarella A12 chipset with NightHawk Vision technology combine to capture every drive in brilliant 1080p, anytime of day or night. Panoramic Views Record more than just the car ahead of you. Comprised of 5 lens elements, DashCam's wide-angle lens captures 4 lanes of traffic to provide footage of the whole road. Ideal for Any Climate A durable steel frame disperses heat away from internal circuits to ensure incredible temperature performance from a chilling -4℉ to a blistering 158℉. Records While You're Away When your car is parked, DashCam's gravity sensor detects sudden movements, such as a car bumping into your car, and automatically turns on to record activity. Worry-Free Warranty At Roav we have total confidence in our products. That's why we back them with a 12-month warranty. We're the only brand in the industry that will replace any defective product with a replacement in the whole 12 months, no questions asked.",
    "price": null,
    "listPrice": 11999.0,
    "prime": true,
    "dimensions": {
        "weight": 131.0,
        "length": 590.0,
        "width": 60.0,
        "height": 280.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41QmrBxuU7L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kfKb-sJoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51U%2BPDufJoL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61FEbp6BrsL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61iVPH0MlYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51g%2BRn47QAL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "3248684011",
            "title": "Car & Vehicle Electronics"
        },
        {
            "node": "1077068",
            "title": "Car Electronics"
        },
        {
            "node": "10980521",
            "title": "Car Video"
        },
        {
            "node": "3248689011",
            "title": "On-Dash Cameras"
        }
    ],
    "similar": [
        "B07DF8MQX1",
        "B07DVJ5DB9",
        "B01CEAYWZW",
        "B076VVFVLZ",
        "B0102CK1BS",
        "B00V5Q1K3O",
        "B06XX29S9Q",
        "B06XR9KGFD",
        "B015DX4N9W",
        "B07DJB4HXZ",
        "B073WFJ7HV",
        "B06XNSDRW8",
        "B075QBPJ96",
        "B0716G7DVQ",
        "B0771DYFTZ",
        "B07C7Y54Y7",
        "B079WL4LQD",
        "B07BYBS57X",
        "B076QKVQBY",
        "B07DCBS6CV",
        "B074X2MBMD",
        "B01HC6V82I",
        "B06XWN9Q99",
        "B07C78MF6X",
        "B072FGL63X",
        "B07F7TJK9C",
        "B01HD6PIDC",
        "B01C89GCHU",
        "B07GB3GV2L",
        "B01N34SBQS",
        "B07FBRJN71",
        "B07BFP5RHL",
        "B076GYGVY5",
        "B075WR74LC",
        "B079R8H8XJ",
        "B06XWZWYVP",
        "B072FVX74Q"
    ],
    "rating": "4.3"
}