{
    "asin": "B075Q67XF5",
    "title": "Condenser Microphone NASUM Portable Mini Recording Microphone with 3.5mm Plug &Play Home Studio Microphones for Online Chatting,Cellphone,Tablets,Laptops,YouTube,PC",
    "brand": "NASUM",
    "feature": [
        "♫ Plug & Play - No Need Addtional driver.If your laptop's microphone plug and headphone plug are the same one(One single 3.5mm jack), you need to plug a Y splitter cable adapter which included in the package to collect and monitor your voice.Same usage on cellphone.Great for Skype, Recordings for YouTube, Google Voice Search,Messenger and Gameswork and PC(Windows and Mac) .Capture rich, full-bodied sound from sources that are directly in front of the mic.",
        "♫ Dual Layer Filter - Tabletop microphone mount comes with professional dual-layer acoustic filter to prevent from popping and improve vocal recording quality; adjustable distance between the mic and the filter.",
        "♫ Folding Tripod Stand - Ultra-compact design for maximum portability, you can fix the microphone on the desk with the mini flexible head which is 270 degree rotatable.",
        "♫ Perfect for Vocals - Specializing in singing and speech, the condenser microphone with a sample rate of 16bit / 32kHz and a balanced renal characteristic, enables vocal recordings in the best sound quality and monitor your microphone output & stereo without audible delay.Fit for musical instruments, broadcasting, podcasting, interviews, voice recording, video conference, singing over Internet, online chatting such as Facebook, MSN, Skype,YY.",
        "♫ Note - The effect is better to monitor your voice after finish recording.If you want to hear your voice while recording ,you need to open the voice monitor(earphone monitor) of microphone on your computer .For IPhone, just plug in and come with monitor function itself. For other cellphones which don’t support earphone monitor,you need to realize this function by singing software which has the earphone monitor.Not suggest open the speaker while recording because it will affect recording effect."
    ],
    "description": "Best suited singing, podcasting, Let's Plays, online tutorials, live performance, home studio recording - vocals, home studio recording - guitar, voiceover use. Plug and Play & No Need Power NASUM 3.5mm Plug desktop Microphone makes recording vocals or instruments to your computer a plug-and-play operation No need the outside power input . It is Windows and phone compatible, with no software to install, simply plug it into any available 3.5mm port, select it as your input in your software settings, and you're ready to create your own audio Microphone: condenser Frequency Response: 20Hz - 20kHz Sample Rate: 32kHz Bit Rate: 16bit Microphone adjustable stand Anti-spray sponge 3.5 MM cable User Manual",
    "price": 1998.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 86.25,
        "length": 1019.9999999999999,
        "width": 430.0,
        "height": 280.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41lEquPlw1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ULW2nJekL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41iIBzPumaL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "11091801",
            "title": "Musical Instruments"
        },
        {
            "node": "11974521",
            "title": "Microphones & Accessories"
        },
        {
            "node": "8882489011",
            "title": "Microphones"
        },
        {
            "node": "11974631",
            "title": "Condenser Microphones"
        },
        {
            "node": "11974641",
            "title": "Instrument"
        }
    ],
    "similar": [
        "B01KHMUQ2M",
        "B079HRFH2Y",
        "B06XCKGLTP",
        "B07DPQJQ2L",
        "B077N84S6Q",
        "B0774TNWZR",
        "B078W69PRJ",
        "B07CYCK39B",
        "B01EVKUHI4",
        "B001R747SG",
        "B01LEEWO7C",
        "B073QP48RV",
        "B076F5W8Q5",
        "B07423Y7Z4",
        "B014PYGTUQ",
        "B074DWRY1T",
        "B07DB7RYSZ",
        "B01N6ZJH96",
        "B016C4ZG74",
        "B018ICYNKY",
        "B07BHLGK87",
        "B07C12RXKB",
        "B0732N9T2T",
        "B07BS4L3KQ",
        "B000CZ0R42",
        "B01AG56HYQ",
        "B07475STS5",
        "B07B926HM7",
        "B076VV3M7K",
        "B07324Z78V"
    ],
    "rating": "3.5"
}