{
    "asin": "B075749KHR",
    "title": "Skullcandy Hesh 3 Bluetooth Wireless Over-Ear Headphones with Microphone, Rapid Charge 22-Hour Battery, Foldable, Memory Foam Ear Cushions for Comfortable All-Day Fit, Black (S6HTW-K033)",
    "brand": "Skullcandy",
    "feature": [
        "ALL-DAY LISTENING: Keep your soundtrack going with up to 22 hours of rechargeable battery. Just 10 minutes of charging offers 4 hours of play time, thanks to Rapid Charge technology, with a full battery reacharge in just 1 hour.",
        "ALL-DAY COMFORT: The pivoting armatures adjust for a perfect fit, while lightweight design and memory foam ear cushions allow for comfortable all day listening. It also allows them to lay flat on a table or around the neck when not in use.",
        "PREMIUM SOUND: For big sound no matter what you listen to, an integrated analog amplifier pushes a pair of high-quality 40mm audio drivers that give your music the rich, dynamic sound it deserves.",
        "EASY TO USE: Voice notifications assist in pairing your device. Take calls, change tracks, and adjust volume with the built-in controls and microphone.",
        "BACK-UP AUX CABLE: If you've transcended the need to sleep and your 22-hour battery needs charging or you have a device that requires a corded connection, just plug in the included AUX cord with microphone and remote and never miss a beat."
    ],
    "description": "With up to 22 hours of battery life and rapid charge technology, Hesh 3 wireless is designed to keep you listening all day long. A foldable design, high-end audio drivers, and quality materials make them the perfect over-ear headphone for any occasion. They are wireless perfection.",
    "price": 7898.999999999999,
    "listPrice": 12999.0,
    "prime": true,
    "dimensions": {
        "weight": 93.125,
        "length": 170.0,
        "width": 730.0,
        "height": 780.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31QYbIAAZBL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41481StS5hL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Ylv-Ix0dL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        },
        {
            "name": "Color:",
            "value": "One Size"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097478011",
            "title": "Earbud Headphones"
        }
    ],
    "similar": [
        "B00JFHDJTI",
        "B07DZS669D",
        "B07GF8LZ5K",
        "B01MSZSJE9",
        "B01JC4T4VK",
        "B013J7JM4K",
        "B07CVGVK4S",
        "B00NCSIN4W",
        "B07C855JBY",
        "B07D4GXQTM",
        "B00OES2XM2",
        "B07GB2FT4J",
        "B076RDTFTF",
        "B077KR12LQ",
        "B01DWH77GC",
        "B07CH2KHGH",
        "B07CVHCRS3",
        "B07DDJPXPX",
        "B00E1CSEMO",
        "B07C6CC7TJ",
        "B07572WDGL",
        "B01L160DLW",
        "B0756VVVF5",
        "B07G4222WX",
        "B07C77M3HL",
        "B07FN9154F",
        "B07GNWN26F",
        "B076HPB1HQ",
        "B01DWH7AIM",
        "B07GN6CJ5W",
        "B07GDBR6TZ",
        "B07C7TXQ5C",
        "B076X1VYF2",
        "B019U00D7K",
        "B0756Z1XK7"
    ],
    "rating": "3.7"
}