{
    "asin": "B075B6QN2N",
    "title": "Upper Arm Exerciser, Strengthens Brawn Training Device Forearm Wrist Force Fitness Equipment with 3 Resistance Bands,Neat and Portable Arms Workout Machine White",
    "brand": "J.Ehonace",
    "feature": [
        "EASY TO USE--- Get the firm, fabulous arms at home - you've always wanted in just minutes a day",
        "BUILD UP MUSCLES --- This fun little workout tool will strengthen all muscle groups in your arms, perfect fitness equipment works for your biceps, triceps, shoulders and even your chest all at one time",
        "DIFFERENT WEIGHT BANDS --- Three interchangeable colored resistance exercise bands in different power levels, perfect for all fitness levels and age groups",
        "FOLDING and COMPACT DESIGN-- Conveniently sized for easy storing at home and office or travelling to anyplace to achieve continuous exercise",
        "REPLACE GYM --- Good for people that doesn’t exercise often Yet want to keep fit"
    ],
    "description": "Features: Healthy lifestyle:The new useful fitness workouts for Arms, Legs and Back, and can do seated Exercises.Helps you get rid of that flabby problem area under your arms. Improves Stretching and Flexibility. Less strain on joints:Minimize damage to joints because of evenly force .You'll instantly feel your muscles toning and tightening as you burn calories without joint strain. Multi-effect function:3 interchangeable colored resistance bands in different power levels.They can be used by single or in combination. Use whatever you want! Total arm workout system:JEHon arm machine unique dynamic resistance movement works your arms,shoulders and back all at the same time.Especially on the triceps/biceps/chest/shoulders/back exercise effect is significant. Easy to carry:Folding design. Whether traveling or business trip JEHon arm machine helps you achieve continuous exercise. Specifications: Weight:560g Packing Size:8.7 x 3.9 x 10.2 inch Color:As the picture show Applicable to: Female/Male Choose by fitness effect: overall weight loss / body sculpting / body Package Included:1 arm machine and 3 interchangeable colored resistance bands Notes: This product is not a toy,even though it is safe enough,please keep away from children under 3 years old to avoid injury. Start exercising slowly. Begin with the lightest resistance band and move slowly towards higher resistance levels. 30 Days quality guaranteed Please email us and we will make the situation right. If you get occasional defective item, damaged package with missing parts or you have doubt of the order.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 130.0,
        "length": 1200.0,
        "width": 1200.0,
        "height": 1200.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51owo18vNtL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3375251",
            "title": "Sports & Outdoors"
        },
        {
            "node": "10971181011",
            "title": "Sports & Fitness"
        },
        {
            "node": "3407731",
            "title": "Exercise & Fitness"
        },
        {
            "node": "3408271",
            "title": "Strength Training Equipment"
        },
        {
            "node": "14333021",
            "title": "Hand Strengtheners"
        }
    ],
    "similar": [
        "B07FQLG33K",
        "B01MSQFMUP",
        "B0734Y24PT",
        "B01E8J57SI",
        "B07BTBV3L6",
        "B076CCV728",
        "B00M7477R6",
        "B07DB66JJ5",
        "B07CZZDWFW",
        "B074HDL6H9",
        "B078YF62MZ",
        "B078WRP47C",
        "B01LR5RO5U",
        "B002YRB35I",
        "B071CF1HCD",
        "B07D3C4DH7",
        "B01JIYBD68",
        "B076LVVB1C",
        "B074WRBSKY",
        "B07FQB7D8V",
        "B01E8J56UC",
        "B07CXKLRSN",
        "B078JNPPMT",
        "B074JL7NG7",
        "B074DZ5YL9",
        "B079NTYN6Q",
        "B0762FFNQ4",
        "B01IQKB7E8"
    ],
    "rating": "2.6"
}