{
    "asin": "B075SJ9ZWB",
    "title": "iPhone 8 Plus/7 Plus Battery Case 7200mAh, MAXBEAR Rechargeable External Battery Portable Power Charger Protective Charging Case for Apple iPhone 7 Puls/8 Plus (5.5 Inch)-Black",
    "brand": "MAXBEAR",
    "feature": [
        "Slim and Powerful Design: More than double your iPhone's battery life without doubling its size , The 7200mAh battery case provides an extra 60+ hours audio, 24 hours 3G talktime, 15 hours video, 12 hours web browsing or 3 hours 3D gaming to your iPhone 8 Plus/7 Plus.",
        "High quality battery case 7200mAh iphone 8 Plus/7 Plus battery cases with 360°scratch-guard makes sure that your phone will be protected from drops and impacts. The batteries use Grade A+ batteries with CE and RoHS certification. Internal chips also protect your smart phone from overheating, short-circuiting, over charging, and discharging.",
        "Enhanced iPhone 8 Plus/7 Plus battery case offering your iPhone great protection and secure grip featured with 1.2mm raised front lips to protect your iPhone 8 Plus/7 Plus from scratches, bumps, drops and more.[Note: only provide edge protection, could not protect the screen of your iPhone.]",
        "Not compatible with Apple stock, wireless charging or traditional 3.5mm headphones. ONLY compatible with Apple Airpod Bluetooth headphones or any other wirelessly connected headphone accessories.Built-in magnetic metal, this case could work well with magnetic car mount directly when driving(Car Mount Not Included)",
        "365 Day Worry-free guarantee. If you are not satisfied with our battery case, let us know and you will be offered a full refund or replacement. Enjoy this absolutely RISK FREE purchase by clicking the yellow Add to Cart button."
    ],
    "description": "【For iPhone 7 Plus / 8 Plus user】Not compatible with Apple stock, wireless charging or traditional 3.5mm headphones. ONLY compatible with Apple Airpod Bluetooth headphones or any other wirelessly connected headphone accessories. This case more than doubles your iPhone's battery life without doubling its size. Use original lightning cable to charge your iPhone 7/8 Plus at first, then transfer to charge the battery case automatically. MAXBEAR iPhone 7 Plus/ 8 Plus battery case offering your iPhone great protection and secure grip featured with 1.2mm raised front lips to protect your iPhone 7 Plus/ 8 Plus from scratches, bumps, drops and more. Integrated standby switch allows you to choose when to charge or when to save some power in case of need. 4 level indicator that lets you know exactly how much power you have (25%-50%-75%-100%). 1. Please make sure the battery case is well installed, check the power remain for the first use, Press on-off buttom 3 seconds to charge/stop, 1 second to show the remaining power. 2. Using lightning cable to charge & sync your iPhone 7Plus and iPhone 8Plus, no need to remove iPhone 7+ and 8+ battery case. 3. When you slide your phone into the extended rechargeable battery pack, open the top soft edge of battery case, then push the phone in. 4. Charging: Press the ON/OFF button backside for 3 seconds to turn the battery case ON or OFF. 1 x iPhone 7 Plus/8 Plus Battery Case 1 x User Manual Note: Not include Cable",
    "price": 2680.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 51.24999999999999,
        "length": 640.0,
        "width": 60.0,
        "height": 330.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/416R5sFYJ9L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nArx-%2BReL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/414AHhHOuXL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fKp5aI0mL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gR7DuNpRL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41onNTUEJ%2BL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Buv%2B1GAOL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "7073958011",
            "title": "Battery Charger Cases"
        }
    ],
    "similar": [
        "B07B2TJSHG",
        "B07DK8XNQ3",
        "B07DCJRYBP",
        "B07DQMF2JP",
        "B07DWVW6TL",
        "B076VYNSNT",
        "B07FXWMB3H",
        "B01G7O61W8",
        "B078WTB62R",
        "B071XW5NH4",
        "B07CQZ8Z7N",
        "B07CYT5TJQ",
        "B0718ZMY3C",
        "B018Q36HCM",
        "B01F9RGJJO",
        "B01HQWR8CM",
        "B0757GCBC5",
        "B075SJ5TBQ",
        "B01LP96OA4",
        "B07CNXMBQW",
        "B0768YKXSN",
        "B01MY4FB9J",
        "B07CWL4LGV",
        "B075JNWCYW",
        "B01KL1AIDG",
        "B07F3WVQWF",
        "B01LXZDPDR",
        "B075PWD313",
        "B07CL3LC6T",
        "B075SJKC2L",
        "B072538SCL",
        "B0786ZNT4H",
        "B07CVW7PRD",
        "B07FB25R58",
        "B0797LTQ3D",
        "B073W7P8D8"
    ],
    "rating": "3.3"
}