{
    "asin": "B0753ZRC25",
    "title": "Squishy Cat Mini Squishies Squeeze Toy Soft Stretchy Fidget Kawaii Animal Squishys Squeeze Mochi, Vent Hand Toy, Decompression Educational Stress Relieve Ball (4 Pcs)",
    "brand": "K.SHOP",
    "feature": [
        "PACKAGE INCLUDED: Four Squishy Kitties different color ( White Cat, Great Cat, White with pink years and White with orange spots)",
        "SMALL COOL SQUISHY- Famous for squishy cat phone case, these squishy pets are soft and cute. You will not stop pinching them because of their great touch feeling and full squeeze-ability",
        "THERAPEUTIC EFFECTS - suitable for children over 5 years old and adults. Also great for people who spend long periods on the phone. And perfect for adults at the office or in front of the computer",
        "PRACTICAL & FUN: These are perfect fidgeting pieces for people wanting something small simple discrete and fun-also effective for focus stress relief and deep thought",
        "BEST & CHEAP: Squishis help to relieve stress, anxiety and kill boredom. Small enough to carry in your pocket anywhere"
    ],
    "description": "Material:Silicone, TPRSize: 0.7-2.3 inWeight: 0.5-0.8 oz It is normal that at beginning there is slight scent This toy is afraid of high temperature and strong sunlight Working life: depends on toy usege frequency EASY TO CLEAN - use a little soap to wash it for a few minutes and dirt wash off. this toy is not edible. Please do not put into your mouth. Not suitable for children under 5 years old. If over-squeezed, the paint on mochi seal may come off. We all experience some form of frustrations, nervousness, boredom or deep thought moments in our daily lives. We just like to keep our hands occupied to relief stress letting the mind zone out and run smooth. We believe a wandering mind may be important to setting goals making discoveries and living a balanced life. Our Squishy is COMPACT, SIMPLE and FUN to play with everywhere.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 23.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/5118FtUNwQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Wo1NyTQ8L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mip4es1nL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31tz%2BpeC8DL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Q7ALq2arL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "165793011",
            "title": "Toys & Games"
        },
        {
            "node": "166027011",
            "title": "Novelty & Gag Toys"
        },
        {
            "node": "166040011",
            "title": "Miniatures"
        }
    ],
    "similar": [
        "B072N3BTZ9",
        "B074629MMM",
        "B0771RSLQQ",
        "B06XBJ9K7Z",
        "B01KKX6SWA",
        "B0716QDZ59",
        "B074M458C5",
        "B077DN22VR",
        "B076SZWLTG",
        "B01M0XFGMH",
        "B075864NJR",
        "B01CLQRZNK",
        "B07DC274W2",
        "B076JGDSB6",
        "B077PMYGKP",
        "B075YT2RQ3",
        "B0792VKWVC",
        "B01MS3RHUR",
        "B00HPA04LS",
        "B07D4BKCD1"
    ],
    "rating": "2.3"
}