{
    "asin": "B07568YD2T",
    "title": "Chocolate Silicon Molds Cake Decorating - Set Of 5 Chocolate Molds - Best For Cake Decorations, Chocolate Candy Molds, Silicone Mold, Hard Candy Molds, Jello Shot Molds",
    "brand": "Devbor",
    "feature": [
        "✅ WHAT YOU WILL GET: 5 pack of brown silicone molds, 2 large molds- 9.1”L *5.5”W inch, 3 Meduim molds- 8.3”L*4.1”W inch",
        "✅ MATERIAL: 100% food-grade silicone gel, BPA Free, FDA approved durable, flexible silicone candy mold, easy to clean",
        "✅ MUTI-PURPOSE: these silicone molds are fantastic for making Chocolates, crayons, candles, hard candy, fondant, Jell-O, frozen yogurt treats, ice cubes with fruit juice, cake decorations, party favors for birthdays & baby showers, and so much more!",
        "✅ DURABLE: molded contents easily come off with a slight push and the silicone mold will not break or crack. Designed to have a wide temperature range of -40 to 445F (0-230C) so it is safe to use in microwave, dishwasher, freezer, refrigerator and oven",
        "✅ ATTENTION: YOU ARE 100% COVERED - We will return your money with no questions asked if you decide to return our chocolate candy molds"
    ],
    "description": "Are you looking for silicone candy molds for your next party or event? Then you will want Devbor 5 pcs silicone mold set. Perfect for Festival, birthday,party and other event & occasions, or even if you just want your kids to have delectable desserts that look awesome at the same time. This mold set consists of various designs that you and your kids will surely love. This mold set works great with chocolate melts, is . These dessert and toy molds are safe to kids. Each tray has a unique design so the kids won’t get tired of making various creations. These candy trays can also be used for creating popsicles, frozen goods, clay, play doh and even for making soaps and candles. It’s never too late to start being creative. Try out these dessert and toy molds and bring out your artistic side. You’ll be amazed by the numerous possible desserts and trinkets that you can make. This is an exclusive deal for getting a wide variety of cute shapes in an 5 pack set. We are bringing this special deal to you because we are factory direct and can pass the savings on to you! Color: Brown Temperature Range: -40 to 445F (-40-230C) 5 silicone molds (2 large size + 3 medium size) 2 large molds- 9.1”L *5.5”W inch, 3 Meduim molds- 8.3”L*4.1”W inch",
    "price": 1099.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 85.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/515KV4s1F3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51v9FJFVKGL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51tUjdEJMzL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sNc6pqqrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51buOsFRNsL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "1055398",
            "title": "Home & Kitchen"
        },
        {
            "node": "284507",
            "title": "Kitchen & Dining"
        },
        {
            "node": "289668",
            "title": "Bakeware"
        },
        {
            "node": "2231404011",
            "title": "Candy Making Supplies"
        },
        {
            "node": "2231405011",
            "title": "Candy Making Molds"
        }
    ],
    "similar": [
        "B07843HKXK",
        "B01N4M6MGG",
        "B014VGMLCI",
        "B01N9D9WMQ",
        "B077G51RXD",
        "B01N6A6E12",
        "B01DUS67X2",
        "B07G84Q55Z",
        "B0798HX8KR",
        "B07DQPNZ3K",
        "B078NJRJ7T",
        "B0778B8TRB",
        "B07FTGC348",
        "B01N0RQ2RG",
        "B079CFX3RM",
        "B003RB4JNI",
        "B01GYJXPTS",
        "B00P25U7UQ",
        "B018P028EW",
        "B074Z64LQL",
        "B0772PSBL1",
        "B014GNGTBK",
        "B07932SM43",
        "B078H9X2R6",
        "B00MYXCVUI",
        "B01AFTSJLC",
        "B06XQZ12NH",
        "B004M6H6PU",
        "B07GSTDPQC"
    ],
    "rating": "4.3"
}