{
    "asin": "B075FTLQZ3",
    "title": "Posture Corrector for Women Men Kids Teens Posture Support Brace Shoulder Back Support Clavicle Brace Adjustable Figure 8 Training Muscles Spine Improve Posture Upper Back Pain Relief",
    "brand": "Depps",
    "feature": [
        "IMPROVE POSTURE- Depp’s posture brace works by training your muscles and spine to return to their natural alignment, reduce back pain cause by bad posture.",
        "POWERFUL BRACE- Figure 8 integrated design, light and provide huge pulling back strength for shoulders. Velcro allows proper adjustment from 28-48''",
        "COMFORTABLE MATERIAL- Made of high quality extra soft and breathable neoprene, designed in such a way that you can wear it all day.",
        "EASY TO PUT ON- No help from others required to put on or take off, simply pull the straps to be tightened and lift the buckle up to relax the straps.",
        "LIFETIME GUARANTEE - Your experience with the products is our pursuit. Have no worries, MONEY BACK GUARANTEED if you are not satisfied."
    ],
    "description": "✔️To keep bones and muscles aligned properly. ✔️To reduce mental and physical fatigue and stress. ✔️To prevent backache. ✔️To build up self-confidence. ✔️To own a good habit with sitting, standing or walking. do a great job by helping you pull your shoulders to a more natural position and straighten your back in a scientific way. ✅Comfortable to wear under or over clothes! ✅Perfect for those who spend long hours at the office! ✅Aligns your spine and shoulders upon first wearing it! ✅Soft enough to be used on a daily basis, without cutting the armpits! ✅Easy put on by yourself, dual strap design! ✅Strong yet elastic made from premium quality materials! 👪WE GOT ALL FAMILLY COVERED👪Material: soft and breathable neoprene Chest Circumference: 28–48 inches Color: black Weight: 0.22lb / 100g Package size: 7 x 4.7 x 2.3 inches / 18 x 12 x 6 cm ⚡Add to Cart now to train good posture & be more confident today. ⚡",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 21.875,
        "length": 100.0,
        "width": 100.0,
        "height": 470.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/411q%2Bbo-R3L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ndeyakMQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51S86gxsgnL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "REG(28-38'')"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3775161",
            "title": "Medical Supplies & Equipment"
        },
        {
            "node": "3775541",
            "title": "Braces, Splints & Supports"
        },
        {
            "node": "8619205011",
            "title": "Back, Neck & Shoulder Supports"
        },
        {
            "node": "4986874011",
            "title": "Shoulder Supports"
        }
    ],
    "similar": [
        "B07DXC1XCG",
        "B078H1XTYG",
        "B072LQGWBD",
        "B00267SFKC",
        "B07F9MQLCF",
        "B07CKNGBW4",
        "B074Z67V1R",
        "B07BSCLNVC",
        "B07F9SMZ99",
        "B07C2J65ZH",
        "B07BVX88SN",
        "B07FKR8B7B",
        "B00IJC8A80",
        "B073PTS6XD",
        "B078PJS188",
        "B07D779Q8M",
        "B07FFNXWC5",
        "B07BX7K7QL",
        "B07C245Q6N",
        "B07DQLDVKX",
        "B01GEXE74Q",
        "B07C6JC2PV",
        "B07FJY788M",
        "B00HGECTTS",
        "B00CQLV1S6",
        "B07DS5FMFL",
        "B00CMV3BEM"
    ],
    "rating": "3.4"
}