{
    "asin": "B075TJG1LJ",
    "title": "Galaxy Note 8 Case, Wellerly 3 in 1 Ultra Slim Hard PC Premium Case Hybrid Anti Fingerprint Scratches Soft Grip 360 Degree Full Body Protection Cover for Samsung Galaxy Note 8 (Black+Sliver)",
    "brand": "Wellerly",
    "feature": [
        "[ Compatible with Galaxy Note 8 ONLY ]: This case has a variety of colors for you to choose, you can cover up your original mobile phone color, and choose a color you like, let your mobile phone whole body transformation, give you a new look and a new feeling.",
        "[ 3 in 1 Design ]: This Galaxy Note 8 case is made up 3 parts, with perfect solid stitching design, to provide your Galaxy Note 8 360 full protection. Protects your Galaxy Note 8 from shock, drops and scratches. Please Note: Screen Protector not included in this case.",
        "[ Perfectly Fit and Excellent Feel ]: Slim yet sturdy, add no bulk to your phone, feels snug around the phone, slide easily in and out of pockets, offer outstanding textured touch feel, gives your Galaxy Note 8 a nice appearance and excellent grip to your hand.",
        "[ Easy Access ]: All cutouts and buttons are precisely designed to access all your device's features. It provide an assuring 'click' with each button press. Access is always easy.",
        "[ Premium Quality ]: Thin yet sturdy polycarbonate casing provides added protection that minimizes bulk and maximizes portability for Samsung Galaxy Note 8 2017."
    ],
    "description": "- This case is made of 3 pieces. It’s very easy to put on and take off. You can put on the largest and most important piece, then you can put on the top one piece and put on the bottom one piece. You can take off the top one piece and take off the bottom one piece firstly. Then you can take the whole case off. -The new 3 in 1 360 degree full body protective case for Samsung Galaxy Note 8 is the feature of all cases - providing the maximum protection from shock, drops and scratch with an elegant look, good touch feeling and excellent grip. -Precise cutouts ensure easy and quick access to all features while tactile buttons ensure haptic feedback. -Ultra thin, slim, light weight and fingerprint resistant case make you use this case more easy and stylishly protect your device without any bulky. Compatible with Samsung Galaxy Note 8 1x Wellerly Hard PC case for Samsung Galaxy Note 8 (2017)",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 12.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51Mu8hGIvJL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41uKGhXo6zL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sgIR-C0nL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41HusxxAU9L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HphMXSAWL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51emXdcbXKL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ekr6eKp8L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B076WZYJ5D",
        "B07CZ9GBPS",
        "B079B89N4R",
        "B00Z7SOICG",
        "B075RF85S9",
        "B075THWMZZ",
        "B0716J1814",
        "B07569QYLP",
        "B07GDBXMP6",
        "B07BKXKT1M",
        "B078NC1JW8",
        "B077Z7TC2P",
        "B075L7LJSC",
        "B074TJYYRK",
        "B073R7DFG1",
        "B072WBBMK7",
        "B073RWK9R6",
        "B073RWMTNZ",
        "B07569LM9Z",
        "B075P2FHF3",
        "B075THF884",
        "B073WWVN77",
        "B075HVZFXR",
        "B073RW8GLS",
        "B075THVYCY",
        "B07GGFJ29Q",
        "B01LYNE06E",
        "B077M7BP1D",
        "B075HVYTKZ",
        "B075TJHS9P",
        "B075TJR79L",
        "B075TJ21K4"
    ],
    "rating": "2.6"
}