{
    "asin": "B07569CKTN",
    "title": null,
    "brand": "AutoCraze",
    "feature": [
        "REMOVE UNWANTED ODOR INSTEAD OF JUST COVERING IT. While your regular car fresheners cover up unwanted odors, the most POWERFUL Car Purifier in the market releases 5.6 million negative ions inside your car providing clean purified air, preventing massive odor and eliminating odor-causing particles from smoke, pet smell, dust, bacteria and more.",
        "DURABLE AND DEPENDABLE. Our car fresheners are designed to last and have gone through multiple stages of checking to assure that it will work for you.",
        "MULTIPLE BENEFITS. Eliminate odors, prevent fatigue, enhance your concentration and improve the quality of the air you breathe in your automobile.",
        "REMOVE UNWANTED ODOR INSTEAD OF JUST COVERING IT. While your regular car fresheners cover up unwanted odors, the most POWERFUL Car Purifier in the market releases 5.6 million negative ions inside your car providing clean purified air, preventing massive odor and eliminating odor-causing particles from smoke, pet smell, dust, bacteria and more.",
        "DURABLE AND DEPENDABLE. Our car fresheners are designed to last and have gone through multiple stages of checking to assure that it will work for you.",
        "MULTIPLE BENEFITS. Eliminate odors, prevent fatigue, enhance your concentration and improve the quality of the air you breathe in your automobile.",
        "BREATHE EASILY. If you sneeze endlessly when you drive because of your pollen allergy, or the smell of the burger you ate in the car tends to linger, then our car air purifiers will have you breathing easy in no time.",
        "ENJOY DRIVING. Our mission is to provide you with an enjoyable driving environment by starting with fresh sterilized air inside the car."
    ],
    "description": "What are Negative Ions? Ions with one or more negative electric charge are called Negative ions. Thunderstorm, storm, impact of falls, photosynthesis and other natural phenomena produce negative ions ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": 100.0,
        "width": 500.0,
        "height": 100.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01M1NA9ZB",
        "B004BOH6BM",
        "B00A7ZV0R0",
        "B0719WZ2VW",
        "B012CDEMFG",
        "B01F4DSGAI",
        "B079ZL2GHP",
        "B07644QXBB",
        "B074R8FW7D",
        "B071XFBXC3"
    ],
    "rating": null
}