{
    "asin": "B0758XXCSC",
    "title": "Fire TV Stick with Alexa Voice Remote + Echo Dot (Black)",
    "brand": "Amazon",
    "feature": [
        "Pair the included Fire TV Stick and Echo Dot and get hands-free voice control of your Fire TV with Alexa.",
        "Use your voice to control playback of content (play, pause, resume) in many of your favorite apps. Additionally, many apps including Netflix, Hulu, CBS All Access, SHOWTIME, NBC, and others have integrated even further with Alexa, which will allow you to browse, search, and change channels within supported apps.",
        "Fire TV Stick delivers streaming access to over tens of thousands of channels, apps, and Alexa skills and more than 500,000 movies and TV episodes.",
        "Pair the included Fire TV Stick and Echo Dot and get hands-free voice control of your Fire TV with Alexa.",
        "Use your voice to control playback of content (play, pause, resume) in many of your favorite apps. Additionally, many apps including Netflix, Hulu, CBS All Access, SHOWTIME, NBC, and others have integrated even further with Alexa, which will allow you to browse, search, and change channels within supported apps.",
        "Fire TV Stick delivers streaming access to over tens of thousands of channels, apps, and Alexa skills and more than 500,000 movies and TV episodes.",
        "Echo Dot has 7 far-field microphones that hear you from across the room for hands-free voice control, even while watching a movie or listening to music.",
        "Ask Alexa to play music, order a pizza, or provide information. With compatible smart home devices, you can turn on the lights, set thermostats, and more.",
        "Amazon Prime membership unlocks thousands of movies and TV episodes, including Thursday Night Football, Amazon Original Series, Prime Video Channels, and ad-free listening to millions of songs with Prime Music."
    ],
    "description": "Pair the included Fire TV Stick and Echo Dot for hands-free voice control of your Fire TV with Alexa. Just ask for the content you want like, \"Alexa, play 'Sneaky Pete',\" and relax while Alexa gets yo ...",
    "price": 7498.0,
    "listPrice": 8998.0,
    "prime": true,
    "dimensions": {
        "weight": null,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01IQEADEE",
        "B01N32NCPM",
        "B01IQEADVC",
        "B074TC662N",
        "B075XN1NZC",
        "B01N9O3UTF"
    ],
    "rating": null
}