{
    "asin": "B075K7D95F",
    "title": "Smartphone UV Sanitizer, Cell Phone Sterilizer Cleaner for iPhone 8 iPhoneX Samsung Galaxy S8 S7 S6 Edge Earphone Jewelry Watches Cleaner– Black",
    "brand": "KMESOYI",
    "feature": [
        "【Eliminates 99.99% of Bacteria in 6 minutes】- Maybe you should know” phones have more bacteria than a human toilet” our cellphone are cover in germs and yucky bugs. Protect yourself and those closest to you by sanitizing your phone regularly. KMESOYI phone UV Sanitizer is scientifically proven & tested by independent third party laboratories to kill 99.9% of common household germs such as staph, e. coli and salmonella in 6 minutes.",
        "【Easy to use and Automatically off】- plug it in, put the phone inside and close the cover and click button, the UV lights start automatically and run for 6 minutes, automatically off, remove phone, unplug. So easy that you can protect yourself and those closest to you by sanitizing your phone regularly.",
        "【Portable UV sterilizer works as an Aromatherapy Diffuser】- Simply add a couple drops of your favorite aromatic oil inside to freshen your phone while sanitizing.",
        "【Compatible with cell phone and Smartphone up to 7 inches】- KMESOYI Portable UV sterilizer 's inner dimensions are (in inches) 7’’ L x 4’’ W x 0.78’’ H and can fit larger phones and phablets including an iPhone 7s Plus, Samsung Galaxy S 7, Note 4, LG G3. Also, it fits for iPods, mp3 players, Bluetooth earphones, toothbrushes, watches, toys, pacifiers, eyeglasses, keys and jewelry.",
        "【Professional Customer Support】 2-Year Limited Warranty, and 60-Day Money Back Guarantee."
    ],
    "description": "Eliminates 99.99% of Bacteria in 6 minutes, Protect you and your family by sanitizing your phone regularly via Portable UV sterilizer Cleaner. 1. Please use external usb cable (included) connect to this device into power adapter (DC5V1A), put your phone or anything you want to sanitizes and disinfects. 2. When close the lid, press disinfection button or fragrance button or both, the UV lights start automatically and run for 6 minutes, A blue light glowing through the lightning bolt signifies when the lights are on and cleaning. 3. When the sanitizing process is done, the UV lights and the blue glow shut of automatically. --You can remove your phone or keep it inside while you charge. 4. If you use a phone case, you can sanitize and disinfects your phone inside with or without your phone case on. Yes, the inner dimensions of cell phone sanitizer are 7’’ L x 4’’ W x 0.78’’ H, so it works well on most phone, such as iphone 8/ 7 /6 plus, iphone X/ 8 / 7/ 6, Samsung Galaxy s 9/ 8/ 6 edge plus, Huawei 9 etc. Yes, you can. Our phone sanitizer is avaliable from Black, Blue, White and Pink. 1.We recommend placing your phone and phone case inside regularly and removing the phone case once a month for a separate sanitizing session. 2. Colors are avaliable from black, white, blue and pink, just pick up one you like! There is external USB data cable for providing the power for the device. Power adapter can not be less than DV5V 1A to ensure the normal functions and operation. 1* Cell Phone Sterilizer Cleanser 1* User Manual 1* External USB Cable 1*Cleaning Cloth",
    "price": 3599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 135.0,
        "length": 800.0,
        "width": 459.99999999999994,
        "height": 180.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41tBcAsWmQL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51zuGklc3-L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-NNQKslVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517zVN6k01L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41xwYzuJ2AL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51CAk4MJx3L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407761011",
            "title": "Chargers & Power Adapters"
        }
    ],
    "similar": [
        "B00Y3O6OAE",
        "B075M5XQWG",
        "B07FPH34N6",
        "B0756DB5FQ",
        "B071YX2BPH",
        "B07F7TD14K",
        "B075K5G1WV",
        "B079KBJSHG",
        "B01F2PW8FW",
        "B074W3FF1B",
        "B071SKHZXG",
        "B072KKH3GN",
        "B01LOR8GNA",
        "B075K8FQ2Z",
        "B07F28HF6H",
        "B071KGVLBB",
        "B076SL195L",
        "B0744HH8JN",
        "B072R6MJKQ"
    ],
    "rating": "4.8"
}