{
    "asin": "B076J1VRB4",
    "title": "Anti Stretch Marks Massage Oil – All Natural Ingredients – Penetrates Skin 6X Deeper Than Stretch Mark Cream - Targets Unwanted Fat Tissues & Improves Skin Firmness - 8 OZ",
    "brand": "PURE PLANT HOME",
    "feature": null,
    "description": "Each ingredient in our oil was carefully picked for its astringent qualities known for centuries to help with specific issues. Our oil helps penetrate the skin and reach the underlying fat tissues causing stretch marks. As the oil is massaged onto the skin and begins to dig deep under, the fat tissues begin to melt away and the skins firmness begins to tighten making this much more effective than commonly used stretch mark cream on the market today. - Grape Seed Oil – has astringent qualities in it. It is regenerating, moisturizing, and skin tightening. It is a light weight oil perfect to keep your areas with cellulite. - Eucalyptus - effectively affects fat deposits that lie just under the skin (subcutaneous fat). It has anti-inflammatory properties and it soothes painful cellulite sensations. - Lemon (Citrus Limon) - is stimulating for the circulatory system and improves microcirculation, strengthens vascular tissues, it is used for treating varicose veins by improving circulation and relieving pressure on the veins - Grapefruit – is a diuretic and lymph tonic, one of the best. It is irreplaceable in treatment of cellulite, water retention and fat reduction.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 61.875,
        "length": 250.0,
        "width": 350.0,
        "height": 600.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/417tI%2BYZYdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41auawlvoqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41SsUBKkzrL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "3777891",
            "title": "Personal Care"
        },
        {
            "node": "11055991",
            "title": "Bath & Bathing Accessories"
        },
        {
            "node": "11056211",
            "title": "Bath"
        }
    ],
    "similar": [
        "B07GJR4KXM",
        "B079TK4QB2",
        "B004AI97MA",
        "B0793L5922",
        "B000JVCBFC",
        "B00GJX58PE",
        "B076DSBHD1",
        "B01MSV30VK",
        "B0010ED5FC",
        "B06WP3D8NS",
        "B07DLL53SQ",
        "B01L9F3VCI",
        "B01GR7LXWI",
        "B016X4GHO4",
        "B00OTZ28DE",
        "B0169PFLFI",
        "B00WFAGPL6",
        "B00DM14TYC",
        "B076BVMCVW",
        "B00GGLLC7C",
        "B07GSZ7C21",
        "B07B15F6FX",
        "B071VYR7ZW",
        "B01B12KCGC",
        "B01N5BCIU0"
    ],
    "rating": "4.7"
}