{
    "asin": "B0762Y66SN",
    "title": "iPhone 8 Case, iPhone 7 Cover, MERCDON Romanticism Floral Printed Flower Pattern Clear Design Hard with TPU Bumper Case Cover for iPhone 7 (2016) / iPhone 8 (2017)",
    "brand": "MERCDON",
    "feature": [
        "[Compatible with Apple iPhone 7 / iPhone 8] PREMIUM PROTECTION - Air hybrid technology provides premium protection and style - featuring two layers of protection: a shock-absorbing clear TPU frame that protects against drops and dings, and a solid PC back panel that protects against scrapes, bumps and more.",
        "ULTRA-CLEAR - Slim, clear transparent shockproof protective bumper case body reveals the original beautiful colors of the iPhone 7 2016 / iPhone 8 2017. The exclusive designs on the back enhance the look of your iPhone.",
        "MERCDON DESIGNED - Perfect designed with current fashion trends for your iPhone 7 / iPhone 8. Perfectly match the iPhone 7 / iPhone 8 in Silver, Gold, Rose Gold, Jet Black. All of our beautifully crafted artworks are printed with odorless, certified scratch resistant ink. They won't fade, smear or peel. They are strong and scratch-proof.",
        "MATERIALS - Shock Absorbing + Scratch Resistant : Premium TPU Bumper + Hard Back Polycarbonate panel provides long-lasting protection from scratches and scrapes. The slim profile allows for easy grip.",
        "SUPPORTS WIRELESS CHARGING - All buttons and ports are easily accessible. While featuring raised bezel to lift the screen and camera off flat surfaces. Slim and lightweight profile fits securely to your phone keeping your phones natural look."
    ],
    "description": "The MERCDON Clear Design Collection - Unique designs for your iPhone. Fashionable protection. Designed to offer a minimalist profile with a smooth transparent finish. This protective case protects your phone against scratches, scrapes and dent to the back and side of your iPhone. Color-coordinating complete for any colors of your iPhone! Compatible with iPhone 8, iPhone 7 Lightweight and Ultra slim. Shock absorbing TPU Bumper + Hard Back Polycarbonate panel provides protection against daily wear and tear, scratches, marks and scrapes. Keep the back and side of your device from drops, scratches, scrapes with this durable & lightweight case.Precise cutouts allow full access to ports, speakers, and camera. Comfortable and non-slip grip.Slim Profile: Slim and lightweight profile fits securely to your phone allowing you to showcase your phones natural look and color.Crafted to Perfection: HD printed patterns1 x Phone Case for iPhone 7 or iPhone 8Accessory only, cell phone NOT included.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 11.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51JM%2BdkWuVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-ELTaptmL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51X-%2B9kjThL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51cVfMs8QcL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31qUjOJa6YL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51IIJjKofwL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B079BKZWT7",
        "B01N7D3U2W",
        "B00Z7RS3GY",
        "B01KF0FJX2",
        "B077X8GXGC",
        "B01MCT5PXG",
        "B079TPC2Y5",
        "B077X8W4CV",
        "B06WV8X2LH",
        "B01415QHYW",
        "B076J96T6L",
        "B01LVVEFIY",
        "B076LK9PQ7",
        "B079VCFPDQ",
        "B06XYNKL7B",
        "B073TDTDP5"
    ],
    "rating": "5.0"
}