{
    "asin": "B076WX9VW3",
    "title": "Siroflo 3 in 1 Professional HD Camera Lens Kit, 0.65X Super Wide Angle Lens, 15X Macro Lens, 230 Degree Fisheye Lense Universal Clip-On Cell Phone Lens for iPhone 8, 7, 6s, 6, 5s, Samsung",
    "brand": "Siroflo",
    "feature": [
        "MINI, COOL, CONVENIENT AND REMOVABLE: Three compact detachable mini camera lens, flexible lens clip, one-second installation, easy to carry, professional workmanship, multi-function photo artifact",
        "ADVANCED MODERN TECHNOLOGY: The lens adopts high optical technology. 6 + 6 layer optical coating, SLR-level shooting lens, with anti-thread design, shooting with your phone will become more professional and precise",
        "230 DEGREES FUN FISH EYE: Fish-eye lens with a strong visual effect, you can see through the 230 bubble fish-eye visual, and create a parallel, distorted funny world!",
        "HIGHER IMPACT WIDE-ANGLE LENS: More than 0.65 times the wide-angle, allowing a wider range of perspectives, covering a wide range of scenery, closer to the human eye vision and enhancing the reality of what you capture.VZXBN",
        "MAGNIFIED DETAIL SHOCK VISION MACRO LENS: 15 times macro, 3cm macro effect, the phone can be turned into a microscope, having a magnificent performance when capturing flowers, fish, insects and other small things."
    ],
    "description": "Universal Clip-On Cell Phone Lens can be used with a wide range of cell phones such as for iPhone, Samsung, Most Smartphones and more; also work on iPad and PC. Professional but portable to use. Clip it on the front or back camera of your phone, and it will show you another world of cell phone photography! You can also be a photographer of your life!◆ Angle: 230° ◆ Angle: 140°◆ Magnification: 0.65X ◆ Magnification: 15X◆ Min Object distance: 10-15mm◆ Max Diameter: 30mm1. Shooting without hand shake.2. Make sure the phone is focus on the subject.3. Make sure the phone is parallel with the lens with no gap. 4. Make sure the phone is aligned 100% .(Center aligned with the center).5. Ensure that the surface and the bottom surface of the lens cell phone camera are parallel. ⚠ Please wipe clean all lenses before using. ⚠ It's better to take off your phone case for taking better photos. ⚠ All three angles would not block the flashlight even though the edge is right next to the flash light. 1 X super wide lens1 X fisheye lens 1 X macro lens1 X EV Bag1 X Lens Holder1 X Lens Cloth1 X Cloth Bag1 X Portable Buckle1 X English User Manual◆ 30 Day Money Back Guarantee◆ 12-Month Replacement Warranty◆ 7/24 Online Customer Service",
    "price": 1599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/411nXdE88EL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41MVkKuroTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61MWzVJoQ0L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61i4dWmAA4L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51GFALPPmCL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51kkg9ylmLL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41fqO4WdmEL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "15124502011",
            "title": "Lens Attachments"
        }
    ],
    "similar": [
        "B073XDK6TS",
        "B07D8X22BL",
        "B07DHJLW8N",
        "B079C8YBKS",
        "B073PZX14K",
        "B07FC4DH5K",
        "B07C6XX267",
        "B07BKY45Q2",
        "B07CTCPMDD",
        "B07D4F9ZQN",
        "B01N985HG0",
        "B07FX8XVK9",
        "B0179JX8GC",
        "B07DHGVJ5W",
        "B07DXKB4BZ",
        "B078RL4Q8H",
        "B079HLNFM3",
        "B07DGPY5MN",
        "B07888CSJX",
        "B07DPJW1PV",
        "B07GNKTN2C",
        "B07FGFNQ33",
        "B07DJ3LPRF",
        "B07BK9L6LX",
        "B07C6RYK4F",
        "B074TGMFD3",
        "B07DBJWGZN",
        "B07BNDHJJ8",
        "B07B4TN3LL",
        "B01A6D2JVI"
    ],
    "rating": "5.0"
}