{
    "asin": "B076HW4RWW",
    "title": "【NEW】Bluetooth Headset V4.1,Candeo Wireless Business Earpiece Trucker In-Ear Earbuds Headphones with Noise Reduction Mute Switch,Hands Free w/Mic for Office/Business/Workout/Driver/Trucker-Yellow",
    "brand": "Candeo",
    "feature": [
        "【Phone headset wear comfort】 The adjustable earplugs can be adapted to 99% ear shape (including small ears). The three sizes of ear hooks( S,M, L) and 180 degree revolving arms,ergonomically designed and ultra light weight (0.4oz), you can wear it in your left or right ear and ensure maximum comfort.",
        "【Phone earpiece High Definition sound quality】 With built-in high definition microphone enhanced echo cancellation and noise suppression technology, the Candeo Bluetooth headset provides you crystal clear sound.",
        "【Hand free headset is easy to use】 It can activate the voice assistant of the iPhone cell phone (when there is no call, press the \"Mute\" button to activate the Siri function). Free to switch mute function (during the call, click on the \"Mute\" bottoh can be activated mute function. reoperation can be restored). smart voice(say \"yes\" answer, say \"no\" refuses).",
        "【Bluetooth headset can connect two Bluetooth devices at the same time】 Even if you have two mobile phones,or a cell phone and a computer, you won't miss any phone and information. Universal compatible with most Bluetooth enabled computers, laptops, tablet PCs and mobiles, including iPhone X 8s 7 plus 6S SE, Samsung Galaxy S8 Edge S7 S6 S6 85, and more smart phones. If Bluetooth is not enabled, you need to add a Bluetooth adapter / encrypted dog.",
        "【Candeo bluetooth Quality assurance】 24 hours customer service support,If for any reason you're not completely satisfied, Please contact us, our excellent service will bring you a smile. 30 days without reason to return."
    ],
    "description": ": Please refer to the User Manual before use .If any problem/question, please kindly contact us firstly. Our Customer Support Team will get back to you within 24 hours. Waterproof anti sweat comfortable design,The 180 degree flip-boom arm allows you to adjust the angle and fit your right ear or left ear,you can enjoy music and call.The bluetooth headset with Separate power mute and volume buttons provide easy access and control. Built-in CSR import high-end chip (stable signal transmission) and CVC6.0 noise reduction ANC (ambient noise cancellation) even in noisy environment can guarantee clear sound quality - Noise reduction:CVC6.0 - Bluetooth Specification: V4.1+EDR - Profiles: A2DP, AVRCP, HSP, HFP - Range: Within 33 feet（10m） - Talk/Music Time: 6.5 hours - Standby Time: Up to 200 hours - Charge Time: 1.5-2 hour -Mute switch -Compatible with iPhone7 6s 6s plus 6 6 Plus 5 5S 4 4S iPad iPod Samsung Galaxy S6 S5 S4 S3 LG Motorola Sony and iOS/Android Mobile Phones etc almost all smartphones ◆1 x bluetooth headset ◆1 x Mic USB Charging Cable ◆S, M, L Ear Tips ◆1 x User Manual ◆Please do not expose the headset under direct sunlight while charging, especially when environment temperature is high. ◆To extend the life of the headphones, do not overcharge. The most suitable charging time 2-3 hours Charging voltage: 4.5-5V, not more than 5V. Otherwise will damage the headset ◆Please avoid to use low quality or high current USB charger.",
    "price": 3599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": 130.0,
        "width": 80.0,
        "height": 40.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41Gyfkj4NpL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41dINd%2B8ZGL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/517S9ciCZIL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Mnp59jh8L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51mt1S1s7SL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51hSwjZaBlL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YqVtmemXL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407776011",
            "title": "Bluetooth Headsets"
        }
    ],
    "similar": [
        "B07FNSPCRN",
        "B01MYRJSM5",
        "B07GRNYDLR",
        "B07GFFDC67",
        "B075NRNZWD",
        "B07DWNMNQM",
        "B07429QXPJ",
        "B078GFL2HL",
        "B01L160DLW",
        "B076H1DY6F",
        "B07FZKX3GC",
        "B07FM4WPTW",
        "B01N7A5BDS",
        "B07F71VP7F",
        "B01N1K2ZDJ",
        "B075QLCNMG",
        "B0794SCYM8",
        "B0747Y9NK9",
        "B07F65FVB5",
        "B075QLZ7RX",
        "B07FDZYXWM",
        "B0774VJSNF",
        "B07F9QSYG2",
        "B075TVSX5W",
        "B077T5YPWK",
        "B07FMSJZ3R"
    ],
    "rating": null
}