{
    "asin": "B076PS8SXK",
    "title": "Automatic Soap Dispenser, Lovin Product Auto Sensor Touchless Soap Dispenser with Brushed Stainless-Steel, Fingerprint Resistant Coating, and Waterproof Base Perfect for Use in Bathrooms. (2 Pack)",
    "brand": "LOVIN PRODUCT",
    "feature": [
        "PREMIUM QUALITYAND WATERPROOF - Sleek & Elegant brushed nickel stainless steel with a classic and contemporary design allows it to blend with modern living environments; made of fingerprint-resistant stainless steel and ABS plastic so will not rust or clog, it can hold almost ten ounces of soap and has the dimensions of approximately eight inches tall and four inches in diameter. Using AAA-level anti-leakage and waterproof technology to prevent the soap or water to corrode circuit board. Waterpr",
        "SMART-MOTION INFRA-RED SENSOR TECHNOLOGY- Our smart-motion infra-red sensor technology provides a sanitary, no-touch and easy-to-use operation that will only be activated when needed (unlike others that are too sensitive can have spillages). The sensor detects your hand within one pass--Just place your hand under the sensor, don't need to wave your hand multiple times.",
        "EASY TO SET UP - After inserting the batteries (included) by pressing and holding the switch button for three seconds, the indicator with light and the dispenser is activated; use the same instructions to switch it off; soap flow and thickness can be adjusted;",
        "PREMIUM QUALITYAND WATERPROOF - Sleek & Elegant brushed nickel stainless steel with a classic and contemporary design allows it to blend with modern living environments; made of fingerprint-resistant stainless steel and ABS plastic so will not rust or clog, it can hold almost ten ounces of soap and has the dimensions of approximately eight inches tall and four inches in diameter. Using AAA-level anti-leakage and waterproof technology to prevent the soap or water to corrode circuit board. Waterpr",
        "SMART-MOTION INFRA-RED SENSOR TECHNOLOGY- Our smart-motion infra-red sensor technology provides a sanitary, no-touch and easy-to-use operation that will only be activated when needed (unlike others that are too sensitive can have spillages). The sensor detects your hand within one pass--Just place your hand under the sensor, don't need to wave your hand multiple times.",
        "EASY TO SET UP - After inserting the batteries (included) by pressing and holding the switch button for three seconds, the indicator with light and the dispenser is activated; use the same instructions to switch it off; soap flow and thickness can be adjusted;",
        "PREMIUM BRUSHED STAINLESS STEEL DESIGN- Premium brushed stainless steel design brings class and luxury to any bathroom, kitchen, or home. Fingerprint resistant and sleek, Far more hygienic and clean than a store-bought soap dispenser, you can rest easier knowing it will prevent the spread of germs and keep your children safe and healthy.",
        "Service Guarantee - The soap dispenser comes with 90-days money-back guarantee for ANY reason, and 12 Months Free Warranty. We will provide Consistent Quality Timely Service for Every Customer. If any questions, please contact us, we will try our best to help you."
    ],
    "description": "Safety precautions: Please do not wash the unit. To clean, simply wipe with a damp cloth and wipe it immediately with a clean, dry cloth and try again. Wipe the body with cloth regularly to avoid long ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 160.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B00A20VOPI",
        "B074N4H9GJ",
        "B07D9PSBP8",
        "B078XDFDPY",
        "B07D35DSGD",
        "B075CXPC8M",
        "B07CVB9S7G",
        "B078P4FP19",
        "B07DGQHM86",
        "B0020VJTDG"
    ],
    "rating": null
}