{
    "asin": "B076HHVX7W",
    "title": "8 Outlets Power Strip with 4 USB Charging Ports, PRITEK 15A/1875W 1000J Surge Protector Tower Power Socket with 2m/6.5ft Extension Cord Multifunction Vertical Power Strip for Home or Office",
    "brand": "PRITEK",
    "feature": [
        "8 AC OUTLETS & 1000J SURGE PROTECTOR -- 8 AC plugs are much enough for your daily life or used in office. There is a circuit breaker on the bottom, protect your electronic devices from surges and spikes",
        "SMART IC CORE & 4 USB PORTS -- Smart charging for all USB-powered devices, automatically detect and deliver charging rate (0-2.4A) according to different devices, such as smart phones, iPad, tablets, power banks, e-Readers, Bluetooth speakers, headsets and more",
        "ENOUGH SPACE BETWEEN OUTLETS -- Vertical and 4 sides design is effective to distribute cables, and avoid too much cords in messy when charging several devices, save space and keep your desk tidy. 6.5ft extension cord is long enough to connect the appliance that far away from the power source",
        "2 INDIVIDUAL ON/OFF SWITCH -- One switch to control the 4 USB ports and 4 standard outlets in the front, another one to control the back side 4 outlets. Convenient to turn off the plug and save energy when not used",
        "WIDELY USED -- Combination between AC power strip and USB charger, not only suit for AC electrical equipment, such as TV, refrigerator, computer, microwave oven, printer and other high-power (under 1875W) appliances, but also fit for USB-Powered portable devices, such as cellphones, tablets, speakers, power bank and so on"
    ],
    "description": "-- Automatically identify the suitable current when charging for different devices, to protect your electronic equipment. -- It's also convenient for charging all those handheld devices like cellphones and tablets. --There are 2 individual ON/OFF switch on the top to control the certain outlets and USB ports when not being used, save power. --Two layered vertical and tower design provides the enough distance between each outlets, 4 sides design can distribute devices and keep the cables in order. --1000 Joules surge protection protect your electronic devices from surges and spikes. --Short circuit protection, overload protection, over current protection. --Long enough to connect the appliance that far away from the power source and makes your desk neat and organized. Material: ABS Rated Current: Max. 15A Voltage: 110-125V Max. Power: 1875W USB Rated Voltage: 5V USB Max. Output: 4.5A Cable: 2m/6.5ft Color: Black Product Size: 5.47x5.47x6.49 inch 1. Please ensure that the total rated power of appliances is under 1875W. 2. Stop using immediately when the power cable is overheating. 3. Avoid using the wet hand to touch the socket. 1 x Power Strip with 6.5ft Cable",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 176.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41YK7fby04L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-6eIimJ4L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51v2YmFh7tL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41SnVa69qyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51wzLAWghwL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Zx9GAurtL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5152MJm8HWL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "281407",
            "title": "Accessories & Supplies"
        },
        {
            "node": "17854127011",
            "title": "Power Strips & Surge Protectors"
        },
        {
            "node": "10967801",
            "title": "Power Strips"
        }
    ],
    "similar": [
        "B0781SKPRZ",
        "B01LXFA83I",
        "B077ZSC6RQ",
        "B07D7W8LLM",
        "B076RKV5WK",
        "B01H4YTH6W",
        "B06ZZRJMX7",
        "B0792XQYR7",
        "B014EKQ5AA",
        "B0759TZDWZ",
        "B073XC47GJ",
        "B078HK24WZ",
        "B07CW7FKXL",
        "B06XCM9LJ4",
        "B07FKDN27P",
        "B01HPADPCW",
        "B01DFKC2SO",
        "B075YV8JPW",
        "B077ZVBJH2",
        "B01BYO79UE",
        "B07GB1GKDW",
        "B01M4HOTZG",
        "B01FHMPV1S",
        "B073VK94RP"
    ],
    "rating": "3.9"
}