{
    "asin": "B076XP6CBF",
    "title": "AlienJacket - Google Pixel 2 XL 3M Vinyl Textured Skin Wrap (Bumble Bee - Black and Yellow)",
    "brand": "AlienJacket",
    "feature": [
        "This is a high quality adhesive skin (similar to a sticker or decal), NOT a hard case, and is a sleek way to wrap or skin your device in a variety of colors and textures for a one-of-a-kind personalized look! Defend your device from dirt, dust, scrapes, fading, peeling and smudges with premium 3M architectural grade vinyl that adds additional grip!",
        "Buy with confidence knowing that you are purchasing the most trusted and highest quality protective vinyl on the market, period. All AlienJacket products are made using 3M architectural grade vinyl adhesive that provide a long lasting styled solution, with no sticky residue & a no-mess removal!",
        "Precision, where it counts, proudly designed & produced in the-USA. Precise edge-to-edge coverage and perfect alignment of cutouts provide access to all buttons or ports, with no overhang.",
        "Detailed application instructions are always available and updated on the AlienJacket website, as indicated on the back of all product packaging."
    ],
    "description": "An AlienJacket skin gives you the added durability without the bulk of a traditional case that customizes your phone with a sleek, one-of-a-kind look. These skins are a great way to stylize your device while preventing fingerprint smudges, provide scratch protection, and a non-slip grip.Finely crafted, designed and produced in the USA. Created with superior architectural grade material, manufactured by 3M - an unsurpassed “textured” vinyl product that is thicker and much stronger than off-brand solutions used by competing skin brands. These are not “printed” graphics, but instead have real life-like textures that you can see and feel.Anyone can apply an AlienJacket skin with the help of the online instructions (see reverse side of product packaging) which include detailed photo’s, pro-tips and a step-by-step guide that is suitable for most devices.Many (but not all) of the AlienJacket skin designs require the use of heat (hair-dryer) to apply the skin over curved edges of a device, while other designs intended for laptop skins or flat-surface devices, may not require the use of heat. A device must be properly cleaned before application, or the skin will not fully adhere to the surface.AlienJacket skins can be removed without leaving behind any sticky residue and can keep your device looking just as new as the day you bought it. Each skin is meant for one-time use only and are not intended to be reapplied after the first application.AlienJacket stands behind their product. A small business with a true passion for product innovation that listens to ideas, feedback and suggestions in a vast community of fans or enthusiasts, from all over the world.If you have application questions before or after you buy, a phenomenal AlienJacket support team member awaits you. If this is your first time applying a skin, never fear - a free replacement for first time customers is available, no questions asked.",
    "price": 1195.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 7.000000000000001,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41AKwOY-ZeL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dkr0OcR5L._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        }
    ],
    "similar": [
        "B01LO9XF0C",
        "B076TJTV6J",
        "B076TLN392",
        "B07DBJ9R7Z",
        "B0747813GV",
        "B075SYSK98",
        "B079ZBDL7D",
        "B0777LKMMH",
        "B07GGZ9ZVC",
        "B076RMPH8J",
        "B076TZD8WT",
        "B077CHPQNF",
        "B07CDQNKNY",
        "B078TQ6GMQ",
        "B078TPN753",
        "B01MRHB98Q",
        "B07FPFRBPB",
        "B07CWCKCQH",
        "B074VYPHHV",
        "B078WQ83V6",
        "B073WWVN77",
        "B078WQ7XKL",
        "B073RV6PQD",
        "B075RX9MRB",
        "B073YCKMCF",
        "B078WF51GX",
        "B07H8WJRY3",
        "B077LK7PZQ",
        "B0771J3S86"
    ],
    "rating": "3.8"
}