{
    "asin": "B076JLJVTG",
    "title": "Tenda Nova Whole Home Mesh WiFi System - Replaces Gigabit AC WiFi Router and Extenders, Dual Band, Works with Amazon Alexa, Built for Smart Homes Up to 6,000 sq. ft. Coverage (MW6 3-Pack)",
    "brand": "Tenda",
    "feature": [
        "REAL MESH NETWORK: Supports mandatory mesh Wi-Fi technical protocol 802.11s, the next-gen wireless router built for your smart home.",
        "ROUTER & EXTENDER REPLACEMENT: Replaces existing router and Wi-Fi extender solution, works as real Mesh wireless access point system behind current router. Compatible with major modem and internet service providers including AT&T, Comcast,Time Warner, Verizon Fios, Spectrum and others.",
        "HIGH CAPACITY AND COMPLETE FLEXIBILITY: Creates a seamless, one name mesh Wi-Fi environment for your high-capacity network demands. Supports a maximum of 90 connected devices simultaneously. Each node covers up to 2,000 sq. ft of living space and eliminates dead zones. Easily expand your Wi-Fi router network.",
        "SEAMLESS ROAMING FOR ALL: Every unit works together to form a real mesh Wi-Fi network, creating a truly seamless online experience. Phones, laptops and most Wi-Fi devices automatically connect to the strongest access point when moving throughout your home.",
        "EASY SETUP: Tenda Wi-Fi APP helps you setup, monitor and manage your home mesh Wi-Fi network easily and quickly. The APP allows you to add more units in minutes, monitor the network status, and includes built-in parental controls to schedule Internet access for your children."
    ],
    "description": "Whole Home Mesh Wi-Fi System nova is powered with Mesh technology, a set of three units covers home up to 6,000 square feet with strong Wi-Fi signals. Smart Auto-path Selection Technology to ensure a robust wireless network and maximize a faster home internet.",
    "price": null,
    "listPrice": 19999.0,
    "prime": true,
    "dimensions": {
        "weight": 430.0,
        "length": 390.0,
        "width": 390.0,
        "height": 390.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/31w1KAftIOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/315cilEwNOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/510aOOLveEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ZprwLr8VL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51f4NHI-TgL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51sJm3PD8JL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Model:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172504",
            "title": "Networking Products"
        },
        {
            "node": "17935294011",
            "title": "Whole Home & Mesh Wi-Fi Systems"
        }
    ],
    "similar": [
        "B017DV1BPG",
        "B078N3C3JX",
        "B07FP62CXP",
        "B07FCRCD93",
        "B07DWPKG5D",
        "B01MSSUG2H",
        "B07CQDHPFT",
        "B077DRN8YP",
        "B06WRSBYVK",
        "B0143HBZMW",
        "B075PXBPFS",
        "B01L9O08PW",
        "B078Z3PTJP",
        "B07DFQGP1K",
        "B01N2NLNEH",
        "B01N5ASNTE",
        "B07DL4CWVX",
        "B071DWXLYL",
        "B07C86Z568",
        "B075ZSZT1M",
        "B07GJBYC3D",
        "B01MAW2294",
        "B07DFSYL8T",
        "B00DN3J03O",
        "B0787K2MPR",
        "B06WVCB862",
        "B0797D6853",
        "B078MZTRBS",
        "B01LQRM9M2",
        "B01MDJ0HVG"
    ],
    "rating": "4.1"
}