{
    "asin": "B076F1F9ST",
    "title": "Self Stirring Coffee Mug, Xultrashine Camera Lens Coffee Mug Stainless Steel Self Stirring Coffee Cup for Morning Office Coffee Travelling 280ml/9.5oz (Self Stirring Mug)",
    "brand": "Xultrashine",
    "feature": [
        "Ingenious Design&Perfect Gift - This creative self stirring mug is a 1:1 replica of the Canon Lens Model EF 24-105mm f / 4.0L USM, it even features push slide switches, just like the real lens! It’s a perfect gift idea for families and friends, especially those who loves photography and cameras",
        "Self Stirring Cup - This is an electric Self Stirring Coffee Cup with 9.5oz / 280ml capacity when filled, powered by 2 x AAA batteries(NOT included), just switch the button to \"ON\" for instant stirring action, great for coffee, tea, milk, cereal, travelling etc",
        "Safe for Any Beverage - Made of premium stainless steel interior - Durability and Easy Cleaning, food grade PVC plastic exterior - Made to Last. Both BPA and phthalate free, safe to use for any beverage",
        "Ingenious Design&Perfect Gift - This creative self stirring mug is a 1:1 replica of the Canon Lens Model EF 24-105mm f / 4.0L USM, it even features push slide switches, just like the real lens! It’s a perfect gift idea for families and friends, especially those who loves photography and cameras",
        "Self Stirring Cup - This is an electric Self Stirring Coffee Cup with 9.5oz / 280ml capacity when filled, powered by 2 x AAA batteries(NOT included), just switch the button to \"ON\" for instant stirring action, great for coffee, tea, milk, cereal, travelling etc",
        "Safe for Any Beverage - Made of premium stainless steel interior - Durability and Easy Cleaning, food grade PVC plastic exterior - Made to Last. Both BPA and phthalate free, safe to use for any beverage",
        "Convenient and Insulated - Realistic Lens Cover Top for easy travelling to shoot locations, school pickup, the office or walking from home with your own unique beverage brew, total ease of use! Insulated steel keeps beverages hot or cold longer",
        "Order Now - It's Guaranteed! Each Xultrashine’s products enjoys a 30-day money back and 12 months manufacturer warranty. If you have any problem with our products, please feel free to contact us via Amazon Message with your order# and details, we will always be more than happy to assist you"
    ],
    "description": null,
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 65.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01J44MGOA",
        "B00C3CUPI0",
        "B075WNFG1M",
        "B01N1WYQYT",
        "B00MU1JR2E",
        "B01G3CT2DY",
        "B079CND7ZR",
        "B01N9FAUFX"
    ],
    "rating": null
}