{
    "asin": "B076F7S31J",
    "title": "Women's Painless Hair Remover with 1 Replacement Head Electric Cordless Facial Hair Razor Portable Bikini Trimmer Ladies Electric Hair Shaver on Upper Lip Chin Cheeks AS SEEN ON TV",
    "brand": "Anna Home Collection",
    "feature": null,
    "description": ":100% brand new and high quality, 100% money back guarantee if it can not work fine or any damage.we specialized in remover for more 10 years , customers satisfaction is our business source Safe Touch Light Hair Removal Device is perfect to remove unwanted facial hair and body hair The professional women's painless hair remover is the best choice for you. This discreet and stylish facial and body hair remover is sleek and discreet. The mini pocket style is specially designed for elegance fashion ladies, which also makes it a considerate companion for your confidence and beauty. The 18K gold-plated head is hypoallergenic and gentle on all skin types. No nicks, redness, or irritation. A finish as smooth as waxing! And, with facial hair gone, your makeup application is easy. How to Use · Remove cap . · Slide the switch located on the side of the unit upward into the “ON” position. · Gently press the head of the unit flat against your skin. The unit should not be on an angle. Proceed making small circular motions to remove unwanted hair . NOTE: It is normal for the head to become warm with use. Cleaning (Be Sure unit is off) · Twist the rotating hair removal head counter-clockwise and lift off . · After each use, clean the head by using a brush (included) to wipe away the hair residue. · Empty any hair from the body of the unit by turning it over and gently tapping the side. · To put the hair removal head back on the unit, line up the “groove” indicators on the cap with those on the unit and twist clockwise . Package Include: 1X hair remover (bulk package) 1XReplacement Head 1X brush 1X user manual Note:Requires 1 AA Battery –No Included",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.125,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41fDi5fuBPL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760911",
            "title": "Beauty & Personal Care"
        },
        {
            "node": "3778591",
            "title": "Shave & Hair Removal"
        },
        {
            "node": "13269990011",
            "title": "Women's"
        },
        {
            "node": "13269998011",
            "title": "Epilators, Groomers & Trimmers"
        },
        {
            "node": "234944011",
            "title": "Epilators"
        }
    ],
    "similar": [
        "B07F96DKGG",
        "B0758KCLZD",
        "B07664D4YM",
        "B07F82NJFJ",
        "B01H7JCTKU",
        "B016M9UEY4",
        "B00CDGJIAW",
        "B07F9S4P9K",
        "B076VJQ4SW",
        "B076HM2ZMV",
        "B016M9UFJ8",
        "B07D1MQQWH",
        "B01ECD502S",
        "B077YPFZR9",
        "B0029XJVA6",
        "B00XAQ0XDU",
        "B076FYCXMQ",
        "B07CZCHGVK",
        "B0787GLBMV",
        "B078GC6DBV",
        "B00UYY2GUO",
        "B07GSW24NM",
        "B0779W5PKC",
        "B0759VCRZ6",
        "B01N8XF244",
        "B076BN2ZRB",
        "B078TFZSXV",
        "B000P9SRMY",
        "B079C81WDS",
        "B076M538HQ",
        "B07DG1KWFT",
        "B076CXPZG3",
        "B077P3N23C",
        "B076G2XGXK"
    ],
    "rating": "3.8"
}