{
    "asin": "B077MMJ14H",
    "title": "Florensi 14K Rose Flower Pendant Necklace, Romantic Rose Gift For Women, Beauty and the Beast Rose Jewelry, Gardeners Necklace",
    "brand": "Florensi",
    "feature": [
        "Dimensions: 1.5” x 0.5” x 17”",
        "Material: 14k Gold over Brass",
        "This versatile nature necklace features a delicate rose- Our metal rose neklace has a realistic 3D rose pendant hanging from a 17” chain that falls just above the collarbone. The chain has an easy-to-fasten and secure lobster clasp closure. Choose from three classic colors—rose gold, gold, or silver tone. No matter your choice, this floral necklace will gracefully complement your clothing.",
        "Real roses fade, but our floral rose necklace will last forever- Inspired by a rose’s beauty and fairytales like Beauty and the Beast, our rose flower necklace offers elegance to its wearer for a lifetime. Flaunt your fairytale love every day when you wear this rose flower jewelry piece. Are you a bride? Our 3D rose necklaces also make great bridesmaid jewelry, especially for fantasy or fairytale-inspired weddings.",
        "Ideal gifts for florists, gardeners, romantics, and more- Without messages attached, roses express love, new beginnings, warmth, gratitude, and good health. Spread these positive feelings and well wishes to your loved ones when you gift them our floral statement necklace. Wives or girlfriends will love receiving this piece on their birthday, your anniversary, Valentine’s Day, or just because. It’ll stick with her longer than flowers, and she’ll think of you each time she wears it."
    ],
    "description": "Rosa Vila rose flower necklace for women in gold, rose gold or silver tone, 17” chain Beautiful flowers, feelings, and fairytales like Beauty and the Beast inspired our floral rose necklace. The 3D rose pendant looks just like a rose you’d buy at a floral shop, but this rose will last forever. Its 17” chain has a lobster clasp closure for security, and the pendant fall just above your collarbone. This elegant rose necklace comes in your choice from silver, gold, or rose gold tone. Purchase these floral wedding jewelry pieces for each of your bridesmaids. They’ll look great in your fantasy or fairytale wedding. Struggling with what to get your girlfriend? This romantic rose flower piece is the perfect way to show you care since roses express love, gratitude, and warmth. Wives and fiancés will also adore it. Buy two or more Rosa Vila products and receive 15% OFF your purchase. Our rose fairytale necklace is included in this promotion. The offer instantly applies once you place the items in your cart. Plus, you get a free lifetime warranty with your purchase to ensure you can wear your new jewelry forever. Rosa Vila, a U.S.-based company, prides itself on transforming places, ideas, objects, and more into delicate pieces of jewelry. Our jewelry expresses love and fun, and there’s a piece for every woman. As an environmentally conscious company, we also package each item with eco-friendly, 100% recyclable materials.",
    "price": 2990.0,
    "listPrice": 3900.0,
    "prime": true,
    "dimensions": {
        "weight": 20.0,
        "length": 1700.0,
        "width": 150.0,
        "height": 30.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41mZf28ZhKL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/4161sH4jt5L._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31fVhRLSVUL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Hk-Wva0XL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51bVQmGHnEL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41zMgCKG%2BQL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41YkLNcKclL._US40_.jpg"
    ],
    "attributes": [
        {
            "name": "Style:",
            "value": "White Gold Plated"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        },
        {
            "node": "7192394011",
            "title": "Jewelry"
        },
        {
            "node": "7454927011",
            "title": "Necklaces"
        },
        {
            "node": "7454933011",
            "title": "Pendants"
        }
    ],
    "similar": [
        "B01JJBPQP4",
        "B0797RDPPG",
        "B075XM9TMH",
        "B00S5ZXJW8",
        "B071JQ7BCG",
        "B076GF99PK",
        "B073TRBFGW",
        "B01IX6PTU8",
        "B01M23X2AI",
        "B078WCMR6J",
        "B004NMSW7Y",
        "B07C54FJCD",
        "B073C4Z35Y",
        "B06Y63Q8MH",
        "B018A33686",
        "B017UC91O6",
        "B0716T4FLF",
        "B077K2SWLQ",
        "B077MW4D58",
        "B07BQSGTGB",
        "B072R37M86",
        "B007RJ8WOS",
        "B0783HQ1P5",
        "B07DXFK75L",
        "B06ZYLG56C",
        "B06XFMZX5W",
        "B07H2XVQPN",
        "B07BB5X962",
        "B00FBRB8ZI",
        "B07BPX3K6D",
        "B00P029YCS",
        "B06XWDY15P",
        "B01MZ4OJRS",
        "B07GWDMVLZ",
        "B07DJ23W2R",
        "B0733JXPVG",
        "B076JJLZM2",
        "B071RM5J5N",
        "B07FYH7YJY"
    ],
    "rating": "4.4"
}