{
    "asin": "B077Y52782",
    "title": "Amcrest UltraHD 4K (8MP) Outdoor Security POE IP Camera, 3840x2160, 98ft NightVision, 2.8mm Lens, IP67 Weatherproof, IK10 Vandal Resistant Dome, MicroSD Recording, White (IP8M-2493EW)",
    "brand": "Amcrest",
    "feature": [
        "EXPERIENCE ULTRA HD 4K - Observe high-quality footage with a Sony IMX274 Starvis Sensor progressive scanning image sensor, Ambarella S3L33M chipset and UltraHD 4K 8M- resolution (3840x2160). A super-wide 112° viewing angle allows you to see more detail and cover more ground to keep more of what you love safe. Power Over Ethernet (POE) for easy installation (POE injector or switch required; not included, sold separately). Manual pan/tilt via hand only.",
        "SMARTER, SAFER SECURITY - Utilize intelligent alerts that send notifications to your computer or smartphone via the Amcrest View app. Record events as soon as they happen and store them on a microSD (up to 128GB), Amcrest NVR, Synology, QNAP, NAS, FTP, Blue Iris or Amcrest Cloud",
        "ALWAYS RESILIENT - Whether it’s rain or shine, day or night, this 4K Camera features heavy-duty, weatherproof IP67 housing and IK10 vandal-resistant dome. With IR night-vision up to 98 feet, you can keep the people and places you love safe 24/7. Always stay in the know by recording at specific times based on your preference. ys stay in the know by recording at specific times based on your preference.",
        "FIND SOLACE IN THE CLOUD- Amcrest Cloud was created to ensure that you don’t miss a thing, no matter where you are. With an intuitive interface, you are able to live-stream your footage which enables you to play it back based on your preferences. Receive 4 hours of storage free with extra optional storage plans available for purchase.",
        "SIMPLE, RELIABLE, SECURE - At Amcrest, we want to ensure the safety of our customers, their loved ones, homes and businesses. You’ll receive a full 1-year US Warranty and Lifetime Support provided directly from Amcrest."
    ],
    "description": "This Amcrest camera is manufactured to the highest quality standards for durability against rain, dust, and snow. IP67 weatherproofing is joined by 8-Megapixel wide resolution, night vision 98ft. Easy DIY installation offers simplicity and convenience. Amcrest cameras also record and upload to an FTP as well as record to any Amcrest (or ONVIF compliant) Network Video Recorder (NVR) (Not Included). Each Amcrest camera features heavy duty IP67 metal housing, night vision, enhanced digital zoom, a 69°-112° viewing angle, smart motion alerts, email alerts and snapshots, advanced recording options, and secure SSL/HTTPS connection. With the Amcrest UltraHD, you'll never be out of the loop again. All purchases from Amcrest Authorized Retailers include a 1 Year Domestic Warranty plus Lifetime Support, making this quality engineered Amcrest camera one of the best values available for a video security purchase.",
    "price": 13994.999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 135.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41365kjj66L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41W-jkVkqFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51p-wS7iVdL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41GIr2tFyFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41dZ0r3wArL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "7161091011",
            "title": "Video Surveillance"
        },
        {
            "node": "898400",
            "title": "Surveillance Cameras"
        },
        {
            "node": "14241151",
            "title": "Dome Cameras"
        }
    ],
    "similar": [
        "B016UCNP08",
        "B078CYT7Y9",
        "B0743PQYS2",
        "B0744C9WXQ",
        "B06XT3D6YF",
        "B07BLQZVDK",
        "B0145OQTPG",
        "B01MG9EL4A",
        "B01DM6BDA4",
        "B07C9G3RKX",
        "B0727XJQLD",
        "B07C5JWK4K",
        "B0797583CP",
        "B078J2JVB2",
        "B075ZFBSZL",
        "B01M15WH9C",
        "B07GBGVN6T",
        "B07C7W91YR",
        "B07FCDMTCS",
        "B073V4STQR",
        "B00N2ZDXW2",
        "B0743WP62Q",
        "B07CXLYFMQ",
        "B072QLXK2T",
        "B073V5T4SY",
        "B074N2TRRR"
    ],
    "rating": "3.8"
}