{
    "asin": "B077B2Q9PZ",
    "title": "iPhone X Case,Soundmounds 3 In 1 Magnetic iPhone 10 Case Ultra Thin Slim Fit Reinforced Corner Soft PC+TPU+UV Protect Cover for iPhone X And Using For Car Mount. (Black)",
    "brand": "SoundMounds",
    "feature": [
        "IPHONE X CASE: Compatible with iPhone X inch case, Features a refined design, and lasting protection,anti-scrath,anti-fingerprint,anti-slip,anti-marks",
        "UlTRA SLIM FIT DESIGN:Simple, elegant. Phone case features a refined design, Maximum keep your Phone slim and provide Shock protection.",
        "NEW DESIGN MAGNETIC FEATURE:Hybrid Technology TPU Edge Matte Soft Bumer + Clear PC Back Panel+UV and it can use for car mount.",
        "EASY RESPONSE BUTTON: The volume and power buttons are easier and more precise for a truly consistent experience.",
        "SATISFACTION GUARANTEE: We believe that our products are so superior, we're offering a 30-day money back guarantee if you aren't completely happy"
    ],
    "description": "Keeping your phone in perfectly working can be difficult when you have a habit of dropping your phone or letting your kids play with it. That's why you need to keep it from ever getting that far with ultimate protection from the Soundmounds case designed for iPhone X. The cutouts on this case are perfect, all buttons and functions are totally accessible including the audio and charging port. Also, the volume control buttons and the power on/off are covered so you don't have to touch the phone's buttons. Modern Slim Grip. Innovative New Button Design. 3 in 1 TPU/PC/UV Slim Fit Protection. Magnetic Feature Using for Car Mount. Scratch Resistance,anti-fingerprint,anti-slip. Air Slim Cushion Shock Absorption Technology.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 4.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51jKVP8uTLL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51EgL8ohEQL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Tx9ARLkdL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51TRVSu4GRL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Black"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B075DBT1BD",
        "B07C6DJ2GF",
        "B075L5WNVS",
        "B0742YPR5F",
        "B0779639YM",
        "B075DC412Q",
        "B0798KXZ93",
        "B076JFWFNB",
        "B076JG55H9",
        "B075WQKJLH",
        "B077HYSZQM",
        "B07433R1NN",
        "B07BFV6Z98",
        "B07H23L168",
        "B075R7VNZY",
        "B075R85JR8",
        "B07H6FJJ62",
        "B077MD4Y7W",
        "B078KBL7B4",
        "B073DLZWX7",
        "B075R85PKQ"
    ],
    "rating": "2.3"
}