{
    "asin": "B0777VR29S",
    "title": "Galaxy Note 8 Screen Protector Tempered Glass (Replacement Set), [Liquid Dispersion Tech] 3D Curved Full Cover Dome Glass Easy Install by Whitestone for Samsung Galaxy Note 8 - Spare Kit (No UV Light)",
    "brand": "Dome Glass",
    "feature": [
        "LIQUID DISPERSION TECHNOLOGY: Our patented liquid glass evenly disperses over your entire screen, including existing scratches and scuffs, and hardens to create an impenetrable edge to edge barrier while repairing former cracks and imperfections.",
        "BEST COVERAGE: This Dome Glass protector is #1 in protecting your entire Galaxy Note 8 screen. Other competitors don't cover the rounded edges, which increases your risk of permanent damage by 15%",
        "LIMITED LIFETIME WARRANTY – Whitestone provides Limited Lifetime Warranty means that if your Dome Glass is damaged or worn, you could request replacement through Whitestone's webpage.",
        "BUBBLE-FREE INSTALLATION KIT: To prevent errors and air bubbles, our install frame and UV curing light are included with purchase. Quality is reflected through commitment, so make sure you have enough time and patience to get an undeniably perfect result.",
        "Designed in California - Samsung Mobile Accessory Partnership Program (SMAPP) Member - Patented in US, EU, KR, JP, CN and TW"
    ],
    "description": "Prevents scratches & impact from high surface hardness 9H Common 3D protectors does not guarantees the Edge touching sensibility. Dome Glass™ provides 100% touch sensibility Dome Glass™ does not use a dot layer so that makes Full Clear, Non-color and High transparency. Human eye-protection. Blue-light cut feature combined. 25% decrease of blue light.Due to the Full Screen Protection Design, this protector may Not Compatible with some Hard and Full Body case.* When putting on a phone case, press down on the screen protector too hard.For more information, check the FAQ page.The adhesive could spill out of glass, but it doesn't do any harm to device. Just wipe it out as instructed.The glasses of device and screen protector has variance so that we put adhesive 5% more than average, to make sure it fill out every corner.We will provide spare adhesive for 2nd try, together with rework instruction. We estimate the failure rate almost zero, unless device is bent or the curve of edge is out of range.",
    "price": 3499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 26.25,
        "length": 810.0,
        "width": 470.0,
        "height": 180.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51qp701C9JL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51wlTRJualL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Q-1lo5iOL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/410EgnoO%2B3L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407755011",
            "title": "Accessories"
        },
        {
            "node": "2407781011",
            "title": "Screen Protectors"
        }
    ],
    "similar": [
        "B075FXRQD3",
        "B07FYWDM5D",
        "B075DGM5SP",
        "B07GMC31GQ",
        "B074GB37V7",
        "B01M0SM7Q1",
        "B07738H7CV",
        "B075D1PR6Y",
        "B079YF5VS7",
        "B07GPZ8L96",
        "B079BPG7CC",
        "B0749RSMHZ",
        "B074SBJ6HH",
        "B077BVXNNK",
        "B07FXLSTJQ",
        "B07GDLHV3J",
        "B07GDDDJYN",
        "B07B9NXL2B",
        "B079H6RLKQ",
        "B07CZ9GBPS",
        "B074SYVC1B",
        "B07G9ZSN8V",
        "B072M741FR",
        "B07C9FFV27",
        "B075J9DMZV",
        "B07FY25MWP",
        "B075R6LFQX",
        "B074G1W2RC",
        "B07FB65FP8",
        "B07G9SGVR9",
        "B07796Q91N",
        "B07D1CG8QY"
    ],
    "rating": "3.5"
}