{
    "asin": "B0784TBCZK",
    "title": "OUNNE iPhone X Waterproof Case, Underwater Full Sealed Cover Snowproof Shockproof Dirtproof IP68 Certified Waterproof Case with Built-in Screen Protector for iPhone X (5.8in)-Black-Mirror",
    "brand": "OUNNE",
    "feature": [
        "【Waterproof】：Designed for iPhone X. IP68 standard Waterproof, submersible to over 10ft for 1 hour. Protect your phone from water, rain, perfect for underwater, diving and daily use.",
        "【Premium material】：Easy snap-on shell installation, Full of top-level TPU material, scratch-resistant and shatterproof, fixed and stable.",
        "【Dual protection】：360-degree full body protection, designed to exceed Military Standard 810G-516, guard your phone drop from 6.6ft/2m height. Fully-sealed cover stops any dirt and dust.",
        "【Sensitive Touch】：Compatible with iPhone X, perfectly with iPhone X touch ID function, power and volume buttons, front cover with built-in screen protector.",
        "【Support Wireless Charging】: Clear and flat back cover will not block the wireless charging signal, make your iPhone X charging fast with your wireless chargers without taking out the phone from case"
    ],
    "description": "Specifications Product Name: OUNNE waterproof iphone X case (5.8 inch) Material: TPU Color: Black-Mirror Outstanding Features: -- Designed for iPhone X,fits seamlessly with your iPhone X and is equipped with precision cutouts to maintain the original phone experience. -- With waterproof protection certified to IP68, it provides your phone with all around protection for Waterproof, also Snow proof, Shock proof, Dust proof. -- The transparent front and back cover for camera lenses enable high-quality, high-definition photos and videos. How to install * Before installing, you need to remove the screen protector from the phone. * Please review and check the user manual to ensure correct installation to make the case fully sealed. * Do the water test before putting the phone into water and adjust the volume to max for clearer sound. Package include 1 x OUNNE Waterproof Case for iPhone X. 1 x Lanyard. 1 x Cleaning Cloth. 1 x User Manual.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 800.0,
        "width": 400.0,
        "height": 90.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41spzp-6F6L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51b9ti3eIxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/516JPJQEHCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41F2RUY0KrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/510JA8KKcTL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/411vv8%2BeFiL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41TT9JA%2BkkL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        }
    ],
    "similar": [
        "B07GTMN6G8",
        "B07CV4QF1Q",
        "B07GZM3PRZ",
        "B01KV4FIOC",
        "B07GTC62F1",
        "B07F7WVMF8",
        "B077JSQLH4",
        "B073V7NNQG",
        "B07BFBPDQG",
        "B0762K6P37",
        "B075DZQ3HV",
        "B074X4SF82",
        "B06ZYQNLVV",
        "B07GFJ2YD6",
        "B07FPCPJTX",
        "B07FP86QJ8",
        "B074V4BKJ6",
        "B07116R8WC",
        "B07H29YLV3",
        "B07GT9VYKF",
        "B07D3RKZ1M",
        "B079DJKM6G",
        "B074V3CM1C",
        "B07H33SQFB",
        "B073DLZWX7",
        "B077SDRFCD",
        "B075F2HQ4D",
        "B076V4H8BR",
        "B01F9RGJJO",
        "B074X1F2NS"
    ],
    "rating": null
}