{
    "asin": "B078ZPLQV6",
    "title": "Door Knob Safety Covers ChildProof - 4 Pack- Door Knob Covers Safety - Child Proof Safety Locks",
    "brand": "TruBabe",
    "feature": null,
    "description": "TruBabe Child Proof Door Knob Safety Cover helps protect your child from harm by using ergonomically design grip twist turn door knob covers for kids. Child safety cover for door is made of soft heavy-duty plastic with rounded edges. Durable and strong cover and is tamper resistant. Door covers baby prevent little kid from playing and using doors on their own and from getting injured. Prevent access to rooms and protect against accidental lock outs. This safety child locks for door is easy for adults to use and grip and yet hard for kids to operate. No cutting fingers and not filmsy. Unlike other baby child proofing TruBabe is very easy to install as well as to open, it does not keep on opening and falling off. Sleek design blends with home décor and perfect baby shower gifts too. Designed well to perfections and to blend in your doors. Protect and fits perfectly in your home! ❤️Ergonomically design to protect children from harm ❤️Fits All Interior/Standard Door Knobs❤️Lead Free, SGS Compliant, Reach Compliant, Non Toxic, Eco-friendly Material❤️No tools required for installation, No Drills, No Hassle!❤️Sleek design blends well in your home decor❤️Quality material soft to touch, durable, tamper resistant 1.) Assemble halves around door knob2.) Make sure button is aligned below the locking ring, CLICK into place to secure.3.) Check tabs are aligned properly and fully inserted on both sides. Door knob cover should spin freely after assembly. 1.) When removing safety cover always make sure to separate halves by putting apart of the the door knob cover.2.) This product is a deterrent and not a substitute for adult supervision.3.) Never leave children unattended. Weight: 4.2 ounces/0.12 kgDimension:13.1 x 3.6 x 1.9\"1x 4 pcs White Sturdy Cover",
    "price": 999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 1310.0,
        "width": 360.0,
        "height": 190.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41NzeUhrrAL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51%2B9brHqNCL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/513rvSZhKhL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41rKYzkdLxL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41fFD5feeKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51x-lA2ROFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51K8HUeq77L._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "165796011",
            "title": "Baby Products"
        },
        {
            "node": "166863011",
            "title": "Safety"
        },
        {
            "node": "166864011",
            "title": "Bathroom Safety"
        }
    ],
    "similar": [
        "B079P7FV7L",
        "B00IZO9WKM",
        "B01BTUNK5Q",
        "B071GWJX4D",
        "B001YON5PS",
        "B071RD46LX",
        "B005QU55EA",
        "B078ZPNDF1",
        "B000MF518O",
        "B07DN895WP",
        "B07BMNXZ2Q",
        "B01K3SOW98",
        "B07D5KVQWM",
        "B07F9KN39C",
        "B078ZP6YFN",
        "B07BFFVWLS",
        "B07BT39C8Z",
        "B0023KTPCE",
        "B007A2ZP6K"
    ],
    "rating": null
}