{
    "asin": "B078SQ7GWK",
    "title": "Essential Phone in Halo Gray – 128 GB Unlocked Titanium and Ceramic phone with Edge-to-Edge Display",
    "brand": "Essential",
    "feature": [
        "With a matte finish to both the titanium and ceramic, this Amazon exclusive Essential Phone has a more industrial look while maintaining its elegant design",
        "Stunning edge-to-edge Quad HD display—the largest screen-to-body ratio of any smartphone. So you get a massive screen, but on a phone that still fits comfortably in one hand",
        "13MP Dual RGB + Mono Rear camera with Portrait Mode and 4K video recording . Get more natural looking shots and incredible high-resolution video",
        "With a matte finish to both the titanium and ceramic, this Amazon exclusive Essential Phone has a more industrial look while maintaining its elegant design",
        "Stunning edge-to-edge Quad HD display—the largest screen-to-body ratio of any smartphone. So you get a massive screen, but on a phone that still fits comfortably in one hand",
        "13MP Dual RGB + Mono Rear camera with Portrait Mode and 4K video recording . Get more natural looking shots and incredible high-resolution video",
        "Huge 128GB of storage, included. Save all of your photos and videos without worrying about running out of space. Battery: 3040mAh",
        "Never charge your accessories again. With the revolutionary Click Connector, your phone attaches to accessories, magnetically—and even powers them. No cables or adapters needed",
        "Includes Amazon Alexa. Get real-time answers to questions, shop for items on Amazon, control devices around your home, access Alexa skills, and more, all with the sound of your voice",
        "Essential Phone receives rapid security and OS updates and now includes the latest version of Android 9 Pie",
        "Award-winning MQA technology to deliver studio quality music listening on the go",
        "A 3-month TIDAL HiFi subscription for new and existing Essential Phone customers with access to thousands of MQA tracks. Visit essential.com/audio to redeem the Tidal offer",
        "NOTE: Refer the User Manual before use"
    ],
    "description": "Founded by the creator of Android, the Essential Phone has all the features you care about most without a bunch of gimmicks. A large, edge-to-edge display, 128GB of storage, all-day battery life, fast ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 140.0,
        "length": 280.0,
        "width": 30.0,
        "height": 560.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B079SLHBSN",
        "B016LCD9WG",
        "B07C81K4PV",
        "B0786J12CR",
        "B07FNGQK33",
        "B079YTK8XV",
        "B077BKRHD1",
        "B0796ZRVBC",
        "B07GCPYWY1",
        "B07C88H75B",
        "B0791VS3N9",
        "B07FWNBDPP",
        "B07CVMXVMK",
        "B0762F2T19",
        "B0762J5SRW",
        "B079G4CJRJ",
        "B0789TN6XK"
    ],
    "rating": null
}