{
    "asin": "B078PG14V6",
    "title": "TaoTronics Bluetooth Headphones Wireless Earbuds Sport Earphones 9 Hours 4.2 Magnetic Lightweight & Fast Pairing (CVC 6.0 Noise Cancelling Mic, Snug Silicon Earbuds, Magnetic Design) Blue",
    "brand": "TaoTronics",
    "feature": [
        "IPX6 Splash Proof Build: Nano coating protects the earphones when exercising and during rain",
        "Lightweight and Comfortable: Sports headphones feature an ergonomic design with highly elastic, adjustable silicon earbuds; weighs barely 0.53 oz / 15 g",
        "9 Hour Battery Life: Charge just 2 hours for 9 hours of audio; includes an iOS battery indicator so you know the Bluetooth earbuds’ remaining battery life",
        "Crisp Voice Calls: cVc 6.0 Noise Cancelling pairs with a MEMS mic to reduce vocal interference and enjoy clear and easy communication",
        "Secure Magnetic Design: Magnets prevent the headphones from sliding off when not in use, just hang around your neck"
    ],
    "description": "Give yourself that extra motivation when exercising with the TaoTronics Wireless Headphones Stereo Earphones. Designed as Bluetooth headphones for running, these lightweight in-ear headphones weigh only 0.53 oz / 15 g and are incredibly comfortable thanks to ergonomically shaped in-ear earbuds. With long-term use in mind, the highly elastic silicon covering can withstand wear-and-tear for those that exercise or listen to music every day. IPX6 Splash Proof Build If you hit the track or lift weights, then you’re bound to build up a sweat. Thankfully, the headphones come with an inner nano-coating that protects them from moisture. It’s not only sweat that it protects, but also light rain - for those that exercise no matter the weather. Secure Headphones with Built-In Magnets When not in your ears, keep the Bluetooth earphones together with built-in magnets. Not only do the magnets offer a way to prevent the headphones from sliding off your shoulders when not in use, they also offer a sporty, yet secure way to hold them. Clear and Easy Communication Talking on the phone can be fraught with problems including signal drops, background noise, or voice transmission errors. To combat this, the headphones feature cVc 6.0 and a MEMS microphone. With built-in cVc 6.0 noise cancellation technology, background disturbances are reduced. The MEMS microphone is an upgraded version of the traditional microphone, which enables a higher sensitivity and a greater performance so your voice transmits with ease. 9 Hour Battery Life with iOS Indicator If you’re running a marathon or planning a hike, you’ll have more than enough music thanks to a generous 9 hour battery. When it eventually runs out, it can be fully recharged after only 2 hours. For those connected to an iOS device, a handy indicator will show on your device’s screen so you know how much headphone battery is left.",
    "price": 2599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": 60.0,
        "width": 10.0,
        "height": 10.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/412FnIngXjL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Mu2aeTgpL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51-Ids1CIwL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51oXtroT%2BfL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51bq4r40aVL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Hu0duvpuL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51vCg6hg2YL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "172541",
            "title": "Headphones"
        },
        {
            "node": "12097478011",
            "title": "Earbud Headphones"
        }
    ],
    "similar": [
        "B06ZYX6Y1T",
        "B07DZQ14VJ",
        "B06Y686X78",
        "B07DB5WXVS",
        "B07D21P6SL",
        "B07DXQ7Y3F",
        "B074LT4HNV",
        "B07DFFCZ1F",
        "B07C41JWLG",
        "B07D21Q2Q4",
        "B06WWFCY46",
        "B079BP8ZY7",
        "B075CBHN9M",
        "B074QKS8RK",
        "B07D4LM957",
        "B075SYJCQN",
        "B078PGCBX9",
        "B01L160DLW",
        "B07GQPZNDL",
        "B07C77M3HL",
        "B0798L236J",
        "B07FPG94RP",
        "B07G15B5QV",
        "B07D2285QH",
        "B07FZKX3GC",
        "B07DNY2V5D",
        "B07CWRH273",
        "B07C7HMF2D",
        "B07D744CW7",
        "B075NRNZWD"
    ],
    "rating": "3.3"
}