{
    "asin": "B0788JXFXB",
    "title": "Comfyable Laptop Sleeve for MacBook Pro 15 Inch (2016-2018 Models) | Waterproof Computer Case Provides Safe Storage & Stylish, Sleek Design",
    "brand": "Comfyable",
    "feature": [
        "▶ MACBOOK PRO 15 INCH CASE ⋆ - Our laptop case is specifically designed for Apple MacBook Pro products. Specifically, our laptop sleeve fits all MacBook Pro 15\" laptops (2016-2018 Models). Interior dimensions: 14.3 x 9.8 x 0.7 Inches allows for use with a wide variety of laptop and tablet models.",
        "▶ ULTIMATE PROTECTION & SECURITY - Not all laptop cases or computer backpacks provide enough secure padding to protect your Apple MacBook Pro. Our MacBook Pro sleeve contains superior EPE foam padding to provide superior protection from shocks and bumps.",
        "▶ SOFT MICROFIBER LINING & ADDITIONAL INNER COVER - This 15 inch MacBook Pro case features a protective neoprene flap in the top interior providing extra snug protection and prevents rubbing the zipper. The soft interior fleece lining our 15 inch MacBook Pro case provides a scratch free environment, so no worries that your MacBook will get scratched or damaged.",
        "▶ WATERPROOF DESIGN PROVIDES PEACE OF MIND - No water allowed! The exterior of this MacBook Pro case is made of durable and waterproof polyester material. You will never have to worry about spilling a drink or walking through the rain when your laptop is in our MacBook cases.",
        "▶ MINIMAL, SLEEK & ELEGANT DESIGN - Let’s face it, everyone loves Apple's minimal simple and elegant design style, of course you want all of your laptop or tablet accessories to reflect that same style. That’s why our light as a feather MacBook Pro Sleeve is perfect in order to protect your laptop with style"
    ],
    "description": "Sleek, Slim, Thin and Elegant, our MacBook Pro 15 case is the smart solution for every proud laptop user that respects the basic principles of style! A laptop or tablet is a significant investment and a laptop or tablet in a mobile environment is susceptible to any number of unfortunate accidents such as drops, falls, liquids, scratches. Purchase a Comfyable MacBook Pro 15 case and know you made a wise choice protecting your investment You need it every day and all your important files, photos, schedules and emails are saved there. That’s why you need a Mac Pro 15 inch case to treat your laptop with care and protect something so vital. Caught in the rain commuting? Careless hands and spilled coffee? Never fear! Our MacBook 15 inch casefeatures a water resistant fabric exterior layer in order to keep your laptop safe from liquids. Do you have a friend who is addicted to his/her laptop? If your answer is yes, put a smile on your friend’s face! A Comfyable MacBook Pro 15 inch cover is a perfect gift idea!",
    "price": 2599.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 45.0,
        "length": 1400.0,
        "width": 950.0,
        "height": 70.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41moMYF%2BnTL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/511Iy4TBcYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HyQBEx45L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/511Iy4TBcYL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41AJALuDgeL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/412-0u06ukL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51EIIAkRSsL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "1"
        },
        {
            "name": "Color:",
            "value": "15\" for New Mac Pro 2016-2018"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "3011391011",
            "title": "Laptop Accessories"
        },
        {
            "node": "172470",
            "title": "Bags, Cases & Sleeves"
        },
        {
            "node": "335609011",
            "title": "Sleeves"
        }
    ],
    "similar": [
        "B0758GFGLV",
        "B01MFEHFKH",
        "B01MRKLH27",
        "B07CRLHRMC",
        "B071RK6839",
        "B07BGTV9J4",
        "B0799HW9GV",
        "B07841WDX8",
        "B01NBBBNQ7",
        "B07FMLZCR5",
        "B01N0TOQEO",
        "B071NHXZZ9",
        "B01M8O9OSE",
        "B0799CTDF7",
        "B01K49JZ52",
        "B0799FLG1F",
        "B076BGJXTG",
        "B071KX3WZL",
        "B01AFK48U2",
        "B079M5NZM5",
        "B07FF4QTSD",
        "B072DSNPRV",
        "B0799J8BPR",
        "B01HCF15HC",
        "B015NSL4XK",
        "B075FW7H5J",
        "B01LYWWALF",
        "B0761WK7JF",
        "B01MSLWTGP",
        "B07D6BD4X1",
        "B01EY70KYK",
        "B014LRKDWM",
        "B01LZI3O4K",
        "B015Z7XE0A"
    ],
    "rating": "4.5"
}