{
    "asin": "B078GQPPY5",
    "title": "HydroxycutPro Clinical Weight Loss",
    "brand": "Hydroxycut",
    "feature": [
        "POWERFUL WEIGHT LOSS - Hydroxycut is formulated with a scientifically researched key weight loss ingredient to produce significant weight loss results",
        "BURN CALORIES - Promotes increased energy expenditure to help you burn more calories. Do not exceed two (2) caplets in a 4-hour period and/or four (4) caplets in a 24-hour period. Do not take within 5 hours of bedtime. Consume 8 to 10 glasses of water per day. Read the entire label before use",
        "NATURALLY SOURCED ENERGY - Naturally sourced coffee extract has been included to give you a clean energy boost",
        "ESSENTIAL VITAMINS - Vitamin D has been added to help support general good health and B vitamins to help metabolize carbs, fats and proteins",
        "APPLE CIDER VINEGAR - This popular ingredient has also been added in a convenient, east-to-swallow capsule format for those who dont enjoy the tart taste of vinegar"
    ],
    "description": "Hydroxycut is the perfect weight loss supplement to help you reach your weight loss goals. Unlike other weight loss products, Hydroxycut is formulated with a weight loss driver backed by 2 scientific studies. The weight loss product continues to help countless people on a daily basis also contains caffeine anhydrous to give you fast-acting energy and also help boost your metabolism. Losing weight with the new advanced Pro Clinical Hydroxycut weight loss formula has never been more convenient. Subjects using the key weight loss ingredient in Hydroxycut (C. canephor Robusta) for 60 days lost an average of 10.95 lbs. with a low-calorie diet, and 3.7 lbs. in a separate 8-week study with a calorie-reduced diet and moderate exercise. The powerful formula is designed to support your weight loss goals no matter what diet you may be following including dash diet, Mediterranean diet, Atkins diet, zero sugared diet or a ketogenic diet.",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": null,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/513p37QVgJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41udDvsLVQL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YLz1XlL-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/512wMEp9cyL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31U1GChkk7L._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "2 Bottles (72 Caps)"
        }
    ],
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "3764441",
            "title": "Vitamins & Dietary Supplements"
        },
        {
            "node": "3774931",
            "title": "Weight Loss"
        },
        {
            "node": "3775151",
            "title": "Supplements"
        },
        {
            "node": "6939045011",
            "title": "Fat Burners"
        }
    ],
    "similar": [
        "B01E1G40X6",
        "B07GZ579D9",
        "B071X6246Z",
        "B07BKTW31T",
        "B07GM1ZN95",
        "B00UNPM9AG",
        "B000FZ001Y",
        "B07BQPJZ76",
        "B017DCF2VE",
        "B07G7FFSTN",
        "B07C31QT2F",
        "B07FBV7M84",
        "B07H7WMWD2",
        "B07HB5QVHD",
        "B01GS1OM8U",
        "B07G2SJ252",
        "B07F1W9S4N",
        "B07GDRYCG9",
        "B07G7GFK6P",
        "B07FBX7C14",
        "B07BRFL562",
        "B07H2MNY5V",
        "B07GZ6RSN4",
        "B07H8KZXMH",
        "B07FQ4DJHP",
        "B075FVJ31F",
        "B07DRPQV52",
        "B07GZ3RW6K",
        "B07H84PT5B"
    ],
    "rating": null
}