{
    "asin": "B0792ZY2B2",
    "title": "Men's Wallet, Minimalist Vintage Cowhide Leather Wallet With zipper pocket for men",
    "brand": "Bthdhk",
    "feature": [
        "▶ 【Men's Genuine Leather Wallet】-- 100% genuine hand-crafted retro cowhide leather, soft and comfortable. The lining was made of polyester, smooth and durable.",
        "▶ 【Minimalist & Stylish Mens Wallet】-- 10 card slots, 3 inside slots, 1 ID window, 2 Purse Slots, 1 long slots. allow for quick access when traveling or at the store /working place. It’s easy to carry all your important cards, meet all your daily needs.",
        "▶ 【Unique Texture Features】-- As genuine cowhide leather wallet, have natural special scratches, it will become brighter and brighter over time.",
        "▶ 【GIFT BOX PACKING】-- It is one of the most special Men's gifts for Bridesmaids, Birthdays, Anniversaries, Father's Day, Christmas and other Special Occasions.",
        "▶ 【WHAT YOU GET】-- Bthdhk Mens Leather Wallet, Together with 30 Days Money Back, One Year Guarantee and Friendly, Easy-to-reach Support."
    ],
    "description": "● There may be a bit leather smell when get the wallet, since it's a new & unused leather product. You could open the package and put it in a ventilate place for a few days, then the smell will fade away. ● Prevent it from water, moisture and especially alcohol or products contained alcohol. ● Distinguish real leather from PU leather: the real leather with natural leather grain and natural touch feelings with smell like protein when burn it;there're natural pores on the leather surface and smell like leather instead of plastic. ● If there are scratches or stains on the surface, you can coat it with a little hand cream and then use a soft cloth to wipe it. Then it will be renewed. ● As genuine cowhide leather wallet, it will become brighter and brighter over time. ◆ This purse made using high quality head layer cowhide, there may be wrinkles, scar, scratch is this real leather natural phenomenon, is also a important symbol for the identification of genuine leather. Leather surface texture shows its unique natural beauty, the style that restore ancient ways and wild. When you blow it, scratches will appear, you can use your fingers to wipe, then scratches will reduce or disappear. Use the longer, the more beautiful. ◆ Leather avoid exposure in hot sun or fire and extrusion;Avoid close to flammable items;Avoid overload;Avoid rain,lest make the deformation;leather harden and lustre dim. ◆ When you collect it,please use dry towel to wipe the dirt on its surface, then use high-grade leather cleaning fluid (such as Pledge) coating layer,place it at the dry and shade place after dry.",
    "price": 2799.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 30.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51NvyqaKZyL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51u3u%2Bk8I3L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51RrStg%2BafL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/519%2BRLyWLqL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51jvcWP%2BsiL._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/61HtnGxr-4L._SR38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ezItDu8nL._SR38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "Retro Brown"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147441011",
            "title": "Men"
        },
        {
            "node": "2474937011",
            "title": "Accessories"
        },
        {
            "node": "7072333011",
            "title": "Wallets, Card Cases & Money Organizers"
        }
    ],
    "similar": [
        "B01JKYB906",
        "B06ZZSQTRG",
        "B076D4Y8B3",
        "B071GKGY15",
        "B072HL96R2",
        "B01M7N5G8Q",
        "B01FCYQTC6",
        "B076D2BFVV",
        "B01MDK9E3J",
        "B071GKGSG2",
        "B07G2L4C6K",
        "B07C3NWPCF",
        "B07BVLWT9H",
        "B06XSC1C19",
        "B01LLGL7R6",
        "B075YB8ZZ4",
        "B0711VQC6V",
        "B073W4KJWL",
        "B01M61SOGZ",
        "B07BF98CKX",
        "B076VRGSDR",
        "B06WLL9M15",
        "B0792YS13L",
        "B07DPNCWVG",
        "B07F7TW6VD",
        "B07118XW6Y",
        "B079KN47N2",
        "B00ZHQ5YVM",
        "B0727T62BT",
        "B071P4VSRJ",
        "B0792Z7K71",
        "B0714K4RGR",
        "B0728DTFPY"
    ],
    "rating": "4.3"
}