{
    "asin": "B0796YHDCL",
    "title": "Amcrest 1080P WiFi Outdoor PTZ IP Camera Pan Tilt Zoom (25x Optical Zoom) Wireless Security Camera Speed Dome, 328ft Night Vision, IP66 Weatherproof, 2-Megapixel, IP2M-858W",
    "brand": "Amcrest",
    "feature": [
        "BIGGER IS BETTER - This outdoor WiFi PTZ IP Camera delivers brilliant 1080P video at 30fps using the the latest Sony STARVIS CMOS IMX290 2MP image sensor and Ambarella Chipset S3L55M. Utilize the PTZ feature with 25x Optical Zoom and 16x Digital Zoom as well as 360° pan and 90° tilt to ensure you'll catch every detail and every angle.",
        "SMARTER, SAFER, SECURITY - Utilize intelligent alerts that send notifcations to your computer or smartphone via the Amcrest View app. Record events on this outdoor PTZ camera as soon as they happen and store them on your computer, MicroSD (up to 128GB), NAS, Amcrest NVR or Amcrest Cloud.",
        "ALWAYS RESILIENT - Whether it's rain or shine, day or night, this WIFI outdoor pan tilt camera has an IP66 rating which means its built to endure whatever mother natures throws its way. Once nighttime sets in, innovative starlight technology and IR LEDs helps this camera see up to 329 feet at night even in ultra-low light.",
        "FIND SOLACE IN THE CLOUD - Amcrest Cloud was created to ensure that you don’t miss a thing, no matter where you are. With an intuitive interface, you are able to live-stream your footage which enables you to play it back based on your preferences. Receive 4 hours of storage free with extra optional storage plans available for purchase with this outdoor ptz camera.",
        "SIMPLE. RELIABLE. SECURE. - At Amcrest, we want to ensure the safety of our customers, their loved ones, homes and businesses. All Amcrest wifi ptz cameras features HTTPS and SSL encryption to ensure data privacy as well as a full 1-year US Warranty and Lifetime Support provided directly from Amcrest."
    ],
    "description": "The Amcrest ProHD 2 Megapixel WiFi PTZ IR Speed Dome helps you stay in touch with what you love anytime, anywhere. With its quick mobile setup process, you will have secure access to your camera's video stream in no time. Stream live and playback recorded video of your home, your kids, your pets, or your business on the go with the Amcrest View app. Amcrest Cloud offers optional cloud recording with free live viewing and 4 hours of free video storage accessible from any device including Apple Mac, Windows PC, iPhone, iPad or Android devices. Amcrest cameras also record and upload to an FTP as well as record to any Amcrest (or ONVIF compliant) Network Video Recorder (NVR) (Not Included). This Amcrest camera features enhanced 25x optical zoom, a remote 360° viewing angle, smart motion alerts, email alerts and snapshots, advanced recording options, and secure SSL/HTTPS connection. With the Amcrest ProHD, you'll never be out of the loop again. Amcrest cameras are compatible together with Foscam cameras only when using Amcrest Cloud, Amcrest NVRs, Blue Iris for Windows PC, Live Cams Pro for iOS and TinyCam Monitor for Android.",
    "price": 39999.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 1175.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41q4ZrjFOML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41eTsNECRqL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41Nb-tLy%2BEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51gx3LORv9L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41ETe2jPqHL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "502394",
            "title": "Camera & Photo"
        },
        {
            "node": "7161091011",
            "title": "Video Surveillance"
        },
        {
            "node": "898400",
            "title": "Surveillance Cameras"
        },
        {
            "node": "14241151",
            "title": "Dome Cameras"
        }
    ],
    "similar": [
        "B01M0IHF9K",
        "B07GBFQJCC",
        "B0722Q49SK",
        "B01M15WH9C",
        "B079GV151L",
        "B07FH6V5QC",
        "B0797583CP",
        "B072LBQD12",
        "B01HTYW2Q4",
        "B073V4QRXQ",
        "B07C9G3RKX",
        "B076FDN3JV",
        "B07DLTKZCW",
        "B071YPNMN1",
        "B01I01Z1M2",
        "B071ZFHTZN",
        "B0777T4L4F",
        "B075P8HCT5",
        "B01L9SHSRE",
        "B01B4BKJOK",
        "B07C7W91YR",
        "B075FZ1X1N",
        "B01MDIYVI9",
        "B0722R3WV5",
        "B016UCNP08",
        "B076HPP45Q",
        "B00M5P7HCW",
        "B07GBGVN6T",
        "B0743PQYS2"
    ],
    "rating": "3.8"
}