{
    "asin": "B079ZWT7L8",
    "title": "Xiaomi Redmi Note 5 Pro/Note 5 Screen Protector,KuGi 9H Hardness HD clear Bubble Free Installation High Responsivity Tempered Glass For Xiaomi Redmi Note 5 Pro/Note 5 smartphone(Transparent)",
    "brand": "KuGi",
    "feature": [
        "Compatibility: Specially designed for Xiaomi Redmi Note 5 Pro/Note 5, has precise cutouts for speakers, charging ports, audio ports and buttons. While featuring raised bezel to life screen and camera off flat surface.",
        "High Quality: Creative new formulas in hard case material helps extend the life cycle of the case, anti-yellowing and relive-aging remain the original look of the case. It will not get deformed after taking it off and putting it back on multiple times because it is highly flexible and can against bumps to your Xiaomi Redmi Note 5 Pro/Note 5.",
        "Minimalist Style: The ultra slim design makes the case nearly invisible and preserves its original beauty, also extremely easy to handle and hold without bulk.",
        "Compatibility: Specially designed for Xiaomi Redmi Note 5 Pro/Note 5, has precise cutouts for speakers, charging ports, audio ports and buttons. While featuring raised bezel to life screen and camera off flat surface.",
        "High Quality: Creative new formulas in hard case material helps extend the life cycle of the case, anti-yellowing and relive-aging remain the original look of the case. It will not get deformed after taking it off and putting it back on multiple times because it is highly flexible and can against bumps to your Xiaomi Redmi Note 5 Pro/Note 5.",
        "Minimalist Style: The ultra slim design makes the case nearly invisible and preserves its original beauty, also extremely easy to handle and hold without bulk.",
        "Shock Absorption Protection: Impressive shock absorbing protection with tough impact resistance and specialized raised bezels to shield the screen while safely lifting away from flat surfaces.",
        "Screen and Camera Protection: Precision raised camera and front bezels maintain a smooth tapered lip to safely protect the camera and enhanced display screen from touching flat surfaces."
    ],
    "description": "Xiaomi Redmi Note 5 Pro/Note 5 case, KuGi High quality ultra-thin Hard Cover Case For Xiaomi Redmi Note 5 Pro/Note 5 smartphone Compatibility This case is specially design for Xiaomi Redmi Note 5 Pro/ ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 22.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B01HQWR8CM",
        "B07BHMW95C",
        "B07D856BVR",
        "B07BHLL5ZX",
        "B07BK41ZRZ",
        "B07D82MTZL",
        "B00GMM28LO",
        "B07CZS8W5Y"
    ],
    "rating": null
}