{
    "asin": "B079ZBDL7D",
    "title": "totallee Pixel 2 XL Case, Thinnest Cover Premium Ultra Thin Light Slim Minimal Anti-Scratch Protective - For Google Pixel 2XL (Really Blue)",
    "brand": "totallee",
    "feature": [
        "ULTRA THIN. Only 0.02 inches. No bulk. The ultimate thin case if you are looking for elegant protection without adding bulk to your pocket or purse. This Pixel 2 XL case is slim, lightweight and one of the thinnest cases you can find",
        "MORE GRIP. Most ultra thin cases are too smooth and slippery – not this one. For extra anti-slip grip this case features a slightly brushed finish that helps prevent your Pixel 2XL from slipping out of your hands",
        "THIN BUT PROTECTIVE. This case for the Pixel 2 XL wraps all around your phone and features a raised fingerprint sensor ring for extra protection when you put it down. Get that extra peace of mind knowing your phone is protected from scratches, bumps and scuffs. While other cases are made of cheap, hard plastic, this case is manufactured using flexible yet sturdy polypropylene that is more durable",
        "PREMIUM DESIGN. This case features no visible branding for a clean, classy look. Well designed and guaranteed to fit perfectly. The material is semi-transparent and slightly see-through. This keeps your Pixel 2 XL looking cool and pristine while showing off its original design",
        "100% SATISFACTION GUARANTEE. Something happen to your case? They’ll send a free replacement. Don’t love your case? They’ll issue a full refund. Just contact totallee directly to take advantage of the best 2 YEAR WARRANTY around. The California based company offers quality you can trust. Totallee is dedicated to providing superior slim Pixel cases to protect your valuable investment"
    ],
    "description": "This case is guaranteed to fit the new Pixel 2XL from Google. Installing this case is easy and the fit is tight and secure. This is the perfect case if you want extra protection without adding bulk. At only 0.02 inches it is one of the thinnest cases in the world. The perfect case for everyday scratch and bump protection. The textured finish adds extra grip that helps you hold on to your Pixel 2 XL better. The case wraps all around your phone protecting all sides. A raised ring protects the fingerprint sensor. The Scarf is an understated and elegant case for people that like the beautiful design. It adds protection while keeping your Pixel 2 XL as pure as possible. Well-made simplicity that is functional, sleek and goes almost unnoticed. The precise cutouts make it easy to use with all chargers or headphone adapters. It works with all screen protectors. Your order is risk-free and includes a 2 year warranty from totallee. It is super thin. It adds grip (most other thin cases are slippery). It protects the camera and wraps all around your Pixel 2 XL. The design and fit are precise. It is branding free and looks sleek. Your Pixel 2 XL will look as close to original and case-free as possible. Made by an American company. It is built to last and backed by a solid 2 year warranty. Ships in totallee retail packaging. This thin case offers the best value if you want an ultra slim Pixel 2 XL case",
    "price": 1798.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 13.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41nF0bYOVJL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/31gMxf9wOTL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41-kCEwn8yL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BsCcE2dpL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41mfRKtmZ6L._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/514ZUUdFngL._SX38_SY50_CR,0,0,38,50_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51ctyFVHyPL._SX38_SY50_CR,0,0,38,50_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        },
        {
            "node": "3081461011",
            "title": "Basic Cases"
        }
    ],
    "similar": [
        "B0765XCLZ2",
        "B077Z1162M",
        "B078TPN753",
        "B078TPX59F",
        "B076BJG8YF",
        "B075RX9MRB",
        "B077Z4VCTB",
        "B077JLSFC8",
        "B0711Z5SB4",
        "B07475C1VT",
        "B0771JZZTH",
        "B07CTTWLPT",
        "B077LK7PZQ",
        "B076DRHYLC",
        "B07CRLG87W",
        "B077T5ZXWJ",
        "B076X4YGHG",
        "B078TP1XP3",
        "B07DH6DD2D",
        "B075WW69PS",
        "B07475TXJQ",
        "B07FKFXBZ5",
        "B079ZBC3Q8",
        "B07DB44Y4V",
        "B077LLMXY2",
        "B078TQ6GMQ",
        "B07CX6SZKN",
        "B0747813GV",
        "B06XNRPXLD",
        "B07GGZ9ZVC",
        "B077LF77JM"
    ],
    "rating": "3.4"
}