{
    "asin": "B079Z2SCP3",
    "title": "SoundPEATS Magnetic Wireless Earbuds Bluetooth Headphones Sport in-Ear Sweatproof Earphones with Mic (High Fidelity Sound, IPX6, Bluetooth 4.1, aptx, 8 Hours Play Time, Secure Fit Design)- Black",
    "brand": "SoundPEATS",
    "feature": [
        "[IPX6 Sweat Resistant]: SoundPEATS sweat resistant IPX6 level prevents the sports earphones from sweat or light rains and perfect for outdoor activities, such as jogging, running, camping, hiking, weight-lifting and so on.",
        "[Stereo Sound Quality]: 10MM speakers combined with bluetooth 4.1, APTX codec and CSR8645 chip create HD and lossless music. So you can enjoy the superb clear and stereo music with great bass.",
        "[Long Lasting Battery Life]: After 1-2 hours charging you will get 8 hours music playtime (Playtime varies from volume level and audio content). There is a battery indicator showing on the IOS phone screen",
        "[IPX6 Sweat Resistant]: SoundPEATS sweat resistant IPX6 level prevents the sports earphones from sweat or light rains and perfect for outdoor activities, such as jogging, running, camping, hiking, weight-lifting and so on.",
        "[Stereo Sound Quality]: 10MM speakers combined with bluetooth 4.1, APTX codec and CSR8645 chip create HD and lossless music. So you can enjoy the superb clear and stereo music with great bass.",
        "[Long Lasting Battery Life]: After 1-2 hours charging you will get 8 hours music playtime (Playtime varies from volume level and audio content). There is a battery indicator showing on the IOS phone screen",
        "[Magnetic Design&Secure Fit]: The built-in magnets prevent the wires tangling together, so you can attach the earbuds together when not in use and wear it like a necklace. It is very convenient when you are doing exercises. In addition, there are 5 different size of ear tips(XS/S/M/L/XL) and 3 pairs of ear fins, offering you a comfortable fit experience.",
        "[In-line Mic&Button Control]: You can enjoy hands free phone calls, manage volume and music track easily and efficiently with the in-line microphone and button control. Attention: When you charge the earphones, please make sure that the current should be under 1A. SoundPEATS offer every single product from our shop 12 months warranty to guarantee the enjoyment of your purchase."
    ],
    "description": null,
    "price": 2899.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 25.0,
        "length": 200.0,
        "width": 200.0,
        "height": 80.0
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B076T3P91H",
        "B07CQCVNBJ",
        "B075NRNZWD",
        "B07B93BTJ5",
        "B07DN9QRYK",
        "B07CKP78W3",
        "B07BQCTYML",
        "B079Z1YZT2",
        "B01L160DLW"
    ],
    "rating": null
}