{
    "asin": "B0796SS7DL",
    "title": null,
    "brand": "L3 Tech",
    "feature": [
        "PREMIUM HARD EVA CASE--The Hard Case for your Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones is made of premium hard EVA to provide durability and a long-lasting performance. (for sale is case only, device and accessories are not included).",
        "Fluffy fabric lining -- extra soft, anti-static, shockproof layer and fluffy fabric inner layer, the product can effectively absorb impacts and reduce damages caused by accidentally bumping. And the case protects your Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones from dust, scratches, scuffs, shock, crush and moisture.",
        "CONVENIENT DESIGN: Steady hand strap for portability, Inner design perfect for accessories. Smooth but strong 360 degree zipper for easy to opening and closing.",
        "PREMIUM HARD EVA CASE--The Hard Case for your Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones is made of premium hard EVA to provide durability and a long-lasting performance. (for sale is case only, device and accessories are not included).",
        "Fluffy fabric lining -- extra soft, anti-static, shockproof layer and fluffy fabric inner layer, the product can effectively absorb impacts and reduce damages caused by accidentally bumping. And the case protects your Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones from dust, scratches, scuffs, shock, crush and moisture.",
        "CONVENIENT DESIGN: Steady hand strap for portability, Inner design perfect for accessories. Smooth but strong 360 degree zipper for easy to opening and closing.",
        "PERFECT FIT: We've designed the case to fit your Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones Over-Ear Headphones. And specifically designed mesh pocket perfectly for cable and other small accessories.",
        "EASY TO CARRY: This hard case for Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones is lightweight and compact can fit in your bag, backpack or luggage and convenient to take anywhere.- Backed by 100% Money back Guarantee, this is totally risk-free buy. CLICK the Orange button to Order Now!"
    ],
    "description": "These carrying case act as protective travel cases which compatible with Beats Solo2 / Solo3 & Beats Studio Wireless On-Ear Headphones. Portable design, convenient to carry, for taking your Headphones ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 41.25,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B071R1XCF5",
        "B01L160DLW",
        "B01G9U51L2",
        "B01FVIC7TC",
        "B00RNTTQ06",
        "B06ZZ1Q52R",
        "B078Z855TH"
    ],
    "rating": null
}