{
    "asin": "B079KWGCVR",
    "title": "Hoont Electric Indoor Bug Zapper Bulb Killer Catcher Trap – Fits All Standard Bulb Sockets - Covers 500 Sq. Ft. / Fly Killer, Insect Killer, Mosquito Killer – For Residential and Commercial [UPGRADED]",
    "brand": "Hoont",
    "feature": [
        "POWERFUL FLY & INSECT CONTROL – The Hoont Bug Zapper Bulb Fly Killer features a high intensity ultraviolet bulb that attracts all pesky flying insects into the device. Insects then make contact with an extremely powerful high voltage electrically charged metal grid, instantly killing them. Kills a limitless amount of insects. Get rid of all flying insects and bugs!",
        "SAFE & CLEAN – The Hoont Bug Zapper Bulb Fly Killer Trap fits into all standard bulb sockets; can be used in ceiling sockets, lamps, wall sockets, etc. Dead insects get collected at the tray at bottom of unit, which can then be easily removed for cleaning and bug disposal. Safe to operate 24/7. Non-clogging and easy to clean electric grid.",
        "EFFECTIVE & LARGE AREA COVERAGE – Designed to spread light in all four directions, and provides 360 degrees fly eliminating protection. Effective for a large area of up to 500 sq. feet! Perfect for home, office, kitchens, restaurants, schools, hospitals, etc. or for commercial and industrial use. Protects and prevents against annoying and disease carrying flies and insects!",
        "POWERFUL FLY & INSECT CONTROL – The Hoont Bug Zapper Bulb Fly Killer features a high intensity ultraviolet bulb that attracts all pesky flying insects into the device. Insects then make contact with an extremely powerful high voltage electrically charged metal grid, instantly killing them. Kills a limitless amount of insects. Get rid of all flying insects and bugs!",
        "SAFE & CLEAN – The Hoont Bug Zapper Bulb Fly Killer Trap fits into all standard bulb sockets; can be used in ceiling sockets, lamps, wall sockets, etc. Dead insects get collected at the tray at bottom of unit, which can then be easily removed for cleaning and bug disposal. Safe to operate 24/7. Non-clogging and easy to clean electric grid.",
        "EFFECTIVE & LARGE AREA COVERAGE – Designed to spread light in all four directions, and provides 360 degrees fly eliminating protection. Effective for a large area of up to 500 sq. feet! Perfect for home, office, kitchens, restaurants, schools, hospitals, etc. or for commercial and industrial use. Protects and prevents against annoying and disease carrying flies and insects!",
        "PESTICIDE, CHEMICAL & ODOR FREE – Get rid of all flying insects and bugs without the use of pesticides or dangerous chemicals. Maintenance free and easy to use; simply plug in the bug zapper and watch the device eliminate all pesky and annoying flies by electrocuting them in the metal grid.",
        "SPECIFICATIONS – For indoor use, or outdoors where unit will stay dry. / Power: 7 Watts / Size: 7” x 4” / Bulb Base: Standard (E26) 110v screw base / Bulbs: 1 High-intensity UV bulb (replaceable) / Upgraded for top performance."
    ],
    "description": "The Hoont Bug Zapper Bulb features a high intensity ultraviolet bulb that attracts all pesky flying insects into the device. Insects then make contact with an extremely powerful high voltage electrica ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 75.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B079J6S8G3",
        "B07BNKC5N5",
        "B07BFSPDK5",
        "B07B2MTTC3",
        "B079YTQL4L",
        "B071WC49TL"
    ],
    "rating": null
}