{
    "asin": "B07B5YD8X2",
    "title": "RhinoShield Bumper Case for Galaxy S9 Plus [CrashGuard] | Shock Absorbent Slim Design Protective Cover - Compatible w/Wireless Charging [3.5M / 11ft Drop Protection] - Black",
    "brand": "RhinoShield",
    "feature": [
        "✔️ [WORRY-FREE PROTECTION] – With our proprietary RhinoShield impact resistant technology, you never have to worry about breaking that valuable glass-backed phone. Proven with multiple drop tests and certified military grade (MIL-STD 810G) – our custom ShockSpread polymer material absorbs impact of at least 3.5m/11 feet. The case’s inner honeycomb structure provides an additional 10% defense against knocks.",
        "✔️ [MINIMAL DESIGN] – The unique bumper case design does not cover up your phone’s back, giving you the choice to enjoy the device’s original design or slap on a skin for a personalized look. Despite the exposed back, the subtle raised lip provides protection for the back glass and camera housing, so that the case – not the phone – takes the hit when dropped.",
        "✔️ [SLIM & USER-FRIENDLY] – At under 2.8mm/0.1 inch thin and 16 grams/0.6 ounces light, RhinoShield CrashGuard is one of the thinnest and lightest tough cases around. The slim, unobtrusive bumper gives you a snag-free experience, sliding into your pocket easily. A matte, stain resistant coating improves grip, while scuff and ink marks are easy to clean. The improved buttons are more responsive, with good tactile feedback.",
        "⚠️ [COMPATIBILITY] – Compatible with ✔️ Galaxy S9 Plus ✔️, Qi Wireless chargers and most back skins. Precision cutouts for all ports, fits most cables. For better all-round protection, we strongly recommend pairing this product with the RhinoShield Tempered Glass Protector, just in case the phone falls face-down on a pointed object or highly-uneven surface.",
        "✔️ [NEXT GENERATION MATERIAL] – Our ShockSpread polymer is extremely durable. The case can bend without breaking or permanent loosening (especially during installation and removal), unlike traditional polycarbonate or TPU cases. It is also safer for you and your family, as it is BPA/BPS/BPF free AND passes FDA food-grade requirements. This case is 100% recyclable."
    ],
    "description": "Marriage of protection and aesthetic. The RhinoShield Bumper Case for Samsung Galaxy S9 Plus will protect your phone from everyday knocks and drops while still letting you enjoy the full beauty of your device. This RhinoShield Bumper Case is built from our New ShockSpread third generation proprietary polymer blend offering you excellent drop protection by absorbing shocks. The case follows the exact contour of the body of the S9 Plus. Buttons are fully functional and are easily accessible with compatibility with most headphones and third party charging accessories.Feeling your beautifully curved device in your hand with added protection and customization! The case weights around 16 grams, which is much lighter than any rugged cases. We want to provide maximum protection at minimum weight.\"",
    "price": 2499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 18.0,
        "length": 650.0,
        "width": 310.0,
        "height": 50.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41lGRVqoP-L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51Up7mdssJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51YY2BL7VFL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41V1wHBpYlL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51dPpis61nL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/514ShoXgjKL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "2335752011",
            "title": "Cell Phones & Accessories"
        },
        {
            "node": "2407760011",
            "title": "Cases, Holsters & Sleeves"
        }
    ],
    "similar": [
        "B07BJYYVKN",
        "B078BF68T2",
        "B07C9FX2X8",
        "B079BZ2TD8",
        "B06Y69VDLS",
        "B07BW6X6QL",
        "B07DNNKGTX",
        "B07BDKVBVM",
        "B0777L3TVQ",
        "B07BDHLLCP",
        "B079H6RLKQ",
        "B07F6X3853",
        "B07CNKJKLL",
        "B079YF5VS7",
        "B071CDK5WD",
        "B07BJ1KKFN",
        "B071KZCTR8",
        "B07BMSMFC8",
        "B07B64H1PB",
        "B07BGZ1QC7",
        "B06XWZWYVP",
        "B07BLYTKQR",
        "B07B9NXL2B",
        "B07B464SWH",
        "B079QWT9H5",
        "B079YC1TRH",
        "B075L7LJSC",
        "B07BS1C43T",
        "B07F8P7JT6",
        "B079DPX5R3",
        "B07FY1YCX3"
    ],
    "rating": "3.5"
}