{
    "asin": "B07BGZ4NZL",
    "title": null,
    "brand": "Apello",
    "feature": [
        "【SOLAR MOLE REPELLER】: The mole repellent send out sonic pulses and vibrations every 30 seconds, which highly irritating to mole, gopher, vole repellant and other underground burrowing rodents to flee away from the coverage area. The repeller can be kept at there to continue to discourage the return visits.",
        "【HUMANE and SAFE】: Be safe to use around pets and human, no chemicals or mole poison. This chipmunk repellent repels pesky rodents in a humane way. No mole trap, no mole killer, no dispose of the body. Free of mole poison, safe for soil environment and nearby planting.",
        "【EFFICIENT SOLAR CHARGE】: Powered by a rechargeable solar cell, no need for extra batteries. An energy-saving and environment-friendly mole repeller solar powered with non toxic and maintanence free. It's almost the simplest way to get rid of moles, gopher repellent and voles.",
        "【SOLAR MOLE REPELLER】: The mole repellent send out sonic pulses and vibrations every 30 seconds, which highly irritating to mole, gopher, vole repellant and other underground burrowing rodents to flee away from the coverage area. The repeller can be kept at there to continue to discourage the return visits.",
        "【HUMANE and SAFE】: Be safe to use around pets and human, no chemicals or mole poison. This chipmunk repellent repels pesky rodents in a humane way. No mole trap, no mole killer, no dispose of the body. Free of mole poison, safe for soil environment and nearby planting.",
        "【EFFICIENT SOLAR CHARGE】: Powered by a rechargeable solar cell, no need for extra batteries. An energy-saving and environment-friendly mole repeller solar powered with non toxic and maintanence free. It's almost the simplest way to get rid of moles, gopher repellent and voles.",
        "【WATERPROOF and DURABLE】: Waterproof and corrosion-resistant aluminum and ABS flame retardant material also applies to rainy days. Insert mole repellant into the soil, and make sure the top part is about 2 inches above the ground to avoid water flowing into the interior.",
        "【WIDE COVERAGE】: A sonic mole repeller solar mole chaser radiates in all directions. It's recommended to use multiple devices to overlap providing even more coverage. A solar powered mole repeller that you can install it anywhere in your yard, garden or lawn with sun exposure. Solar cell can be fully charged in 8 hours and last for 5 days."
    ],
    "description": "Effective Solar Mole Repellent: This ultrasonic pest repeller mole repellant produces 400Hz low frequency harmless sound waves and vibrations day and night to penetrate the soil and repel mole, gopher ...",
    "price": null,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 237.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": null,
    "attributes": null,
    "categories": [],
    "similar": [
        "B07FPPHB9Y",
        "B07GPRQQPZ",
        "B07F8PJM5Z",
        "B07F8PT66V"
    ],
    "rating": null
}