{
    "asin": "B07B9VGX7X",
    "title": "Cuoka Sterling S925 Silver Blue Love Heart with Owl Pendant Necklaces for Mom Jewelry Women Necklace",
    "brand": "Cuoka",
    "feature": [
        "💎[Design Inspiration] owl symbolizes wisdom, bravery and nobleness,Lucky Love Heart Owl Necklace,Simple and strong fatherly love, maternal love and friends, sister friendship.It will be a very nice gift for the person you love.",
        "💎[925 Sterling Silver] Box chain 18\" and owl pendant are made of 925 Sterling Sliver. The processing technology of 925 silver is different from that of pure silver. Its brightness and luster are closer to those of platinum, and its hardness is also better than that of pure silver. it's nickel-free, lead-free, cadmium-free and passed Swiss SGS Inspection Standard, Sterling Sliver is corrosion-resistant can applies to sensitive skin",
        "💎[5A Cubic Zircon] Owl pendant necklace plated with cubic zircon. Our 5A cubic zircon with high refractive index, high gloss, high density and typical spectral features. Cubic Zircon is the December birthstone, symbolizes success",
        "💎[Brand Guarantee] Cuoka is professional production of jewellery products. We promise 30 days money free back, 18 months warranty and lifetime dedicating support to assure your long-term enjoyment",
        "💎[Pretty Size] Pendant Size: 20*15mm/0.79*0.59 inch.Pendant Weight:4.28g.Chain Length:18 Inch.Chain Width:0.8mm.super strong Box chain with spring clasp, It is a significant piece you can give to anyone special in your life"
    ],
    "description": "Sterling Silver blue birthstone owl Pendant + 18'' silver box chain ★Features: Pendant Size:0.78*0.6 Inch / 20*15mm Pendant Weight:4.28g Chain length:18 Inches Package information: 1x S925 owl Pendant 1x S925 box Chain 1x Silver Cleaning Cloth 1x Gift Box ★Brand: In 1999 when Cuoka Jewelry Company first opened it's doors, a tradition of unsurpassed Service,Quality, and Value was born. However, the Cuoka tradition of excelling in the jewelry industry began long before that.Cuoka purchased his first factory in 1997, as the years passed, Cuoka piloted 4 factories and 4 stores into famous jewelry chains,but that tradition became more and more entrenched in how we approach our business. We provide an Unconditional 30-day Money-back Guarantee. If you are not completely satisfied. Our online store is an extension of the selection, service and professionalism customers experience in any of jewelry stores. As a progressive, customer-driven company, we are dedicated to making jewelry buying even more comfortable, convenient and satisfying for our guests. ★Caring for Sterling Silver Necklace: Rub it with baby wipes: they perform miracles on jewelry. Then rub with a clean dry soft cotton cloth to bring back the shine. Put it inside a soft cloth pocket or fabric swath,avoid it from rubbing against other jewelry. To better maintain your sterling silver Pendant Necklace,please take it off when you swim,take a shower,or other action involved in water. ★Topnotch customer service: 100% satisfaction and money back guarantee. This exquisite women necklace gives you a totally fresh impression.Just be happy to add this necklace to your jewelry collection .",
    "price": 2359.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 10.0,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51HxabxX4xL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41gorp%2B3sHL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51huHbmXvpL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41vALiFO96L._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51BVrKZ2g1L._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41D6Q3bb-3L._US40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147440011",
            "title": "Women"
        },
        {
            "node": "7192394011",
            "title": "Jewelry"
        },
        {
            "node": "7454927011",
            "title": "Necklaces"
        },
        {
            "node": "7454933011",
            "title": "Pendants"
        }
    ],
    "similar": [
        "B07F6YYP2D",
        "B06Y4KXVBY",
        "B07255RB8T",
        "B07CQ5M3WG",
        "B0768FB39W",
        "B009YB7JBY",
        "B01MTPB15T",
        "B073GPX5Q7",
        "B01MQVVY4Y",
        "B071NJ1QB2",
        "B078VCHW85",
        "B0795FGT1N",
        "B07BHQW8JX",
        "B0795RHX8W",
        "B00HQP2IZC",
        "B01AIUEV8I",
        "B071HWLNDY",
        "B073LTQLR4",
        "B077VN45T7",
        "B00NX2869E",
        "B071G19HDB",
        "B075QHJR26",
        "B07CHLZ92L",
        "B005T6X354",
        "B0797M24FT",
        "B073C75KP1",
        "B0716NV8S8",
        "B077GKJJYW"
    ],
    "rating": "5.0"
}