{
    "asin": "B07BY1CYNB",
    "title": "Odec AA Rechargeable Batteries, Deep Cycle 2450mAh Ni-MH 1.2V Battery Pack - 16 Pack",
    "brand": "Odec",
    "feature": [
        "Super long life up to 1200 cycle, convenient and more affordable than thousands of alkaline batteries",
        "Battery storage case allows you to safely store your batteries when not in use",
        "With Odec 2450mAh ultra strong power, your device will operate longer and perform well",
        "Safety and eco-friendly, no pollution to the environment benefits from the Ni-MH cell",
        "Odec batteries are perfect for use in household devices like digital cameras, toys, remote controls,hand held games, flashlights,alarm-clocks, LCD-TVs, Toothbrushes, Shavers and portable audio players"
    ],
    "description": "Odec 2450mAh AA Ni-MH batteries are added with mix-protection additive to protect the material from degradation in the progress of charge and discharge. These batteries are great for use in your household products such as wireless gaming devices, digital cameras, toys, remote controls, flashlights, alarm-clocks, portable audio players, toothbrushes, shavers, wireless mouse and keyboards and more. 1. It is good both in low and high temperature operations. 2. Battery storage case allows you to safely store your batteries when not in use. 3. Reusable, convenient and more affordable than thousands of alkaline batteries. 4.Batteries can be recharged when fully, or partially discharged. Can be recharged 1200 times. 5. Ni-MH eco-friendly cell, doesn't contain Hg/Cd/Pb, makes no pollution to the environment. Battery Type: Ni-MH Rechargeable times: Up to 1200 times Battery Size: AA Items Dimension: 1.985 x 0.570 Battery Capacity: 2450 mAh Voltage: 1.2 V Battery come with low power due to transport security, it may reach top performance after 3 cycles of full charge and discharge. For better use, it is recommended to fully charge the batteries before the first use；and for long-term storage, please retain 50% charge at least. High capacity rechargeable batteries are a bit bigger than alkaline ones. Clean the battery contacts using a cotton swab with alcohol when necessary, keeps an efficient connection to the device. We recommend using the battery at least once a month, long term idle may shorten battery's life. Store it in a clean, dry, cool place away from heat and metal objects. 16 pack AA rechargeable batteries 100% Odec guaranteed product satisfaction. All Odec products come with 30 days money back.",
    "price": 2299.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 105.0,
        "length": 430.0,
        "width": 260.0,
        "height": 160.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51gKXTzIgrL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41OmwTBxW1L._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51LChd4yLEL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/514gQFY7eKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41k69EKAJJL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51PJkmeUScL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/5164bBqFkCL._SS40_.jpg"
    ],
    "attributes": null,
    "categories": [
        {
            "node": "3760901",
            "title": "Health & Household"
        },
        {
            "node": "15342811",
            "title": "Household Supplies"
        },
        {
            "node": "15745581",
            "title": "Household Batteries"
        },
        {
            "node": "389577011",
            "title": "AA"
        }
    ],
    "similar": [
        "B00HZV9WTM",
        "B079K2KHMJ",
        "B018VALFHC",
        "B00LHSAARW",
        "B00DNPT1AO",
        "B074KJJ2RY",
        "B074RZG99S",
        "B019GT5370",
        "B019GJQCE8",
        "B00OT7HSBO",
        "B019GWZE30",
        "B00EB7812C",
        "B019H28OZE",
        "B00CWNMV4G",
        "B01NBN7PZI",
        "B07F9NHXGR",
        "B07BKV793P",
        "B007B9NV8Q",
        "B07GGTRSB2",
        "B076DVHL8H",
        "B00X52IIVI",
        "B07BHMLY3L",
        "B001ALYTFK",
        "B00IA8M42G",
        "B019MC7GBM",
        "B004SCA15K",
        "B009NEKAEA",
        "B00KQ2L9NY"
    ],
    "rating": "3.9"
}