{
    "asin": "B07C26GRMY",
    "title": "KomForme Kids Rain Boots, Waterproof Rubber Printed with Handles in Various Prints and Different Sizes",
    "brand": "KomForme",
    "feature": [
        "100% rubber",
        "✔[Playing Carefree]KomForme Kids Rubber Printed Rain Boots are designed to keep up with kids’ running, skipping, jumping, in the meantime, high quality and environmentally friendly materials ensure products non-toxic. Mould emboss sole for non-slip; Elastic rubber for flexible movement.",
        "✔[Comfortable and Chic Design]KomForme Kids Rubber Rain Boots are made from 100% rubber exterior for waterproof and durable; 100% cotton interior for maximum comfort and warmth. Various prints in cartoon are newest design such as puppy, dinosaur, shark, spacecraft, pirate, crocodile to choose.",
        "✔[Easy to Put on and Carry]Design rain boots shape by kids chubby feet, kids can get them on without a struggle by themselves. With two handles on uppers, kids can carry them easily to go anywhere. Packaging in non-woven bag, has an advantage of easy restore.",
        "✔[Durable as A Long Time Company]Sturdy rubber and solid joints for preventing glue opening. Ordinary motion will not make any structural problems. While they are dirty, just clean with running water.",
        "✔[Seasonal and Dry Wet Amphibious Use]The rain boots match most raincoats and umbrellas perfectly, in addition, they work great with thin or thick socks allowing for flexibility in seasonal use. Actually they apply to accustomed haunts of kids, no matter wet or dry, scorching or freezing."
    ],
    "description": "Jida Shoes Co.,Ltd was founded in 2015, is a specialized footwear manufacturer and trading company.Our company specializes in designing, manufacturing and developing all kinds of shoes, such as advanced slippers, sports shoes, baby shoes and so on. According to the international industry standard, we adopt advanced production equipment and processing technology to ensure that all shoes have good quality such as environmental protection, flexibility, comfort, innocuity and so on.It takes \"Keep company with you forever, with all my enthusiasm\" as the concept. We are committed to technological innovation and quality service, and strive to provide high-quality products for our customers.♥Rubber upper and sole♥Handles for easy on and off♥Deep tread patterns in sole♥Newest design prints in cartoonThis item is of standard size. To get the best fit in rain boots, it is best to measure bare foot. To do this, measure kids’ bare foot from heel to longest toe.Please store boots in cool and dry places when not need, avoid direct sunlight.1xNon-woven bag1x rainboots(pair)9.8 x 7.8 x 4.7 inches1.9 pounds",
    "price": 1998.9999999999998,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": null,
        "length": null,
        "width": null,
        "height": null
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/51Kd0oXBxwL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51fTn6pYNsL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51FDIuiPsoL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51HxvGssEsL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51hjhzGfByL._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51bmIPD1N7L._US40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51nCNRbN9CL._US40_.jpg"
    ],
    "attributes": [
        {
            "name": "Size:",
            "value": "12 M US Little Kid"
        },
        {
            "name": "Color:",
            "value": "Robot Party"
        }
    ],
    "categories": [
        {
            "node": "7141123011",
            "title": "Clothing, Shoes & Jewelry"
        },
        {
            "node": "7147443011",
            "title": "Boys"
        },
        {
            "node": "679182011",
            "title": "Shoes"
        },
        {
            "node": "6127764011",
            "title": "Outdoor"
        },
        {
            "node": "3420547011",
            "title": "Rain Boots"
        }
    ],
    "similar": [
        "B07D5JQ17K",
        "B07FMKMX9Y",
        "B01NCMMQRK",
        "B07C1H15FP",
        "B079ZSS6DZ",
        "B00T8Y408W",
        "B07F2MCMMY",
        "B00URU1BX8",
        "B07B8S689P",
        "B07B8VC8XZ",
        "B078TH3N9T",
        "B07D4939Y9",
        "B079ZTY9X2",
        "B074CFM4GR",
        "B000OZTA4I",
        "B073VHX86V",
        "B07BKPBJS3",
        "B07GPKZYZW",
        "B07GVHHB7L",
        "B07F9RZ4MS",
        "B07F37ZR3L",
        "B0799L3K5B",
        "B07CBTRCLL",
        "B075XCGXXT",
        "B072L88HG1",
        "B0741682VB"
    ],
    "rating": "5.0"
}