{
    "asin": "B07CJHM582",
    "title": "Boogie Board Jot 8.5 LCD eWriter (Pink w/Sleeve)",
    "brand": "Boogie Board",
    "feature": [
        "Boogie Board Bundle Includes:",
        "1 x Boogie Board Jot 8.5 LCD eWriter, Pink (J34420001)",
        "Ultra-bright LCD writing surface is 50% brighter than previous models. Writing experience is comparable to pen on paper. Now with a Replaceable Coin-Cell Battery. Integrated magnets allow for easy mounting to compatible surfaces. Pressing the erase button clears the image and lets you start all over again. Built-in stylus dock provides convenient storage for stylus when not in use and stylus can be used as a kick-stand.",
        "1 x Boogie Board Sleeve for Jot 8.5 (JSG310001) Black",
        "Protects your Boogie Board from shock and scratches. Prevents the screen from getting marked up in your purse or bag. Compatible with 8.5-Inch Boogie Board only. NOTE:The green marks displayed on the writing screen are caused during shipment from the packaging rubbing against the screen, these marks can be erased by pressing the erase button."
    ],
    "description": "Boogie Board Jot 8.5 LCD eWriter, Pink (J34420001) & Boogie Board Sleeve, Black (JSG310001) Bundle. Writing experience is comparable to pen on paper, Replaceable coin-cell battery. Now with 50 percent brighter writing, Boogie Board eWriter eliminates the need for paper, scratch pads and sticky notes-simply write and erase. Integrated magnets allow for easy mounting to compatible surfaces. Boogie Board Jot 8.5 does not require power to create or maintain an image, no on/off button is necessary. Pressing the erase button supplies a small amount of power to clear the image. Built-in stylus dock provides convenient storage for stylus when not in use. Stylus can be used as a kick-stand to display your written messages to family, friends and co-workers. Please refer the User Guide before use. ( Boogie Board Jot App Letting You Keep What You Create. Download the free App to your mobile device. Supports both Android and iOS devices. While in the App, use your device's camera to scan the Jot 8.5 screen. The App will automatically separate your writing from the background and save it as a black and white file. Edit and save the file and share it, from wherever you are! ) ---- NOTE: The green marks displayed on the writing screen are caused during shipment from the packaging rubbing against the screen, these marks can be erased by pressing the erase button.",
    "price": 3499.0,
    "listPrice": null,
    "prime": true,
    "dimensions": {
        "weight": 55.00000000000001,
        "length": 900.0,
        "width": 580.0,
        "height": 20.0
    },
    "images": [
        "https://images-na.ssl-images-amazon.com/images/I/41evEUl4fKL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41AX1QhRwaL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41SsdYXUCVL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51DIGHbc3ML._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/41yFYz8vnvL._SS40_.jpg",
        "https://images-na.ssl-images-amazon.com/images/I/51prIO2SbNL._SS40_.jpg"
    ],
    "attributes": [
        {
            "name": "Color:",
            "value": "1"
        }
    ],
    "categories": [
        {
            "node": "172282",
            "title": "Electronics"
        },
        {
            "node": "541966",
            "title": "Computers & Accessories"
        },
        {
            "node": "172456",
            "title": "Computer Accessories & Peripherals"
        },
        {
            "node": "172493",
            "title": "Input Devices"
        }
    ],
    "similar": [
        "B0056B131I",
        "B07CJNLLB7",
        "B010HWC6B6",
        "B01HHV3F3I",
        "B07DC3Z557",
        "B076B1FL41",
        "B00E8CIGCA",
        "B010HWCEVS",
        "B079Z2CG9R",
        "B07DWM2K3L",
        "B07DKFSGY4",
        "B07FV5ZN76",
        "B07C74W46L",
        "B010HWC6Q6",
        "B07CKHKQVX",
        "B076B6JCXF",
        "B01M9AQE81",
        "B072336VDN",
        "B01IB1HIY0",
        "B010HWCEAO",
        "B0186HGF02",
        "B07DLRMG95",
        "B010HWCEFY",
        "B07B4F3VG3",
        "B07D7GXHRB",
        "B00E8CIGFC",
        "B079M6Y16G",
        "B01N0D19TE",
        "B010HWCE0O",
        "B015AD1PS2",
        "B01FZMOUQM",
        "B01HDUVLAW"
    ],
    "rating": "3.6"
}